[
	{
		"devotion_id":0, 
		"devotion_title":"Title 0",
		"devotion": "“My people are destroyed for lack of knowledge: because thou hast rejected knowledge, I will also reject thee, that thou shalt be no priest to me: seeing thou hast forgotten the law of thy God, I will also forget thy children.” (Hosea 4:6). The scripture says that in the days of Hosea the people were not keen to hear the truth. They were occupied with several other activities. In these days too we see how Christians are held in bondage by the traditions of man. It grieves ones heart to see that knowledge of the truth of the Holy God of Israel is not with them. Some Christians reject God’s Word but they most gladly receive the traditions held by their forefathers. They reject the truth because it is not according to what they have been taught. The above Scriptures say that because they have rejected knowledge God has also rejected them! We cannot afford to reject His Word. In the book of Thessalonians we read, “And for this cause (lack of a love for the truth) God shall send them strong delusion that they should believe a lie.” (2 Thess 2:14). It is because many Christians have no real love for the truth and because they do not love what God would minister to them from the Word of God that the Lord will send other influences among them. Such as these will be led to believe lies.",
		"bible_reading": "2 Kings 18:13-19:37 \n Acts 21:1-17 \n Psalm 149:1-9 \n Proverbs 18:8",
		"image_url": "Empty at the moment",
		"today_command": "Matthew 7:15 Beware of false prophets, which come to you in sheep's clothing, but inwardly they are ravening wolves."
	},
	{
		"devotion_id":1, 
		"devotion_title":"Title 1",
		"devotion": "“Son of man, prophesy against the prophets of Israel that prophesy, and say…O Israel, thy prophets are like the foxes in the deserts.” (Ezek 13:2,4 KJV). The prophets like foxes enjoy staying amongst foxes in the wilderness. And the Lord says, that these prophets enjoy being in that condition. There is no other way for them. They are happy to stay in the wilderness and amongst ruins which are their habitat. But the Son of Man has no place to lay His head!! In the days of Jesus there were many foxes and they had their own ‘holes’ to live in! They had their own religious places where they felt at ease and comfortable. But the Son of Man, who owns the whole earth, did not have a place to lay His head! The Lord had no place to dwell! How tragic, beloved! Just as a strong magnet is able to attract bits of iron from a heap of rubbish, so also we should become magnets in the church of the Living God. Whether we are two or three in number, when we give ourselves to God’sWord, we shall become magnets. There are many thousands in every city in this land who are tired of the traditions of man. They have been taught to participate in religious activities. They are confused in their minds. They are afraid of religious heads. Such ones shall come out and be joined to the living church through magnets like us.",
		"bible_reading": "2 Kings 20:1-22:2 \n Acts 21:18-36 \n Psalm 150:1-6 \n Proverbs 18:9-10",
		"image_url": "Empty at the moment",
		"today_command": "But be ye doers of the word, and not hearers only, deceiving your own selves. James 1:22"
	}, 	
	{
		"devotion_id":2, 
		"devotion_title":"Title 2",
		"devotion": "Let us not opt for ‘convenience’ but let us be built according to the Word of the Lord. To receive anything from God, we must first submit ourselves to the Word. Then the Lord will reveal Himself to us. Chapter six of the book of John is a good example of this. Lord Jesus spoke to the people who came in their boats to seek Him, and told them that in reality they had not come to follow Him, but they had come to eat some bread and fish. He said to them, ‘labor not for the meat that perisheth (outward things) but (labour) for the that meat that endureth unto everlasting life….” ( Jn 6:27). He told them that He had yet another meat to eat and that was to do the will of His father. And not only that – but also to complete it ( Jn 4:34). The people could not understand all this. They began to reason in their hearts. Then Jesus said, “I am that manna that your fathers ate” ( Jn 6:49- 51). But the people could not receive this truth. It was still difficult for them to understand. Then He said, “I am the living bread”. But the people were filled with unbelief. They said, “How can this man give us His flesh to eat?” They said that they knew His brothers and sisters. He was but a carpenter’s son and now He claimed that He was the bread that came from heaven. “O what a terrible blasphemy!” they said. And they were about to stone Him to death!",
		"bible_reading": "2 Kings 22:3-23:30 \n Acts 21:37-22:16 \n Psalm 1:1-6 \n Proverbs 18:11-12",
		"image_url": "Empty at the moment",
		"today_command": "Follow after charity, and desire spiritual [gifts], but rather that ye may prophesy. 1Corrinthians 14:1"
	},
	{
		"devotion_id":3, 
		"devotion_title":"Title 2",
		"devotion": "A marriage in the family truly reveals whether we are still bound by the traditions of men or not. A believer who had several domestic problems including that of the marriage of his daughters once asked me for my counsel. I encouraged him and told him to be a radical man for the truth. He was very much worried and anxious. ‘What shall I do?’ he asked, ‘If one wants a bridegroom with an engineering degree, one has to give lakhs of Rupees!” oh, how terrible are men’s traditions. A father who decides to bow down to such traditions would never be able to lift his head again. My beloved brothers and sisters, when we are faced with such situations we have to be right of top…number one in humility, number one in submission and number one in not compromising the truth. That is how we have to maintain a true balance of God’sWord. TheWord of God says, “If any man lacks wisdom, let him ask of God who will freely give it to him.” We are surrounded by believers who say that they are not bound by traditions but who are in fact bound by traditions. And when life’s circumstances come their way, then they realize that their hands are bound. We are all aware that today many social evils are taking place in the name of marriage. I encourage parents and young men and women to stand for God’sWord.",
		"bible_reading": "2 Kings 23:31-25:30 \n Acts 22:17-23:10 \n Psalm 2:1-12 \n Proverbs 18:13",
		"image_url": "Empty at the moment",
		"today_command": "Cut it off and throw it away (if you hand causes you to sin) – Matthew 5:30"
	},
	{
		"devotion_id":4, 
		"devotion_title":"Title 2",
		"devotion": "I remember when I was born again I was exceedingly joyful and carried a NewTestament wherever I went. But when I began to read about various truths in the Word of God then I began to realize that I was still bound by what I had heard and experienced earlier! I was not able to take in the hard truths of the Bible into my life. I realized that I was bound by the teaching of traditional churches. I could not go into the waters of baptism. Then when I began to see the truth, the truth set me free and I walked into the waters of baptism. When we see the truth of God’s Word, and begin to notice that there are some traditions that keep us bound! And if and when we cry out to God, “Lord, I see that there are unseen fetters that are binding me.” Then those fetters will surely fall away and we shall begin to walk in the truth of God’sWord. Some people accept their defeat in various situations as inevitable and as something ordained by God from which there is not running away. They think that there is no way out from their situations. But there are still some who cry out, “Lord, there is surely a way out. Lord, I trust in you; show the way.” And the Lord does indeed answer their prayer and show them the way.",
		"bible_reading": "1 Chronicles 1:1-2:17 \n Acts 23:11-35 \n Psalm 3:1-8 \n Proverbs 18:14-15",
		"image_url": "Empty at the moment",
		"today_command": "Get behind me, Satan! – Matthew 16:23"
	},
	{
		"devotion_id":5, 
		"devotion_title":"Title 2",
		"devotion": "When John the Baptist began to preach a great multitude came to the rivers of Jordan for baptism. He told those who were coming forward to be baptized,“you brood of vipers, who warned you to flee from the wrath to come?” (Matt 3:7). The Living Bible explains this verse beautifully. “But when he saw many Pharisees and Sadducees coming to be baptized, he denounced them. “You sons of snakes!” he warned. “Who said that you could escape the coming wrath of God?” (Matt 3:7 TLB) The reason why many people go to church today is because they are afraid of going to hell. If the Father, the Son and the Holy Spirit were to declare that there would be no hell from tomorrow then our churches would be empty! In the days of John, the Baptist, the people were afraid to go to hell and so they went to John to be baptized. But he scolded them. He chastened them for wanting baptism without first repenting; he rebuked them for wanting to take a shortcut and for wanting to avoid hell! Although the same moral conditions prevail in the world today, unfortunately we do not have forthright preachers like John, the Baptist. He was so unlike the preachers of this day.",
		"bible_reading": "1 Chronicles 2:18-4:4 \n Acts 24:1-27 \n Psalm 4:1-8 \n Proverbs 18:16-18",
		"image_url": "Empty at the moment",
		"today_command": "Do not let your left hand know what your right hand is doing (when giving) – Matthew 6:3"
	},
	{
		"devotion_id":6, 
		"devotion_title":"Title 2",
		"devotion": "Many people believe that when Jesus Christ returns in power and glory, He shall in some way cause this earth to be thrown away and that He shall create a new earth wherein He shall rule and reign. But it is not going to be so. We can draw a very good example from the days of Noah.TheWord says, “And God looked upon the earth, and, behold, it was corrupt; and God said, I will DESTROYTHEMWITHTHE EARTH” (Genesis 6:12-13). ‘And I will establish neither shall there any more be a flood to DESTROYTHE EARTH” (Genesis 9:11). Did the Lord really destroy the earth? Did he destroy all the living things upon the earth such as animals and men who lived unrighteously? God wiped out wickedness and unrighteousness from the face of the earth. The Lord didn’t destroy the earth in reality but preserved the earth and also the righteous Noah and his family and two of every living creature. “And God spared not the OLDWORLD but saved Noah” (II Peter 2:5) Here we clearly see the term ‘old world’ being used to denote the days of Noah, which could mean the ‘old earth’. Further we read, ‘Whereby the WORLD THAT THEN was being over flowed with water perished’ (II Peter 3:6). And so when Noah came out of the ark, he entered into a NEW EARTH. We are still living upon the same earth.",
		"bible_reading": "1 Chronicles 4:5-5:17 \n Acts 25:1-27 \n Psalm 5:1-12 \n Proverbs 18:19",
		"image_url": "Empty at the moment",
		"today_command": "You are not to be called ‘Rabbi,’ for you have only one Master and you are all brothers. – Matthew 23:8"
	},
	{
		"devotion_id":7, 
		"devotion_title":"Title 2",
		"devotion": "The traditional teaching that we have been accustomed to is that every Christian enters heaven upon his death. How mistaken our teaching have been, beloved. We enter heaven by virtue of being born again and not by virtue of death! John 3:3 clearly state that, “Except a man be born again, he cannot see the Kingdom of God”. Again in John 3:5, we read, “Except a man be born of water and of the Spirit,he cannot enter into the Kingdom of God”.The Scripture makes it very clear that it is by new birth that we enter into the kingdom of heaven. Yet, many people think of going to heaven at their death. Beloved, we can enter into heaven while we are yet alive. And as many of us are born by the Spirit of God, are in heavenly places in Christ Jesus. We see this in Ephesians 2:5 & 6, “Even, when we were dead in sins. (God) had quickened us together with Christ, (by grace ye are saved); And hath raised us up together and made us sit together in heavenly places in Christ Jesus.” So, where are we today?We are in heavenly places. Praise the Lord! We were formerly dead in sins and trespasses; we were indulging in the desires of the flesh; but God in His mercy brought us back to life, raised us up with Him and helped us to be seated with Him in heavenly places. So even when we are upon this earth we are in the heavenlies with Him. We are seated with Him in heavenly places.",
		"bible_reading": "1 Chronicles 5:18-6:81 \n Acts 26:1-32 \n Psalm 6:1-10 \n Proverbs 18:20-21",
		"image_url": "Empty at the moment",
		"today_command": "Looking diligently lest any man fail of the grace of God; lest any root of bitterness springing up trouble you, and thereby many be defiled; Hebrews 12:15"
	},
	{
		"devotion_id":8, 
		"devotion_title":"Title 2",
		"devotion": "Many people ask for prayer before they get a job, but once they get the job it seems that their wisdom takes over and that God’s wisdom has no further place in their lives. This is the problem. They think that God cannot catch up with today’s technology; that He does not know how computers work! They think that they alone can understand the way their secular, unbelieving boss behaves and that God cannot understand him. So they cease to depend on God’s wisdom. It appears to them that God’s wisdom is old fashioned and out-dated! It is sad that some people come to a place where they cannot know where and when to apply their own wisdom and where and when to have faith in God’s wisdom. It is here that we must make sure that our intellect does not get into the faith that we have——that faith that is based upon His wisdom. It must have the supreme place in us. If we try to mix the faith that He has given us and that operates on His wisdom with the faith that operates man’s wisdom, then it will not work. We are living in a time of intellectual Christianity because intellectualism has entered into Christian life. Intellectual Christianity has reduced everything to a matter of the mind rather than to the matter of life. It has all become a matter of mental gain. This is the erroneous emphasis that is increasing in the church day by day.",
		"bible_reading": "1 Chronicles 7:1-8:40 \n Acts 27:1-20 \n Psalm 7:1-17 \n Proverbs 18:22",
		"image_url": "Empty at the moment",
		"today_command": "Little children, keep yourselves from idols. Amen 1John 5:21"
	},
	{
		"devotion_id":9, 
		"devotion_title":"Title 2",
		"devotion": "God will raise up a remnant who will really bring back the glory and honor that is due unto His name, Undoubtedly, when, God begins to do that, the enemy will also intensify his efforts to, frustrate the establishment of Gods Word. There are Sanballat’s and Tobiah’s; there are the Ammonites and Ashdodites who are conspiring to stand against this work of God (Nehemiah 4:1, 3 & 7). But as Apostle Paul says, “We are not ignorant of the devices of the evil one.” Sanballat in Hebrew means “enemy in secret”. Yes, there is an enemy in secret. Tobiah means, ‘Jehovah is Good’, despite thatTobiah is serving Sanballat!There are many people like Tobiah who say that God has been gracious to them and answered all their prayers they say the Lord is good, He has done many wonders in their lives. Yet, these very people serve Sanballat - they serve the enemy. Some people have good Christian names but they serve the enemy. Many claim that ‘they are believers and are baptized in the Holy Spirit but there is no love for the truth in their hearts. Beloved, the people around us may join hands and get together to say, ‘stone these people’.They may unite to oppose us. Marvel not when these things come to pass in your lives. All those who want to go in the way of truth will suffer persecution. So let us encourage one another to be men who shall stand for the truth in this hour.",
		"bible_reading": "1 Chronicles 9:1-10:14 \n Acts 27:21-44 \n Psalm 8:1-9 \n Proverbs 18:23-24",
		"image_url": "Empty at the moment",
		"today_command": "Have faith in God – Mark 11:22"
	},
	{
		"devotion_id":10, 
		"devotion_title":"Title 2",
		"devotion": "Our Lord, according to the Scriptures, cleansed the temple on two occasions-one at the beginning of His earthly ministry and one toward the end of His ministry. In the first instance Jesus said, “Don’t make My Father’s house a house of merchandise” ( John 2:16); but in the second case Jesus said “Look YOUR HOUSE is left to you desolate,” (Matthew 23:38). That natural house is no more HIS HOUSE but THEIR HOUSE. So He left it to them and walked out. Jesus cleansed the temple but the Jews defiled it. So Jesus walked out of that temple. He walked out of that temple con-cept; the people had made the temple as their place of secu-rity. It is as if they said. “This is the house of God. We can be safe in it (from tax authorities)’. They used the temple for all kinds of activities according to their own will and carnal desires. When Christ began to tell them of a new concept of the temple, it didn’t make any sense to them. Christ was bringing forth a new concept of the temple of God. But they refused to receive His teaching. They rejected the words and thoughts of Jesus in their hearts. They didn’t wish to receive new concepts for they were quite content using their temple for their own carnal purposes. It was no more His house.",
		"bible_reading": "1 Chronicles 11:1-12:18 \n Acts 28:1-31 \n Psalm 9:1-12 \n Proverbs 19:1-3",
		"image_url": "Empty at the moment",
		"today_command": "Do not condemn, and you will not be condemned – Luke 6:37"
	},
	{
		"devotion_id":11, 
		"devotion_title":"Title 2",
		"devotion": "In 2 Kings 18: 4, “And he (Hezekiah) did that which was right in the sight of the lord. He removed the high poles and broke in pieces the brazen serpent that Moses had made; for unto THOSE DAYS the children of Israel DID BURN INCENSETO IT: and he called it NEHUSHTAN.” It is true that God commanded Moses to make a brass serpent and lift it upon a pole so that those who were bitten by the serpents could be healed. But somehow the brass serpent acquired a mantle of holiness and people visiting the tabernacle began to worship it. As people came to the Tabernacle to worship the Lord, they also burned incense to the brazen serpent.This was contrary to God’sWord. This practice had been going on for many years. No one had the courage to remove this wrong and abominable practice from the temple. But as the Word says, “Hezekiah was one who did that which was right in the sight of the Lord.” So one day he took this brass serpent and threw it down and called it NEHUSHTAN meaning mere pieces of brass. He showed the children of Israel that there was nothing holy, spiritual or supernatural in it. Surely when the Lord spoke to them to lift the serpent up and look at it He said something of great significance. But when he left that, it remained mere brass pieces with no importance. Brass cannot heal wounds caused by serpent’s bite. But what healed them was the Word of the Lord and their obedience to it.",
		"bible_reading": "1 Chronicles 12:19-14:17 \n Romans 1:1-17 \n Psalm 9:13-20 \n Proverbs 19:4-5",
		"image_url": "Empty at the moment",
		"today_command": "Stop sinning or something worse may happen to you. – John 5:14"
	},
	{
		"devotion_id":12, 
		"devotion_title":"Title 2",
		"devotion": "“So he carried me away in the spirit into the wilderness: and I saw a woman sit upon a scarlet coloured beast, full of names of blasphemy, having seven heads and ten horns. And the woman was arrayed in purple and scarlet colour, and decked with gold and precious stones and pearls, having a golden cup in her hand full of abominations and filthiness of her fornication: And upon her forehead was a name written, MYSTERY, BABYLON THE GREAT, THE MOTHER OF HARLOTS AND ABOMINATIONS OF THE EARTH.”. (Rev 17:3-5 ) The word ‘waters’ (v 1) is an allegory or metaphor and refers to people. This is clear from revelation 17:15, which reads, “And he saith unto me, the waters which thou sawest, where the whore sitteth, are peoples, and multitudes, and nations, and tongues.” The word ‘woman’ is also allegorical. Here ‘woman’ refers to the false church, which is not in line with the Word of God. The harlot woman signifies the church that has gone astray. She is the picture of the denominational system. There is a harlot woman who is ruling the lives of many people (the great whore that sitteth upon many waters – the scriptures says, “Babylon the great, the mother of harlots…” the mother has several daughters. She is known as the mother for she has borne many daughters.",
		"bible_reading": "1 Chronicles 15:1-16:36 \n Romans 1:18-32 \n Psalm 10:1-15 \n Proverbs 19:6-7",
		"image_url": "Empty at the moment",
		"today_command": "Watch and pray so that you will not fall into temptation. – Matthew 26:40"
	},
	{
		"devotion_id":13, 
		"devotion_title":"Title 2",
		"devotion": "Unfortunately the Old Testament is a dead book for many people! They only read the New Testament and thus they are unable to see the types and shadows of Christ.They think that the Old Testament has nothing to teach them and that it is of no benefit. But true believers can see the lord Jesus Christ throughout the Scriptures. For its readers the Open Bible (Ex-panded Edition) conveniently points out the Christ as seen in every book of the Old Testament. Yes, only when one can see the Lord Jesus Christ revealed in every Old Testament book can the New Testament take all a new meaning. For every type, shadow, model, parable and illustration points to Christ Jesus. One should understand that the natural Israel mentioned so frequently in the OldTestament is also a type and shadow of the true Israel of God-those who are circumcised in the heart and who are born out of the seed of Abraham-the true Christian believer and the true Body of Christ. When one reads the Word of God from cover to cover and when the Holy Spirit opens one’s eyes, one can truly see the eternal purposes of God through His Son, the Lord Jesus Christ. Augustine said that in the Old, the New is concealed; in the New the Old is revealed. Another man of God wrote that the New Testament without the Old is like a house standing in the air. They are one yet they are distinct.",
		"bible_reading": "1 Chronicles 16:37-18:17 \n Romans 2:1-24 \n Psalm 10:16-18 \n Proverbs 19:8-9",
		"image_url": "Empty at the moment",
		"today_command": "Feed my lambs – John 21:15"
	},
	{
		"devotion_id":14, 
		"devotion_title":"Title 2",
		"devotion": "The boards of the tabernacle wall had to be “standing upright” (Exodus 26:15). The psalmist says, “...the upright shall dwell in Thy presence” (Psalms 140:13). Only the righteous, the upright shall stand in the day of the Lord. Only the upright shall be used to build God’s dwelling place. God is looking for men and women who are upright and who seek God and His righteousness. The upright will structure God’s house and when all things made by human effort come tumbling down, God’s house alone will remain standing. That shall be the sign of the true dwelling place of God. It shall be a house that shall be everlasting and eternal. The zeal of man has no place in the work of God. The eye and the hand of the Holy Spirit shall he used by God to build His House according to His divine standards. And he that hath an ear will listen to what the Spirit is saving in this hour. Beloved, God is in the process of building up his Corporate Temple. He is structuring it so that He may dwell in it. God has to work upon our lives; He has to change us till we conform to the Lord, Jesus Christ. He is using the carpenter’s plane upon our lives so that we may be of the right size, smoothness, and identical one to another, in the Lord. Marvel not at what God is doing in your lives. Let the Master Builder have His way.",
		"bible_reading": "1 Chronicles 19:1-21:30 \n Romans 2:25-3:8 \n Psalm 11:1-7 \n Proverbs 19:10-12",
		"image_url": "Empty at the moment",
		"today_command": "Do not be afraid. I am the First and the Last. – Revelation 1:17"
	},
	{
		"devotion_id":15, 
		"devotion_title":"Title 2",
		"devotion": "“Ten cubits shall be the length of a board, and a cubit and a half shall be the breadth of one board.” (Exodus 26: 16). There were forty-eight boards and all forty-eight of them were to be of the same size, length, and width. We are to have only one standard, one height— the Lord Jesus Christ. Every single board in this corporate wall had to measure up to ten cubits. In Bible numerology the number ten represents testing, trials and tribulations; it also represents law and order (ten commandments; ten virgins). The tabernacle boards were all of ten cubits height. God structures His dwelling place from lives that have been tested tried, submitted, and committed to the dealings of God. Jesus said, “If you suffer with me, you shall also reign with me”. Jesus learned obedience through the things He suffered. The width of the board was one and a half cubits. This is not a full number. It is an incomplete number. Only when two boards were joined together could they stand to measure a complete number (three— a divine number). “for where two or three are gathered together in my name, there am I in the midst of them. ‘ (Matthew 18:20). There were twenty boards each on two sides, but none standing alone. There is no place for a believer who attempts to standalone. We are built up together.",
		"bible_reading": "1 Chronicles 22:1-23:32 \n Romans 3:9-31 \n Psalm 12:1-8 \n Proverbs 19:13-14",
		"image_url": "Empty at the moment",
		"today_command": "Seventy-seven times (number of times in a day you should forgive someone) – Matthew 18:22"
	},
	{
		"devotion_id":16, 
		"devotion_title":"Title 2",
		"devotion": "“Two tenons shall there be in one board, set in order one against another; thus shalt thou make for all the boards of the Tabernacle.” (Exodus 27: 17) ‘Tenons’ in Hebrew means hands or projections. Bible scholars agree that each board having two tenons each were designed to fit securely into the silver sockets or foundations. These tenons translated ‘hands’ were provided so that the boards could stand securely upon their foundational sockets. Silver in Bible language refers to the redemptive work of the Lord Jesus Christ. The sockets were made of silver redemption money, the price of the ransom. Thirty pieces of silver were. paid as a price for the Lord. The boards were not to rest upon the earth but they were to rest upon the redemptive work of Lord. Beloved, we are not to stand upon the strength of our flesh but we are to stand upon the finished work of the Lord Jesus Christ. We are kept secure by His power. Every board, every believer is secure in the redemptive work of the Lord for He took our place and put our sins upon Himself. The two tenons also signify that we are built upon the foundation of the apostles and prophets.",
		"bible_reading": "1 Chronicles 24:1-26:11 \n Romans 4:1-12 \n Psalm 13:1-6 \n Proverbs 19:15-16",
		"image_url": "Empty at the moment",
		"today_command": "Come with me by yourselves to a quiet place and get some rest. – Mark 6:31"
	},
	{
		"devotion_id":17, 
		"devotion_title":"Title 2",
		"devotion": "“And thou shalt make bars of shittim wood; five for the boards of the one side of the tabernacle, And the middle bar in the midst of the boards shall reach from end to end.” (Exodus 26: 26, 28) The boards were kept together, side by side, by bars, which were placed into rings fitted to the boards. The bars were like wooden poles that ran through rings and made the boards into a solid, steadfast wall. This is also explained in Exodus 36:31-33. The number five represents the grace of God. There were five bars on each side. God’s grace is manifested to the church in many ways. One another way by which God deals with His people to stabilize them is through the five-fold ministry. It is interesting to note that these bars were also made of the same MATERIAL and had the same PROCESS as the BOARDS (Ephesians 4: 8-11). Just as these 5 bars were to stabilize the whole structure, preventing the tabernacle from being shaken to and fro by whatsoever wind that would come against it, even so God has placed these five-fold ministries in His church (tabernacle) to keep the Church from being swayed by every wind of doctrine. Just as the bars were responsible for keeping the boards compacted together even so these ministries keep the church united in their goal. Without the five-fold ministry of the ascended Lord, the church would lack stability, solidity, and proper structure.",
		"bible_reading": "1 Chronicles 26:12-27:34 \n Romans 4:13-5:5 \n Psalm 14:1-7 \n Proverbs 19:17",
		"image_url": "Empty at the moment",
		"today_command": "By this all men will know that you are my disciples, if you love one another.” – John 13:34"
	},
	{
		"devotion_id":18, 
		"devotion_title":"Title 2",
		"devotion": "The Greek word for adoption is ‘huiothesia’ (pronounced hweeoth-es-ee-ah). It is derived from the root word ‘huios’ which means son. ‘Huios’ (pronounced hwee-os) primarily refers to the children of God who are growing into maturity. The difference between believers as children of God (Greek word is ‘tekna’ or ‘teknon’) and as sons, ‘huioi’ (pronounced hwee-i) is brought out in Romans 8:14-17. “For as many as are led by the Spirit of God, they are the sons (‘huioi’) of God. For ye have not received the spirit of bondage again to fear, but ye have received the Spirit of adoption (‘huiothesia’) whereby we cry ‘Abba Father’, the Spirit itself beareth witness with our spirit, that we are the children of God, (‘teknon’) and if children, then heirs, heirs of God and joint heirs with Christ, if so be that we suffer with him, that we may be glorified together.” (Romans 8:14-17). A born again child of God is a ‘teknon’; he is a child of God in his relationship to the Father. But a ‘huio’ is a grown up son, one who bears a likeness to the Father’s character and who occupies a place of dignity and honour in the family of God.",
		"bible_reading": "1 Chronicles 28:1-29:30 \n Romans 5:6-21 \n Psalm 15:1-5 \n Proverbs 19:18-19",
		"image_url": "Empty at the moment",
		"today_command": "Take courage! It is I. Don’t be afraid. - Matthew 14:27"
	},
	{
		"devotion_id":19, 
		"devotion_title":"Title 2",
		"devotion": "If we are to be the sons of God and share the throne of the Lord Jesus Christ, then we have to learn to be responsible and accountable while upon this earth. God’s purpose is to qualify us to be His companions and His fellow workers. God desires that we may be joint-heirs with Christ in the governance of the universe. The church has been delegated with this awesome responsibility. We have been brought into the ‘so great salvation’ that we may be prepared and raised up to inherit and share that which the Lord Jesus Christ possesses upon the throne. We have been called to rule and reign with Him. Responsibility and accountability towards God is progressive. It begins with the individual and proceeds to incorporate the church. We are all to first bear a personal responsibility to the Father for our sonship. Then we are to be fellow heirs with Christ and thus share a corporate responsibility. As we jointly share responsibilities in the church, we learn, as a corporate body, to also share all things with Christ, our Head. To live is to grow; to grow means to change. God wants us to be a responsible people, a people who bear the responsibility of His Word.",
		"bible_reading": "2 Chronicles 1:1-3:17 \n Romans 6:1-23 \n Psalm 16:1-11 \n Proverbs 19:20-21",
		"image_url": "Empty at the moment",
		"today_command": "Stop judging by mere appearances, and make a right judgment. – John 7:24"
	},
	{
		"devotion_id":20, 
		"devotion_title":"Title 2",
		"devotion": "God wants to remove that Jacob nature in us that evades responsibility in difficult situations. He wants us to be a people who face dangers and difficulties with courage and with the assurance that ‘the eyes of the Lord are on the righteous, and His ears are attentive to their prayer’ (I Peter 3:12).The apostle Peter writes, “The Lord knows how to rescue godly men from trials” (II Peter 2:9). Responsibility is not the concern of only those who are pastors, elders and deacons. All of us are to be responsible-minded; we are to live a life of responsibility before God. Sonship talks of reigning and ruling with Christ and of holding responsible attitudes towards the Word and the things of God. The Lord in these last days is preparing His people to assume greater responsibilities so that in the day of the Lord we shall be able to rule with the King. God is preparing His overcomers company to be people who shall rule and have dominion upon this earth. It is essential to be responsible and accountable to God in all that we say and do, even in these days. If we are to be heirs with Christ Jesus and sons of glory, then we must also prove ourselves as responsible people who are ever willing to discharge our duties and do justice to God’s grace upon our lives.",
		"bible_reading": "2 Chronicles 4:1-6:11 \n Romans 7:1-13 \n Psalm 17:1-15 \n Proverbs 19:22-23",
		"image_url": "Empty at the moment",
		"today_command": "Come to me, all you who are weary and burdened, and I will give you rest. Matthew 11:28"
	},
	{
		"devotion_id":21, 
		"devotion_title":"Title 2",
		"devotion": "The Lord Jesus told his disciples that in Noah’s time the people were ‘eating and drinking, marrying and giving in marriage’ right upto the very last day that judgment came upon the people. In Noah’s time the people were totally irresponsible and went about doing their usual business undisturbed by the impending floods. They were living unto themselves with no concern for the warnings of God. We need to realise that there is nothing wrong with eating, drinking and marrying as such; these are essential activities; but these people were fully occupied with living in a selfish, materialistic way, with no thought of God and His purposes. The judgment of God, in the form of the flood found them totally unprepared. But there was one family of eight that took heed of God’s Word and they alone exercised a sense of responsibility and duty toward God. They knew they would have to answer for their behaviour. They were living under an unspoken obligation to prepare for that day. A great responsibility rested upon their shoulders and they had to prove themselves as mature people. They endured the reproach of the people; they suffered their mocking unbelief; they withstood their childish taunts and entered the ark, a place prepared for them by God.",
		"bible_reading": "2 Chronicles 6:12-8:10 \n Romans 7:14-8:8 \n Psalm 18:1-15 \n Proverbs 19:24-25",
		"image_url": "Empty at the moment",
		"today_command": "Watch out that no one deceives you. For many will come in my name, claiming, ‘I am the Christ,’ and will deceive many. Matthew 24:4,5"
	},
	{
		"devotion_id":22, 
		"devotion_title":"Title 2",
		"devotion": "There are so many of us who, like Jonah, want to take a shortcut in doing the will of God. We may have received God’s will in our lives but we prefer to do it our own way and not God’s way. Jonah may be termed a ‘prejudiced son’ or a ‘reluctant prophet’. His mind was not given fully to the performance of God’s perfect will. Jonah was deceived into believing that he could save Israel if he disobeyed God. Sometimes we are lured away from God’s will in our lives by the whispers and suggestions of Satan. We are led to believe that there is a good motive for not doing the will of God. Our carnal nature is very susceptible to suggestions that reveal an easier way, a shortcut or a deviation from God’s straight, direct, inflexible will. Let us awake to the responsibility we have toward our calling in God. In real life situations there are many who do not want to go the way God shows them. They are reluctant to take up their cross.They hesitate to surrender ‘all’ at His feet.They despise the responsibility of walking in the ways of God. The easier way, the shortcut is the irresponsible way: the hard way, the extra mile, is the way of Christian responsibility, the way of the sons of God.",
		"bible_reading": "2 Chronicles 8:11-10:19 \n Romans 8:9-25 \n Psalm 18:16-36 \n Proverbs 19:26",
		"image_url": "Empty at the moment",
		"today_command": "He who testifies to these things says, “Yes, I am coming soon.” Amen. Come, Lord Jesus. – Revelation 22:20"
	},
	{
		"devotion_id":23, 
		"devotion_title":"Title 2",
		"devotion": "“For (even the whole) creation (all nature) waits expectantly and longs earnestly for God’s sons to be made known (waits for the revealing, the disclosing of their sonship). For the creation (nature) was subjected to frailty (to futility, condemned to frustration) not because of some intentional fault on its part, but by the will of Him Who subjected it (yet) with the hope. That nature (creation) itself will be set free from its bondage to decay and corruption (and gain an entrance) into the glorious freedom of God’s children. (Romans 8: 19-21 Amp). The judgment of God came upon the earth because of Adam.The earth will, therefore, be released from the curse through the second Adam and His brothers (the Son and the sons of God). The condition of the earth will remain unchanged untill the kingdom comes.The Bible says,“the creation (i.e the earth) shall be delivered from the bondage of corruption into the glorious liberty of the sons of God”. Presently the whole earth is lying in a state of frustration and frailty. But there is hope. The hope lies in the fact that the sons of God are growing and multiplying. They, along with their Perfect Leader, will liberate all creation from its curse that day. The hope of all creation lies in the bringing forth of the matured Sons of God.",
		"bible_reading": "2 Chronicles 11:1-13:22 \n Romans 8:26-39 \n Psalm 18:37-50 \n Proverbs 19:27-29",
		"image_url": "Empty at the moment",
		"today_command": "“Do not leave Jerusalem, but wait for the gift my Father promised, which you have heard me speak about. – Acts 1:4"
	},
	{
		"devotion_id":24, 
		"devotion_title":"Title 2",
		"devotion": "Adoption in the scripture is mainly a word for position (or place), rather than a word denoting a relationship. Scriptures say that we come into a relationship with the Father, as a spiritual child when we are born again by faith, but ‘adoption’ is different. Adoption is an act of God, which places one who is already a child in the position of an adult son (Galatians 4:1-5). When we are born again, we are justified and forgiven; but when we are adopted then we will be restored the privileges which we did not possess as children because of our sins. Adoption refers to a restoration and maturing of the inner man that brings one into a more intimate position in the Father. The sons (huios) are brought into a place of authority, honour and respect in relation to the Father. A servant in the house has a certain place; but a son has a different placing. Till the child comes of age (i.e. till he grows into maturity), he is kept like a slave or bond servant (Galatians 4:2). He is temporarily under an order of discipline and submission. He is accountable to tutors and guardians or administrators. But when the child grows into adult sonship, he acquires a new place of authority in the household. He receives authority from the Father, and he is able to wield the rod of authority. He operates in the name of the Father and commands the respect of others in the household of God.",
		"bible_reading": "2 Chronicles 14:1-16:14 \n Romans 9:1-24 \n Psalm 19:1-14 \n Proverbs 20:1",
		"image_url": "Empty at the moment",
		"today_command": "Put your trust in the light while you have it, so that you may become sons of light. – John 12:36"
	},
	{
		"devotion_id":25, 
		"devotion_title":"Title 2",
		"devotion": "“For we are his workmanship, CREATED in Christ Jesus unto good works, which God hath before ordained that we should walk in them”, (Ephesians 2:10). Is it not a remarkable and even an astounding fact that God has predestined and created every believer in Christ? We are creatures or beings who have been made alive by our union with Christ Jesus. We are His precious possessions, the work of His hands. “Therefore if any man be in Christ, he is a NEW creature old things are passed away; behold all things are become NEW.” (II Corinthians 5:17). When anyone is united to Christ, he is made anew. At our spiritual birth, we become NEW persons, not just RENEWED persons! There is a new creation whenever a person comes into union with Christ. He enters a new world as an altogether new person. We go through a new experience at our spiritual birth. Ephesians 2:10 shows us that God has pre-ordained our walk in the reality of this new creation. He has predestined that we should live our daily lives according to this new creation pattern. A believer’s walk refers to his attitudes, relationships, conduct and behaviour. Our walk is the way we live before man.The Lord desires that in our walk, we should reflect the new creation, the new life, the new inner man.",
		"bible_reading": "2 Chronicles 17:1-18:34 \n Romans 9:25-10:13 \n Psalm 20:1-9 \n Proverbs 20:2-3",
		"image_url": "Empty at the moment",
		"today_command": "He who has an ear, let him hear what the Spirit says to the churches. – Revelation 3:22"
	},
	{
		"devotion_id":26, 
		"devotion_title":"Title 2",
		"devotion": "Our inheritance in Him is guaranteed, provided we suffer with Him, and are, in every sense, His children (here meaning those who are born of the Spirit).Our inheritance or heirship is tied up with a sharing of His suffering. There is a suffering unto which we have been called by the Lord. If we desire to rule and reign with the Lord, if we are to be princes and heirs, then we must be prepared to suffer even this day. The sufferings we are called to undergo, are not so much the sicknesses and illnesses of the flesh, but rather, the sufferings that come upon us as a result of identifying fully with the pattern Son. We share Christ’s sufferings in order that we may also share His glory and splendour afterward. If we suffer jointly with Him, we shall also enjoy glory jointly. The apostle Paul assures us that the sufferings we now endure, are nothing compared to the glory that shall be ours later (Romans 8: 18). Paul rightly says that the sufferings of the present moment are to be viewed, not in isolation, but in the light of the glory that shall soon be revealed in us. God had appointed for Christ a suffering. “But those things, which God before had shewed by the mouth of all his prophets, that Christ should suffer, he hath so fulfilled” (Acts 3:18).",
		"bible_reading": "2 Chronicles 19:1-20:37 \n Romans 10:14-11:12 \n Psalm 21:1-13 \n Proverbs 20:4-6",
		"image_url": "Empty at the moment",
		"today_command": "Bless those who curse you, pray for those who mistreat you – Luke 6:28"
	},
	{
		"devotion_id":27, 
		"devotion_title":"Title 2",
		"devotion": "“Yet if any man suffer as a Christian, let him not be ashamed; but let him glorify God on this behalf.” (1 Peter 4:16). Our suffering may take various forms. All of us are not put through the same kind of sufferings. Some may be called to suffer in the environment of the family, some in the sphere of their jobs, and others in strange and divers ways. But the Lord assures us that our suffering is not without a purpose. We are not called to suffer for the sake of suffering, which only leads to a false holiness or an holier-than-thou attitude. If we are moving in the purposes of God, we shall surely experience trials, tribulations and situations that may test us sorely, cause a heaviness, a confusion and even discouragement. But the scripture says, “That the trial of your faith, being much more precious than of gold that perisheth though it be tried by fire, might be found unto praise and honour and glory at the appearing of Jesus Christ.” (1 Peter 1:7). Let us also not overlook the fact that whatever may be the nature of our trials and temptations, the Lord provides us a definite guarantee that He “will not suffer you to be tempted above that ye are able” (l Corinthians 10:13). God’s call is at all times to overcome our situations that we may be released from suffering through prayer and the work of the cross in our lives.",
		"bible_reading": "2 Chronicles 21:1-23:21 \n Romans 11:13-36 \n Psalm 22:1-18 \n Proverbs 20:7",
		"image_url": "Empty at the moment",
		"today_command": "Remember the height from which you have fallen! – Revelation 2:5"
	},
	{
		"devotion_id":28, 
		"devotion_title":"Title 2",
		"devotion": "“And has made us unto our God kings and priests : and we shall reign on the earth” (Revelation 5:10). This place of kingship in Christ must be appropriated in our lives. We are to have dominion over sin. We are to subjectively rule and reign over the lusts of our flesh, the lust of our eyes, and the pride of life? The Lord has given us the power and authority, as unto kings, to rule over our sin- nature. We must set our minds and our affections on the things of God whilst exercising complete rulership over the flesh and our carnal nature. In the days of old, the king invariably led his troops into battle. He was involved in every battle to safeguard the kingdom. Christians need to stop playing games and get down to the battle against sin and Satan. Having been tempted as man, Jesus has ascended into Heaven, to give to every believer (who is prepared by faith to take it) his portion of the victory of the cross. In Christ, we have a place of victory and rest after the battle against Satan. So our kingship in Christ is also synonymous with being overcomers. God calls us to exercise our rule in this life by being overcomers over sin, Satan, flesh and worldliness. “To him that overcometh will I grant to sit with me in my throne, even as I also overcame, and am set down with my Father in his throne.” (Revelation 3:21).",
		"bible_reading": "2 Chronicles 24:1-25:28 \n Romans 12:1-21 \n Psalm 22:19-31 \n Proverbs 20:8-10",
		"image_url": "Empty at the moment",
		"today_command": "Forgive, and you will be forgiven. – Luke 6:37"
	},
	{
		"devotion_id":29, 
		"devotion_title":"Title 2",
		"devotion": "“Whose voice then shook the earth: but now he hath promised, saying, Yet once more I shake not the earth only, but also heaven.” (Hebrews 12:26). We should know that God Almighty will use a people to shake the powers of darkness! This shall happen as a result of their taking their place on the throne, and possessing their places of inheritance and dominion.They shall bring down the prince of the air and, the powers and principalities, which are presently dominating the heavenly places.The Lord of hosts, the Captain of our salvation shall lead a people to wage a war upon the enemies of the kingdom. The Lord declared that He will shake the heavens. For many, many years the church has been in a place of defeat. She has suffered torment, affliction, demonic attacks in total surrender. The powers of darkness have influenced her and controlled her actions all these years. They have fractured and severed the church into numerous denominations; they have caused people to move away from faith in the Lord; they have caused people to have different aspirations and a variety of hopes; they have caused people to overlook the true calling of the church. But God is sounding an alarm in Mount Zion. He has NOW put the trumpet to His lips. He is preparing a people to stand against the devil and all his angels!",
		"bible_reading": "2 Chronicles 26:1-28:27 \n Romans 13:1-14 \n Psalm 23:1-6 \n Proverbs 20:11",
		"image_url": "Empty at the moment",
		"today_command": "Be faithful, even to the point of death, and I will give you the crown of life. – Revelation 2:10"
	},
	{
		"devotion_id":30, 
		"devotion_title":"Title 2",
		"devotion": "God had prepared two bodies for the Lord Jesus Christ. One was the earthly tabernacle of His physical body. This body was formed by the Father and brought forth by the Holy Spirit. When the angel of the Lord appeared to Mary and said,“.. thou shalt conceive in thy womb and bring forth a son”, Mary asked the angel, “How shall this be, seeing I know not a man?”The angel of the Lord replied, “The Holy Ghost shall come upon thee and the power of the Highest shall overshadow thee”. In other words the angel told Mary that her son would neither be the product of man, nor the result of the will of man.There would be no display of the power of man in the bringing forth of this Son.The first body of the Lord Jesus was birthed of the Spirit; it was born from above. The first fruit was from above; He was heavenly and born of the Spirit. The second body of Christ that the Father is forming and preparing is the many-membered body of Christ, which is the Church. The principles that brought forth the physical body shall also be at work in the bringing forth of this many-membered Body. The angel’s declaration to Mary that the Holy Ghost shall overshadow thee, is also to be true concerning the bringing forth of this body of many sons. If the Firstfruit was not the product of man, nor was born of the will of man, then this shall also be true about Body of Christ, His Church.",
		"bible_reading": "2 Chronicles 29:1-36 \n Romans 14:1-23 \n Psalm 24:1-10 \n Proverbs 20:12",
		"image_url": "Empty at the moment",
		"today_command": "Leave her alone – John 12:7"
	}
]