[
	{
		"devotion_id":0, 
		"devotion_title":"Title 0",
		"devotion": "A picture of the ‘ONE MAN’ that God desires to raise can be seen in the First book of Samuel. The Philistine, Goliath stood and bellowed to the armies of Israel. ‘choose you A MAN for you and let him come down to me’ (I Samuel 17:8). Goliath said that he would fight with any ‘ONE MAN’ of Israel. He challenged the armies of Israel to produce ‘ONE MAN’ who could face him. And the men of Israel saw the might of Goliath and fled, as they were afraid. They searched their ranks for ‘one man’ but they couldn’t find one who would be able to stand upto Goliath. But, praise God, there was one young lad, David, who said ‘Who is this uncircumcised Philistine, that he should defy the armies of the living God?” In the whole of Israel there were many men of valour who had won many great battles, but none could respond to the call and the challenge. In Israel’s need of the hour, none responded to her need though there were many men of great stature.  There was only one man whose desire was to see that God’s name was vindicated amongst the nations. This young man broke the rank and file and ran towards Goliath, with just a sling and five pebbles. He stood in the gap at that time of need.",
		"bible_reading": "Judges 13:1-14:20 \n John 1:29-51 \n Psalm 102:1-28 \n Proverbs 14:15-16 ",
		"image_url": "Empty at the moment",
		"today_command": " Whosoever will come after me, let him deny himself, and take up his cross, and follow me.  Mark 8:34 "
	},
	{
		"devotion_id":1, 
		"devotion_title":"Title 1",
		"devotion": "Once some Pharisees came to Jesus to tempt Him and test Him (Matthew 19:3). They did not seek to know Him, to acquire some wisdom concerning the Scriptures or to understand the things He said.  Their whole purpose was to find fault with Jesus. When Jesus told them that in marriage man and woman were ‘no more twain, but one flesh’ for God hath joined them and man had no authority to separate them, they asked Him, “Why did Moses then command to give a writing of divorcement, and to put her away?” (Matthew 19: 6,7).   The Pharisees wanted to know why Moses permitted man and woman to be divorced, if such be the case.  The Lord replied, “Moses, because of the hardness of your hearts, suffered you to put away your wives: but from the beginning it was not so.” (Matthew 19:8).  ‘But from the beginning it was not so’.  How significant this is.  God’s directive will for man and woman from the very beginning was to be one. God did not desire man and woman to be separate. But because of the hardness of heart God allowed a separation to take place.  Separation does not alter the fact that in God’s view man and woman were made to be ‘ONE FLESH’!  The Bible, from Genesis to Revelations, shows that God’s desire from the very beginning is to have ’one new man’   - a corporate many-membered Body. ",
		"bible_reading": "Judges 15:1-16:31 \n John 2:1-25 \n Psalm 103:1-22 \n Proverbs 14:17-19",
		"image_url": "Empty at the moment",
		"today_command": " Wherefore comfort yourselves together, and edify one another, even as also ye do.  1 Thessalonians 5:11"
	}, 	
	{
		"devotion_id":2, 
		"devotion_title":"Title 2",
		"devotion": "In the days of Jesus, there were many who knew the Lord Jesus Christ ‘after the flesh’. They were not able to discern the spiritual content of His words. They looked at Jesus Christ from the natural point of view as being Joseph’s son.  For instance some said, “Shall Christ come out of Galilee?” (John 7:41). They saw Jesus’ brothers and sisters and found that Jesus was no different to them! Some people claimed to have a special relationship with Jesus Christ because they had walked with Him and touched His garments; they had supped with Him and seen Him perform miracles; they had even shared His personal concerns. Yet they were not able to appreciate who Jesus really was, nor were they able to understand the depths of His words.  The Apostle Paul, on the other hand, who had neither shared a meal with Jesus Christ, nor heard Him speak nor walked at His side, yet he was the one who had a greater revelation in the Spirit than those who knew Jesus in the flesh. That is why Paul said that he would boast of such a one who was ‘caught up into paradise, and heard unspeakable words which is not lawful for a man to utter’ (II Corinthians 12:4). Paul saw mysteries unfolded before his eyes when he was in the Spirit. He saw the Lord at Damascus and he had revelation of the Son.  We have to hear the Word of God with spiritual ears.",
		"bible_reading": "Judges 17:1-18:31 \n John 3:1-21 \n Psalm 104:1-23 \n Proverbs 14:20-21 ",
		"image_url": "Empty at the moment",
		"today_command": " Servants, be obedient to them that are your masters according to the flesh,  Ephesians 6:5 "
	},
	{
		"devotion_id":3, 
		"devotion_title":"Title 3",
		"devotion": "David was used to the wisdom of God.  When the lion and the bear confronted him while he was shepherding the flock, he depended on God’s wisdom to resist the attacks of these fierce animals.  The weapons of his warfare were not of the flesh and of the wisdom of man, but of the wisdom of the Lord.  Saints, we are to battle the situations we face, as David battled the lion and the bear; they will not go away by wishful thinking or a play of semantics.  The lion will not close its mouth and run away; the bear will not run up a tree and disappear! David had to wrestle hard against the enemy.  The lion and the bear that he faced did not just vanish into thin air He had to wrestle with them. We too have to wrestle with situations and circumstances we face.  There are hard situations in life that we have to come to grips with and overcome.   There are many believers who are looking for miracles to save them so that they do not have to wrestle with situations.   They do not want to wrestle with issues and circumstances.   They do not want to take risks and be faced with uncertainties! They want to escape from suffering any discomfort and fear.  But that is not the way of the Lord for His overcomers.  Saints, we are to battle the situations we face, as David battled the lion and the bear.",
		"bible_reading": "Judges 19:1-20:48 \n John 3:22-4:3 \n Psalm 104:24-35 \n Proverbs 14:22-24",
		"image_url": "Empty at the moment",
		"today_command": " Let the word of Christ dwell in you richly in all wisdom; Colossians 3:16 "
	}, 	
	{
		"devotion_id":4, 
		"devotion_title":"Title 4",
		"devotion": "“And David behaved himself wisely in all his ways; and the LORD was with him. Wherefore when Saul saw that he behaved himself very wisely, he was afraid of him. “  (1Sam. 18:14-15) Look at that!  When Saul saw that David walked wisely Saul  feared David!  Even in the life of Daniel we see that the more he suffered and separated himself from others, the angrier his peers became.  Beloved, walking in God’s wisdom is not easy, for it brings and breeds enemies who become jealous, envious and even murderous.  Remember, all these things will happen to us if we walk in the wisdom of God.  This can happen to any and all of us, wherever we are, be it the church, the office, the family and in every place.   People will hate you because you walk in God’s wisdom!  The Scripture says, “David behaved himself wisely in all his ways”.  David behaved more wisely, and yet Saul, who worshipped the same God, became increasingly hateful towards David.  He devised many cunning methods and plans to trap David into difficult positions.  And yet he was all the more afraid of David!  And Saul was yet the more afraid of David; and Saul became David’s enemy continually. Then the princes of the Philistines went forth: and it came to pass, after they went forth, that David behaved himself more wisely than all the servants of Saul; so that his name was much set by.   (1 Sam. 18:29-30)",
		"bible_reading": "Judges 21:1-Ruth 1:22 \n John 4:4-42 \n Psalm 105:1-15 \n Proverbs 14:25 ",
		"image_url": "Empty at the moment",
		"today_command": "Therefore let no man glory in men. For all things are yours; 1 Corinthians 3:21 "
	}, 	
	{
		"devotion_id":5, 
		"devotion_title":"Title 5",
		"devotion": "I have found that most of us take very few things to the Lord in prayer.  Common problems such as our differences with the boss in office, and the disagreements with our families, neighbours and relatives are seldom brought before the Lord, even though we know that His intervention would make all the difference.  I have observed that when office-going brethren apply for leave to attend some specific meeting of the church, and the boss refuses to grant them leave, the brethren often side with the boss’s and even defend his decision to refuse them leave!  They accept and even support the boss’s decision to stay away from office for the good of the office!  At such times, I encourage brethren to pray with faith and not to take the boss’ decision as final, for we have a greater Master or ‘Boss’ in the Lord.  We need to place God first and bring every matter to Him in prayer.  But most of the time people just accept situations and decisions of their boss as unchallengeable and final.  They do not even bring it to the Lord with a real heart of passion for Him.  The pressures we experience are realities in life.  We need to bring the Lord into our situations.  We must petition the Lord to help us in our jobs.  God will help us.  In the majority of cases, we bring things to the Lord at the eleventh hour and not at the start or in the beginning. ",
		"bible_reading": "Ruth 2:1-4:22 \n John 4:43-54 \n Psalm 105:16-36 \n Proverbs 14:26-27",
		"image_url": "Empty at the moment",
		"today_command": " Thou therefore endure hardness, as a good soldier of Jesus Christ.  2Timothy 2:3"
	}, 	
	{
		"devotion_id":6, 
		"devotion_title":"Title 6",
		"devotion": "The will in man for power has destroyed peace and security in the world.  It has driven man to deeper frustration and defeat.  The craving for power has invaded politics, industry, and social life, national and international ambitions.  It has not stopped there, but gone further and even entered into the religious world.   We see the might of man working not only in the secular world but also in the spiritual arena.  We find that man’s might in Christianity has brought about rivalry, jealousy, factions, and divisions in the church.  In the Corinthian church Paul said that there were divisions, bickering, and striving one against another etc.  This is nothing but man glorifying himself in his own might!  \n\t We are living in a world where might is right; this has come into the church as well.   The fabric of life is shot through and through with the expansion of the original, initial, primal assertion of the will to power, the ego or self hood! This dislocated lust for power is working itself out to universal destruction.  We get to hear about super powers and other powers in the world. This lust for power and might will eventually bring about the very destruction of man.",
		"bible_reading": "1 Samuel 1:1-2:21 \n John 5:1-23 \n Psalm 105:37-45 \n Proverbs 14:28-29 ",
		"image_url": "Empty at the moment",
		"today_command": "Give not that which is holy unto the dogs, neither cast ye your pearls before swine,  Matthew 7:6"
	}, 	
	{
		"devotion_id":7, 
		"devotion_title":"Title 7",
		"devotion": "The serpent is moving about today just as he did in the Garden, with fascination and hypnotism toward his prey—the spiritual life of God’s people.  As “the serpent beguiled” to possess without consideration or reference to fellowship with God, so it has ever been!    Saints, the serpent is roaming throughout all generations with fascination and hypnotism toward his prey.  It wants to divest people of their spiritual life and the calling that is resting upon God’s people.   Is that not true today?  They sell out their time and energy for  material things.  How many believers have been beguiled by the serpent?  They want to have blessings in life without reference to God—without His headship over their lives, without having God and His will.  People want blessings in terms of materialism only.    It is not a matter of need but it is a matter of greed today! The philosophy of our times is that both husband and wife need to work to live!  God’s promise is to meet our need and not our greed! How can we have a four door sedan?  We see many examples of the husband working in one place, the wife in another, separated from one another for years because of work.  The children are neither with mother nor with father!  This is the norm today.  Where are the men of God to bring the word into these lives?",
		"bible_reading": "1 Samuel 2:22-4:22 \n John 5:24-47 \n Psalm 106:1-12 \n Proverbs 14:30-31",
		"image_url": "Empty at the moment",
		"today_command": " Art thou bound unto a wife? seek not to be loosed. Art thou loosed from a wife? seek not a wife. 1 Corinthians 7:27"
	}, 	
	{
		"devotion_id":8, 
		"devotion_title":"Title 8",
		"devotion": "Even when people have a great knowledge of the truth, we find that there is often a lack of life.  That is why we need to examine our lives.  Many believers have a lot of mental knowledge and intellectual understanding of the truth; truth as truth, truth as doctrine and truth as instruction, but they lack life.  What this tells us is that all they received pertained to the realm of words, and they missed hearing the voice of the Lord.  Where there is a lack of hearing the voice, there will always be a lack of spiritual life.  We get to see terrible contradictions in the lives of God’s people in these days, even though they have a lot of knowledge of the truth.   Moral contradictions in the realm of marriage, divorce and remarriage take place as a result of shortfalls in spiritual life.  This is a violent contradiction to the life unto which we have been called as His true remnant in these last days.  It was so with Israel of old: there were violent contradictions in their lives.  They went against Jesus Christ, though they heard the word week after week; they had a mental knowledge of the word and the things of God, but their lives were contrary to that which they heard.  This can well happen with us; and therefore the Spirit would like to remind us of the need to be open to Him. ",
		"bible_reading": "1 Samuel 5:1-7:17 \n John 6:1-21 \n Psalm 106:13-31 \n Proverbs 14:32-33 ",
		"image_url": "Empty at the moment",
		"today_command": " Rejoicing in hope; patient in tribulation; continuing instant in prayer;   Romans 12:12"
	}, 	
	{
		"devotion_id":9, 
		"devotion_title":"Title 9",
		"devotion": "Though the disciples saw something in this man Jesus that caused them to leave their homes and their people, to make sacrifices, and to walk with Him, yet there were strong sentiments of self interest working in them.  It is so true that self interest governs many of our decisions.  The disciples thought that this man Jesus would bring them freedom from Roman rule and redeem Israel, but contrary to that this man was being crucified!  Their hopes had come to an end and they said, “We had hoped that it had been he who should redeem Israel” (Luke 24:21).   Again they asked him, after His resurrection and before His ascension, “Lord, wilt thou at this time restore again the kingdom to Israel?” (Acts 1:6).  Though the disciples did many good things outwardly but inwardly we see that self-interest governed their actions and decisions.  “Seekest thou great things for thy self?”  This is what we must be careful about; we must guard against our self-seeking interests.  Many a time, beneath our seemingly good sacrifices and outward actions, self interest is at work in a subtle way!  Before Pentecost, self interest governed the disciples to a very great extent.  They had great expectations for themselves; most of the time their thoughts were self-centered.  But afterwards, their lives changed. ",
		"bible_reading": "1 Samuel 8:1-9:27 \n John 6:22-42 \n Psalm 106:32-48 \n Proverbs 14:34-35",
		"image_url": "Empty at the moment",
		"today_command": "Let as many servants as are under the yoke count their own masters worthy of all honour, 1Timothy 6:1 "
	}, 	
	{
		"devotion_id":10, 
		"devotion_title":"Title 10",
		"devotion": "“I have other sheep that are not of this sheep pen.  I must bring them also.  They too will listen to my voice, and there shall be one flock and one shepherd.”  (John 10:16). \n\t From the above we can well understand that Jesus was talking about a people (sheep) who would hear His voice and become one flock.  Because they hear His voice they shall be one flock. It is not the place (the fold or the pen) but the people (the flock) that our Lord is concerned with. The Living Bible quotes this verse as follows:  “I have other sheep, too, in another fold. I must bring them also, and they will heed my voice, and there, will be ONE FLOCK with ONE SHEPHERD.”   The Lord told the Jews that as the Shepherd, he had other sheep, the Gentiles whom He must bring into the fold, so that there may be one flock that follows Him.  Beloved, the ONE FLOCK is the Church, the Body of Christ, the corporate Body that God is raising up through His Son (Ephesians 2:14-16).  The fold in Jesus’ time was Judaism, whereas the flock is the Church.  One was mere religion and of the letter; the other is spirit and life. We know that the Lord opened the way for the Gentiles to belong to His flock because of His work upon the cross of Calvary.",
		"bible_reading": "1 Samuel 10:1-11:15 \n John 6:43-71 \n Psalm 107:1-43 \n Proverbs 15:1-3 ",
		"image_url": "Empty at the moment",
		"today_command": " Be not deceived: evil communications corrupt good manners.   1 Corinthians 15:33"
	}, 	
	{
		"devotion_id":11, 
		"devotion_title":"Title 12",
		"devotion": " “And you hath He quickened who were dead in trespasses and sins.”(Ephesians 2:1).All of us who have been brought to life in Christ Jesus can readily identify with what Paul writes to the Christians in Ephesus because we too were dead in our sins but have been raised to life. In the past we were children of the darkness having Satan as our father! We belonged to him; we served him; we walked according to the desires of the flesh; the spirit of disobedience was working in us and we desired the things of the world rather than of the Spirit. But, praise be to God for He quickened us and brought us to life. We were without God and without Christ but have been brought nigh unto God. “Wherefore remember, that ye being in time past Gentiles in the flesh, who are called uncircumcision by that which is called the Circumcision in the flesh made by hands; That at that time ye were without Christ, being aliens from the commonwealth of Israel, and strangers from the covenants of promise, having no hour, and without God in the world; But now in Christ Jesus ye who sometimes were far off are made nigh by the blood of Christ.” (Ephesians 2:11-13).We could never have come into God’s presence but for His grace whereby we were washed by His blood and were lifted out of the miry clay.  ",
		"bible_reading": "1 Samuel 12:1-13:23 \n John 7:1-30 \n Psalm 108:1-13 \n Proverbs 15:4",
		"image_url": "Empty at the moment",
		"today_command": " Neglect not the gift that is in thee, which was given thee by prophecy,  1Timothy 4:14 "
	}, 	
	{
		"devotion_id":12, 
		"devotion_title":"Title 12",
		"devotion": "Today we can be members of organizations such as The Graduates Fellowship, Officers’ Christian Fellowship, Businessmen’s Fellowship, Nurses Fellowship and the like.  Do not these proclaim a certain kind of exclusiveness? But if any preach and teach that such efforts of man are unscriptural and not in line with the principles of God, they like the Apostle Paul, will surely be persecuted and cast out. Churches and fellowships have sprung up all over the world where people of similar social status or language want to gather together as friends. Such togetherness beloved saints, is no different from the social clubs one finds in society such as The Rotary Club, The Lions Club or The Gymkhana Club, where gentry meet and socialize together. The true Body of Christ cannot have such ‘walls’.  However, in most evangelical groups and gatherings we still find such exclusive organizations that are unholy and cheap counterfeits of the true Church. Note that the Apostle Peter did not feel burdened to start a Fishermen Evangelical Fellowship! Nor did Matthew start an Evangelical Tax-collectors Fellowship! Beloved, the early disciples had a vision of the true Body of Christ wherein the hardworking, poor fisherman, the wealthy tax collector and weak, suffering, women were built up together into one Body.",
		"bible_reading": "1 Samuel 14:1-52 \n John 7:31-53 \n Psalm 109:1-31 \n Proverbs 15:5-7 ",
		"image_url": "Empty at the moment",
		"today_command": " Finally, my brethren, be strong in the Lord, and in the power of his might.  Ephesians 6:10"
	}, 	
	{
		"devotion_id":13, 
		"devotion_title":"Title 13",
		"devotion": "“No, a real Jew is anyone whose heart is right with God. For God is not looking for those who cut their bodies in actual body circumcision. but He is looking for those with changed hearts and minds.” (Romans 2:29 Living Bible)  The Apostle Paul writes that he is a true Jew whose circumcision is of the heart. In other words he says that the person who has been renewed within or inwardly, is a true Israelite. The Scripture here is plain and unambiguous. It tells us that the true Israelite may be born anywhere but he will be one whose heart is circumcised, one who has experienced the workings of God within him and one who has thus acquired a new nature. Beloved, God is no longer interested in the circumcision which is outward. In the days of the Apostle Paul, there were Jews who insisted that they were a special people, the chosen people of God who were circumcised according to God’s law. Paul was at pain to explain to them that the circumcision availeth nothing before God; that all the outward actions according to the Mosaic Law would not be of any profit in the New Covenant age.  He emphasizes that all people, including the Jew, had to go the same way to be acceptable of God. There has to be a circumcision of the heart, rather than an outward bodily circumcision.",
		"bible_reading": "1 Samuel 15:1-16:23 \n John 8:1-20 \n Psalm 110:1-7 \n Proverbs 15:8-10",
		"image_url": "Empty at the moment",
		"today_command": "And above all these things [put on] charity, which is the bond of perfectness.  Colossians 3:14 "
	}, 	
	{
		"devotion_id":14, 
		"devotion_title":"Title 14",
		"devotion": "In traditional Christian circles one often hears people say, “My grandfather was a preacher; my father is also a preacher and loves the Lord.”  They imply by that that they also love the Lord because their father loved Him. But this kind of ‘automatic love’ for the Lord by virtue of ones ancestry and birth is a fallacy! Our forefathers may have been mighty men of God who received revelations on several aspects of Christian life, but we shall not benefit from their testimony unless we act by faith and move-on in God. Each person needs to believe, act, obey and move-on in God individually. No one can claim spiritual benefit from what their ancestors did. This also applies to the Jew of this day. Every Israelite in Palestine or Jerusalem must personally put his trust in the Lord and believe by faith. None of them can pose to inherit the promises of God merely because Abraham or Moses or Joshua was their ancestor! There is no discrimination in God’s government. The believer who is not a natural Jew is no longer a Gentile. He is now part of the Israel of God because the middle wall has been broken down by the death and resurrection of our Lord.  ",
		"bible_reading": "1 Samuel 17:1-18:4 \n John 8:21-30 \n Psalm 111:1-10 \n Proverbs 15:11 ",
		"image_url": "Empty at the moment",
		"today_command": " Brethren, pray for us.  1Thessalonians 5:25"
	}, 	
	{
		"devotion_id":15, 
		"devotion_title":"Title 15",
		"devotion": "As the New Testament times open, we observe that God had begun to do a new work amongst His people. First He prepared the way for His Son to come and then He sent His Son that people may receive the truth, the way, and the life.  This plan of God was, however, not a spur-of-the-moment decision. The concept of the Body of Christ, the Church, the corporate man was not an after thought in God’s mind; it was not a reaction to the attitude of the Jews towards the Law and the Temple. God always had the Church upon His heart from the very beginning of time. Just as God’s redemptive plan was conceived within His heart much before the fall of man, so also was the truth of the Body of Christ in His thoughts from the inception of the creative plan of God. Jesus the Son of God did not come merely to save us from our sins, as part of God’s plan of redemption. The Lamb of God was slain from the foundation of the world (Revelation 13:8). So also the Body of Christ was upon God’s heart from the very beginning. So too did God choose us from the beginning unto salvation (II Thessalonians 2:13).  He has chosen every believer before the ‘foundation of the world’ (Ephesians 1:4) and ‘put all things under Christ’s feet’ that He may be ‘the head over all’ things to the Church which is his body, the fullness of Him that filleth ‘all in all’ (Ephesians 1 :22-23).",
		"bible_reading": "1 Samuel 18:5-19:24 \n John 8:31-59 \n Psalm 112:1-10 \n Proverbs 15:12-14",
		"image_url": "Empty at the moment",
		"today_command": " Hitherto have ye asked nothing in my name: ask, and ye shall receive, that your joy may be full.  John 16:24"
	}, 	
	{
		"devotion_id":16, 
		"devotion_title":"Title 16",
		"devotion": "John the Baptist stood upon the banks of the River Jordan and looked at the unbelieving Pharisees as they came forward to be baptized. He knew in his heart that they were not open to receive the truth that the Lord Jesus Christ was going to bring forth. There was a witness in his spirit that these holier-than-thou preachers and pretenders would never accept the truth that they had to die to their self to be built up together into one new man. John realized that they wanted to run away from God’s wrath that was to come upon Jerusalem, the temple and the priesthood. That is why John called them a brood of vipers or a generation of vipers (Matthew 3:7). They were like cunning snakes that were trying to wriggle out of a tight spot. They had not really come to repent and be baptized; they just wanted to step into the waters of River Jordan and come out of it to escape the coming wrath of God and to show that they were outwardly humble and open to the truth (even though it came from a crude prophet like John!). Even today there are many who are only interested in the forgiveness of their past sins. But when it comes to the narrow way and the life of the cross they prefer to go their own way. They raise their hands at meetings to acknowledge God’s precepts but they live contrary to that in their personal lives.",
		"bible_reading": "1 Samuel 20:1-21:15 \n John 9:1-41 \n Psalm 113:1-114:8 \n Proverbs 15:15-17 ",
		"image_url": "Empty at the moment",
		"today_command": "Wives, submit yourselves unto your own husbands, as it is fit in the Lord. Colossians 3:18 "
	}, 	
	{
		"devotion_id":17, 
		"devotion_title":"Title 17",
		"devotion": "“For he shall grow up before him as a tender plant and as a root out of a dry ground: he hath no form nor comeliness; and when we shall see him, there is no beauty that we should desire him”(Isaiah 53:2).   \n\t  While the Lord laid an axe to the unfruitful tree of natural  Israel, the prophets of God in the past had heralded a wonderful promise of a NEW ROOT!  While the Lord uprooted the unfruitful tree of Israel, He also brought forth a new root that would eventually become a tree that would bear the right fruit. God uprooted the unfruitful tree of Israel in the times of Jesus.  The new root would now grow into a fruitful tree consisting of the Jew and the Gentiles. They would be brought up and nurtured together as one tree. This is God’s plan. This new tree will not be uprooted for that which is planted in Christ Jesus cannot ever be unproductive.  There are many, today, who hold to the thought that God will once again bring forth that tree that was hewn down and uprooted. This is contrary to God’s Word. He has only one tree now – the tree planted in Christ, which consists of the Jew and Gentiles.",
		"bible_reading": "1 Samuel 22:1-23:29 \n John 10:1-21 \n Psalm 115:1-18\n Proverbs 15:18-19",
		"image_url": "Empty at the moment",
		"today_command": "Wherefore lift up the hands which hang down, and the feeble knees;  Hebrews 12:12-13 "
	}, 	
	{
		"devotion_id":18, 
		"devotion_title":"Title 18",
		"devotion": "The picture of the Vine and the branches admirably portrays the union and relationship between Christ, and His Church. All the branches, be they Jew, Gentile or Greek, spring from the heavenly Vine. The branch is exactly like the vine, for the vine imparts life to the branches. Though there are many branches, in reality there is only one Vine, one branch, one people, one nature, one fruit. Together they form the fruit bearing tree. They are inseparably ONE, in perfect conformity and absolute consonance. One cannot live without the other. There is one nature, one life, one spirit of the vine. As believers we are individual branches corporately joined to the Living Vine. There are no ‘special’ branches. The sole purpose of the branch is to bear the fruit of the Vine. Just as the branch is the glory of the Vine, so also the fruit is the glory of the branch. “Every branch in me that beareth not fruit He taketh away” (John 15:2). “The branch cannot bear fruit except it abide in the vine” (John 15:4). Those who reject Christ cannot be of this vine, be they the natural sons of Abraham or the inhabitants of Jerusalem.  “He has chosen us and not we Him” (John 15:16). He has chosen us that His purpose may be fulfilled. “... That ye may bear fruit”. There is only one type of fruit; the fruit that is in the image of the seed - a Christ-like life. ",
		"bible_reading": "1 Samuel 24:1-25:44 \n John 10:22-42 \n Psalm 116:1-19 \n Proverbs 15:20-21 ",
		"image_url": "Empty at the moment",
		"today_command": "Give none offence, neither to the Jews, nor to the Gentiles, nor to the church of God:  1Corrinthians 10:32 "
	}, 	
	{
		"devotion_id":19, 
		"devotion_title":"Title 19",
		"devotion": "Some imagine that the temple will be physically built in Jerusalem according to their inaccurate interpretation of God’s Word. If Matthew 24 is for the Jews only as many contend, then we may also infer that John 3:16 is for the Jews for it was spoken to Jews.  We may also foolishly say that to be ‘born again’ is only for the Jews because Jesus spoke that word to Nichodemus who was a Jew. People often fall into error when they divide the Scriptures and apply some portion of it to the Jews, some others to the Gentiles and yet others to the Church. However, the Pauline teaching is distinctly clear that both the Jews and Gentiles will be gathered into one Body which is the Church. Therefore, we need to understand that some misguided people tend to twist and misinterpret the Word of God and that our minds also need to be cleansed from such mentalities. In these last days, let us bind ourselves to the truth that God’s main purpose is to build His Church. His Church is the sole agent of His work in the Kingdom of God; it is through the Church that the Kingdom of God will eventually be established upon this earth. God does not have two agents through whom He purposes to create a new earth. Jesus Christ, our Redeemer, has only one Body which is the Church, in which the Jew and the Gentile are merged and integrated into one new man.",
		"bible_reading": "1 Samuel 26:1-28:25 \n John 11:1-54 \n Psalm 117:1-2 \n Proverbs 15:22-23",
		"image_url": "Empty at the moment",
		"today_command": "We therefore ought to receive such, that we might be fellow helpers to the truth.  3John 1:8 "
	}, 	
	{
		"devotion_id":20, 
		"devotion_title":"Title 20",
		"devotion": "There is an intense downward element in creation.  Left to itself nature declines; it runs wild and loses its character.  Nothing rises or ascends without coming in touch with this propensity, this tendency to go downward.  When we try to lift up or raise any thing, we come face to face with this universal downward propensity.  The Scriptures tells us how that happened.  It all began with one downward step by the first man.  The downward step that Adam took was the beginning of the slip downhill.  One man took that terrible downward step and that set a trend that has become an avalanche.  We read in the book of Genesis that thorns and thistles for ever became symbols of a wrong direction, of labouring and of working by the sweat of the brow to produce something.  We see a battle at large to overcome that tendency in man.  Saints, this inherent strain has marred man’s relation to divine things.   \n\t Today if we want to lift up anything, we come against that universal force that is downward; we come into battle with that.  It is so even in our lives where any desire for ascendancy is met with stiff opposition.  It is not easy to grow spiritually; we don’t gain spiritual heights automatically; any upward growth places severe demands upon us.  ",
		"bible_reading": "1 Samuel 29:1-31:13 \n John 11:55-12:19 \n Psalm 118:1-18 \n Proverbs 15:24-26 ",
		"image_url": "Empty at the moment",
		"today_command": "Be kindly affectioned one to another with brotherly love; in honor preferring one another; Romans 12:10 "
	}, 	
	{
		"devotion_id":21, 
		"devotion_title":"Title 21",
		"devotion": "If we fence up a small piece of land and leave it bare for some time we will find that after several months the entire plot will be crammed with all kinds of shrubs, thistles, thorns and weeds.  The surprising thing is that what comes up is not what had been planted and watered!  Yet there are thorns, thistles and weeds that spring up all around.  They grew up themselves.  This is the law of wilderness.  This is the downward element at work.  And this is true even spiritually.  First is that which is natural and then that which is spiritual.  If we have no concern and care for our spiritual life, it will go down in no time.  Any attitude that leaves our spiritual life to care for itself, any approach that has no specific concern for the quality of this life and any kind of complacency towards our spiritual life can be extremely dangerous because of the ubiquitous law of the wilderness.  Our lethargic approach and complacent mentality is enough to start a downward trend in our spiritual life that will turn it into a spiritual wilderness before long! People are willing to spend hours to watch a cricket match or a soccer game on TV, but to sit with the word of God brings instant drowsiness.  When it comes to God we feel tired and spent for we are insensitive when God’s purpose is involved.  There is a downward pull when the things of God are taken into hand.  ",
		"bible_reading": "2 Samuel 1:1-2:11 \n John 12:20-50 \n Psalm 118:19-29 \n Proverbs 15:27-28",
		"image_url": "Empty at the moment",
		"today_command": "Judge not according to the appearance, but judge righteous judgment.  John 7:24 "
	}, 	
	{
		"devotion_id":22, 
		"devotion_title":"Title 22",
		"devotion": "There is a habitual desire to bring down divine things to human level.  This trend in man to play down things to an easy level has come into its full height today.    It was there in the days of old no doubt, but it is found in greater abundance today.  To make the things of God easier is what some of us do all the time.   In the world people always seek to do things the easy way, the shortcut, the convenient way.  The preachers of today are doing the same.  They are bringing down the things of God to the easy level of man.   Several preachers have diluted the word of God and have made it so easy for the people to follow it.  They take the truths of God’s word and make them into ‘Three Easy Steps’ and ‘Five Easy Ways’. Even the word of God is re-written and made easy in ways that the word of God loses its very meaning.  Many modern translations have changed the original meaning of God’s word for His people.  In trying to make the Bible readable and understandable for the common man the Scripture has lost its power to deliver man from sin and self.   We are living in such times.  It has multiplied into into an evil of horrendous dimensions.  We need to watch over our lives to make sure that we are not caught following any popular trend to bring the things of God down to our own level of humanity.  May God watch over us! ",
		"bible_reading": "2 Samuel 2:12-3:39 \n John 13:1-30 \n Psalm 119:1-16 \n Proverbs 15:29-30 ",
		"image_url": "Empty at the moment",
		"today_command": " And say to Archippus, Take heed to the ministry which thou hast received in the Lord, that thou fulfill it. Colossians 4:17"
	}, 	
	{
		"devotion_id":23, 
		"devotion_title":"Title 23",
		"devotion": "The Church is not a welfare agency for man.  It is a totally wrong concept that people have and bring others into.  The Church is for the Lord and not for man.  The Scripture is clear that He loved the church and gave Himself for her that He might have for Himself a glorious church! (Eph. 5: 27).  The Church is for His own sake and not for ours.  It is unto Him and for Him.  But today the Church has become a place for man’s welfare. Church is considered a social institution today! May God deliver us from this terrible error!   No wonder people come to church seeking their own welfare! They do not come to church with the intention of giving their lives to God, but they come to receive and take away whatever they can get for themselves. The so called ‘churches’ are busy running schools and hospitals today.  They are engaged in running many social works.  It is so clear that they have strayed from God’s primary purpose for the Church.  What a tragedy!  May God deliver His people from such concepts, ideas and teachings!  It is His Church and for His purpose.  This realization will change your whole life.  If some people still have this idea that the church is meant for their own benefit and wellbeing, they need to change.  If you give yourself to God, He will not overlook your welfare.  No, He will never.  If you set yourself to meet His need, He will not neglect to meet your need. ",
		"bible_reading": "2 Samuel 4:1-6:23 \n John 13:31-14:14 \n Psalm 119:17-32 \n Proverbs 15:31-32",
		"image_url": "Empty at the moment",
		"today_command": " See that ye refuse not him that speaketh. Hebrews 12:25"
	}, 	
	{
		"devotion_id":24, 
		"devotion_title":"Title 24",
		"devotion": "If you are among those who stand for the recovery of lost values, lost standards and lost spiritual measures, you will not be a popular figure.  On the contrary you will be lonely and ever thrust into further lonely paths.  You will be rejected by many. The Prophets were very lonely men and their ministry was very costly.  How true this was in the New Testament also!  Towards the end of Apostle Paul’s life, as the path began to become exceedingly narrow, Paul says all in Asia forsook him (2 Tim. 1 :15).  Though he was a prominent preacher at one time, as can be gauged by people offering to pluck out their eyes for him (Gal. 4:14-15), yet a time came when they all left him.  They owed their very lives to the Apostle Paul but in the end they forsook him.  We see that they paid a heavy price for forsaking him for those churches were severely dealt with by the Lord (see Revelations chapters 2 and 3).  Rejecting the man who had brought them to life in Christ resulted in great danger to them spiritually.  It eventually resulted in their losing their place in the things of God.  Let us remember that Paul faced severe rejection in his life and we also will face refutation and repudiation if we stand for the recovery of lost ground.  ",
		"bible_reading": "2 Samuel 7:1-8:18 \n John 14:15-31 \n Psalm 119:33-48 \n Proverbs 15:33 ",
		"image_url": "Empty at the moment",
		"today_command": "If we live in the Spirit, let us also walk in the Spirit. Galatians 5:25 "
	}, 	
	{
		"devotion_id":25, 
		"devotion_title":"Title 25",
		"devotion": "“My strength is made perfect in weakness.” (2 Cor. 12:9).  His strength is made perfect in our weakness.  He never makes provision for the weakness of our flesh.  Don’t expect God to be a baby sitter over your weaknesses!  His strength will be made perfect in that area where we are weak.  He makes no provision for our flesh, but He makes provision for us to be overcomers.  He makes no provision to bring us down or lower our calling.  Many times believers pray confessing their weaknesses.  This shows that they are asking God to come down to their level!  But what the Lord says is, “I know you are weak.  I will come to pick you up.  I agree you are weak for I am your maker, but I will not be a baby sitter to your weaknesses!  I will come and my strength will be made perfect in the area of your weakness.  Are you willing to let My strength take over?  I will help you, but I will not let you limit me.  I will come to strengthen and to lift you up.”   Halleluiah! \n\t When we say that we are weak, and have no ability, then God listens to us, but let us not try to bring God to accept our own low measure and thus limit Him.  This is where many have erred and left this call.  ",
		"bible_reading": "2 Samuel 9:1-11:27 \n John 15:1-27 \n Psalm 119:49-64 \n Proverbs 16:1-3",
		"image_url": "Empty at the moment",
		"today_command": " Despise not prophesyings. 1Thessalonians 5:20"
	}, 	
	{
		"devotion_id":26, 
		"devotion_title":"Title 26",
		"devotion": "Some refer to Palestine as a ‘holy land’ but there is nothing holy about Palestine or Jerusalem for these are just earthly places.  There is no reason for us to worship and offer sacrifices in Jerusalem. It is difficult to accept what people say concerning the building of a natural temple at Jerusalem in the last days. We are to emphasize the things of the Spirit. God is now moving in the realm of the Spirit. We must understand the spiritual meaning of New Testament things from many Old Testament teachings so that we may really understand the purposes of God. We are to give ourselves to those spiritual things that the Holy Spirit of God reveals to us. \n\t Beloved, let us be quite clear that in these days that God is concerned only about one land and one city, which is a spiritual land and a spiritual city - a heavenly city.  The city of God is the new Jerusalem that cometh down from above. Let us not be deceived by the mind of man which plays down and devalues the things of God. It is time to forget the realm of the natural, the tangible and the earthly. Now is the time to press into the realm of the spiritual. Let us take the true teachings of our Teacher to heart.",
		"bible_reading": "2 Samuel 12:1-31 \n John 16:1-33 \n Psalm 119:65-80 \n Proverbs 16:4-5 ",
		"image_url": "Empty at the moment",
		"today_command": "Masters, give unto your servants that which is just and equal; knowing that ye also have a Master in heaven Colossians 4:1 "
	}, 	
	{
		"devotion_id":27, 
		"devotion_title":"Title 27",
		"devotion": "Many believers are still wrapped up in the natural realm particularly concerning Israel. Somebody once said that he wanted to be baptized in the river Jordan and was waiting to go to Palestine. This sounds spiritual, but it is a natural, carnal desire. Then again, there are people, even Spirit-filled groups, that often organize trips to the so called ‘holy land’. One spirit-filled believer returned with a bottle containing the water of the river Jordan, and distributed the so-called ‘holy water’ to friends and relatives. This is a heathen concept. Someone brought a piece of wood from Jerusalem believing that it was a part of the wooden cross upon which Christ was crucified!  They even embedded a few splinters in the house they were constructing hoping thereby to obtain God’s blessings upon their dwelling place. Such desires and actions spring from the heart of a soulish man and have nothing to do with spirituality. It is so sad to see that people are deceived into believing that relics from the birthplace of Christ have a spiritual value and power to keep them from evil. Undoubtedly, trips to Jerusalem and Palestine will have educational and informative value, especially for young people, but to think that one could grow spiritually by visiting Jerusalem is the height of incredulity",
		"bible_reading": "2 Samuel 13:1-39 \n John 17:1-26 \n Psalm 119:81-96 \n Proverbs 16:6-7",
		"image_url": "Empty at the moment",
		"today_command": " Beware of dogs, beware of evil workers, beware of the concision.  Philippians 3:2"
	}, 	
	{
		"devotion_id":28, 
		"devotion_title":"Title 28",
		"devotion": "If Apostle Paul were to walk into some of the churches of our day and if he were to hear what people discuss about the church, the temple, the land, the city and so on, he would be shocked beyond measure!  Perhaps he would jump up to take a stick and chase them out of the church! Why? Because what people teach and believe in church today is so contrary to the burden that the Apostle had. It would be no surprise if Apostle Paul were to remark, “You are worshipping an unknown God because you worship in ignorance” (that is what Paul said when he went to Athens...Acts 17:23). Many believers are unaware of their place and inheritance in God. They do not know God’s purposes for their lives.  One can say, God is still an ‘unknown God to them in many areas of their lives. They do not know their identity in Christ Jesus. They cannot say why God saved them. All they know is that they shall not go to hell.  O what a pathetic state for some people to be in! Our inheritance has nothing to do with silver and gold and other corruptible things. We have an incorruptible spiritual inheritance. God is not glorified by the things of the flesh for He is holy. No flesh, no natural man, no natural temple or literal land shall glorify Him who is God Almighty.",
		"bible_reading": "2 Samuel 14:1-15:22 \n John 18:1-24 \n Psalm 119:97-112 \n Proverbs 16:8-9 ",
		"image_url": "Empty at the moment",
		"today_command": "If any [man] will come after me, let him deny himself, and take up his cross daily, and follow me.  Luke 9:23 "
	}, 	
	{
		"devotion_id":29, 
		"devotion_title":"Title 29",
		"devotion": "In the Old Testament Abraham looked for a city, but WE HAVE COME UNTO A CITY. We must accept this as a present reality and an ongoing experience of our lives. Paul says, “Ye are come unto Mount Zion, and the city of the living” God, the heavenly Jerusalem’ and then follows up by saying,’ “to the general assembly and the church of the first born” (Hebrews 12:23). The phrase ‘general assembly’ denotes ‘a company’ or to use a modern Word, a congregation. We have come to that company of the just and the righteous.  We have come to Jesus, the mediator of the new covenant. We have come into a true covenant with God which has been procured by the blood of Jesus. Let us not be confused by the traditional teaching that only harps on what we shall possess when He shall come again. We need to walk in the light of God’s truth. We need to know and experience the reality of His presence in our daily lives. We are His peculiar people (I Peter 2:9). We are His chosen people which ‘in time past were not his people’ (I Peter 2:10). It is not natural Jews who are His chosen people today but the people who having believed Christ, repented, and received new birth.  They have become His peculiar people.",
		"bible_reading": "2 Samuel 15:23-16:23 \n John 18:25-19:22 \n Psalm 119:113-128 \n Proverbs 16:10-11",
		"image_url": "Empty at the moment",
		"today_command": " Submitting yourselves one to another in the fear of God. Ephesians 5:21"
	}, 	
	{
		"devotion_id":30, 
		"devotion_title":"Title 30",
		"devotion": "John saw a remarkable sight! He saw God bringing forth the holy city, Jerusalem (Revelation 21:1-3).  He saw the city descending from the heavens. The city he saw coming down was none other than the mature, glorified Church of the living God. How could this be, one asks? According to God’s Word those who have been born again by the Spirit of God are seated in heavenly places (Ephesians 2:6). They have entered a heavenly or a spiritual realm. So in a spiritual and divine sense, what John saw upon the island in the Spirit was the birthing of the glorified Church. \n\t Beloved, the time is soon coming when there shall be a manifestation of this glorious Church upon the earth in a measure that the world has never seen. John saw a projection of the Church, upon His mind’s screen, as it were.  He saw her coming down from out of the heavens and descending upon the earth, prepared as a bride adorned for her husband. He saw by the eye of the Holy Spirit of God, a pure Church without spot and wrinkle, descending and becoming a reality upon the earth.John saw God dwelling among men. He saw the fulfillment of God’s promises to mankind. He saw the church in all her glory-the glory of God. ",
		"bible_reading": "2 Samuel 17:1-29 \n John 19:23-42 \n Psalm 119:129-152 \n Proverbs 16:12-13 ",
		"image_url": "Empty at the moment",
		"today_command": "Wherefore gird up the loins of your mind, be sober, 1Peter 1:13 "
	} 	

]