[
	{
		"devotion_id":0, 
		"devotion_title":"Title 0",
		"devotion": "“Again the kingdom of heaven is like unto a treasure hid in a field; which when a man hath found, he hideth, and for joy thereof goeth, and selleth all that he hath, and buyeth that field”. (Matthew 13:44). This parable is often used to explain how one should find salvation, and buy it. May be we could see it from another angle. The kingdom is like a treasure hid in a field. Individually and corporately, we are that earthen field. The kingdom is in us, but hidden, veiled by the flesh. Jesus found it, and “for the joy that was set before him, endured the cross” and He bought that field. He paid the price in full. He purchased our earthen vessels. He also has an eternal plan for us. “For ye are bought with a price; therefore glorify God in your body and in your spirit, which are God’s” (I Corinthians 6:20). Our body has been purchased; so also our spirit. What is He going to do with this earthen body of ours? The Word of God says, “who shall change our vile body, that it may be fashioned like unto his glorious body...” (Philippians 3:21). Praise His wonderful name! He will take this very earthly tabernacle we now live in, and change it into a glorious and eternal temple. “We shall not all sleep, but we shall all be changed” (I Corinthians 15:51).",
		"bible_reading": "2 Chronicles 30:1-31:21 \n Romans 15:1-22 \n Psalm 25:1-15 \n Proverbs 20:13-15",
		"image_url": "Empty at the moment",
		"today_command": "Give to Caesar what is Caesar’s, and to God what is God’s. (on giving) – Matthew 22:21"
	},
	{
		"devotion_id":1, 
		"devotion_title":"Title 0",
		"devotion": "What is tradition? Tradition is the rules handed down to us by our elders and forefathers. When man gets smarter than God then he gets into tradition. When man takes the Word of God and reads it and says, “The Word of God says, this but I say this!” then he is on the way of establishing a tradition. The scribes were breaking the commandment of God by giving themselves to the tradition of man. They did not realise that by keeping the tradition of man they were breaking and transgressing and disobeying God’s commandments. Jesus emphasises that by adhering to their traditions, the scribes had made the commandments of God to be null and void. Jesus said that they invalidated the Word of God for the sake of their traditions. If you are a true disciple of Jesus you will also be ready to break any tradition today. One of the greatest enemies of God’s purposes in these days is the “traditions of men”. But the Scripture says, “You shall know the truth (ie. you shall know Him; you shall know the Word) and the truth shall set you f ree, indeed”.",
		"bible_reading": "2 Chronicles 32:1-33:13 \n Romans 15:23-16:9 \n Psalm 25:16-22 \n Proverbs 20:16-18",
		"image_url": "Empty at the moment",
		"today_command": "Peace be with you. – Luke 24:36"
	},
	{
		"devotion_id":2, 
		"devotion_title":"Title 0",
		"devotion": "“In the days of His flesh ( Jesus) offered up definite, special petitions (for that which He not only wanted but needed) and supplications, with strong crying and tears to Him Who was (always) able to save Him (out) from death, and He was heard because of His reverence toward God (His godly fear, His piety, in that He shrank from the horrors of separation from the bright presence of the Father). Although He was a Son, He learned (active, special) obedience through what He suffered and (His completed experience) making Him perfect (equipped), He became the Author and Source of eternal salvation to all those who give heed and obey Him,” (Hebrews 5:7-9, Amplified). The Lord Jesus had reverence for the will of God. We need to learn true obedience to the will of God. It is one of the most important ingredients in the life of His sons today. We must trust the Father and submit to His perfect will. The Greek word ‘PASCHO’ is used here to denote ‘suffering’. This word does not refer to His suffering on the cross. He learned obedience long before He got to Calvary. He endured every circumstance God brought His way. He allowed the perfect will of God to take place in His life regardless of humiliation and discomfort.",
		"bible_reading": "2 Chronicles 33:14-34:33 \n Romans 16:10-27 \n Psalm 26:1-12 \n Proverbs 20:19",
		"image_url": "Empty at the moment",
		"today_command": "Father, glorify your name! – John 12:28"
	},
	{
		"devotion_id":3, 
		"devotion_title":"Title 0",
		"devotion": "“And being made perfect, he became the author of eternal salvation unto all them that obey him;” (Hebrews 5:9)The Lord Jesus was perfect when He was born and laid in the manger. With regard to sin and impurity, He was perfect. But in the matter of fulfilling the purposes of God upon this earth, He had to be ‘made perfect’. He was brought to that place of perfection through the dealings of God. And all sons must go the same way. Are you suffering? Do you revere His will? Are you allowing the will of God to take its toll on your ways and desires? Are you enduring every circumstance of life with the knowledge that He is the Lord of your life? The attacks of Satan cannot destroy a son who is so submitted to the Lord. Job and Satan both found out this fact. Every attack of the enemy is only to be overcome. But let the will of God dominate our own wills, our ways, and our self-life. Let the life of the Son within us rise up. All the dealings of God in our lives have one thing in view— that we may have “a harvest of f ruit which consists in righteousness — in conformity to God’s will in purpose, thought and action, resulting in right living and right standing with God.” (Hebrews 12:11 Amplified).",
		"bible_reading": "2 Chronicles 35:1-36:23 \n 1 Corinthians 1:1-17 \n Psalm 27:1-6 \n Proverbs 20:20-21",
		"image_url": "Empty at the moment",
		"today_command": "Wake up! – Revelation 3:2"
	},
	{
		"devotion_id":4, 
		"devotion_title":"Title 0",
		"devotion": "“(The purpose is) that through the church the complicated, many-sided wisdom of God in all its infinite variety and innumerable aspects might now be made known to the angelic rulers and authorities (principalities and powers) in the heavenly sphere.” (Ephesians 3:10, Amplified). Upon this earth in this realm of time, God shall have a glorious church without spot and wrinkle or any defilement. This will not just be a theory, or a mystical, hazy, abstract, far-off dream. It will be a visible operation, made real in a company of people who bring forth the life of His Son Jesus, a people, born not of the will of the flesh, but born of God. The ‘many-sons’ are born of the incorruptible Seed, by the Word of God. They are His sons and He is their God. He shall bring these sons unto glory for they shall overcome the world, the flesh and the devil.The Lord will share His throne, His authority and power and dominion with them. God’s whole programme is aimed at the express purpose of perfecting His sons in this hour. The actions of our enemies, and even all circumstances, are controlled by the Lord with the intent of bringing forth out of us every expression and every spirit that is unlike Him, so that he can deal with them and deliver us.",
		"bible_reading": "Ezra 1:1-2:70 \n 1 Corinthians 1:18-2:5 \n Psalm 27:7-14 \n Proverbs 20:22-23",
		"image_url": "Empty at the moment",
		"today_command": "Believe me when I say that I am in the Father and the Father is in me – John 14:11"
	},
	{
		"devotion_id":5, 
		"devotion_title":"Title 0",
		"devotion": "How careful we need to be in the place of our work! Why do we borrow the wisdom of this world to live our lives? How careful and discerning we ought to be! If we borrow the wisdom of this world, it will question that little faith that God has placed within each one of us. Several begin well in Christ, but the rational man comes in and begins to question the very faith that had saved them. We have to be sensitive about this issue. Our desire should be to have knowledge along with prayers, “Lord, let my learning and my knowledge be together with my God.” He is our safety. Every bit of knowledge we acquire is together with Christ who is made unto us the wisdom of God. Let us not have anything without referring to Him, who is the Wisdom of God unto us. 1Cor. 1:21 For when the world with all its earthly wisdom failed to perceive and recognize and know God by means of its own philosophy, God in His wisdom was pleased through the foolishness of preaching [salvation, procured by Christ and to be had through Him], to save those who believed (who clung to and trusted in and relied on Him). We need to give ourselves to the inward prompting of the Spirit so that we may remain related to Christ who is made unto us wisdom.",
		"bible_reading": "Ezra 3:1-4:23 \n 1 Corinthians 2:6-3:4 \n Psalm 28:1-9 \n Proverbs 20:24-25",
		"image_url": "Empty at the moment",
		"today_command": "Stop grumbling among yourselves – John 6:43"
	},
	{
		"devotion_id":6, 
		"devotion_title":"Title 0",
		"devotion": "For there are certain men crept in unawares, who were before of old ordained to this condemnation, ungodly men, turning the grace of our God into lasciviousness, and denying the only Lord God, and our Lord Jesus Christ.” ( Jude 3, 4). The word ‘lasciviousness’ means lacking moral discipline, or having no regard for acceptable moral standards. The English word comes from a Latin word ‘lesvia’ which means loose; runaway passion; lust. It signifies lawlessness and the casting away of restraint. It represents all that is filthy and degraded. Jude proclaims that in the last days, men will come into the church of Christ and turn the grace of God into lasciviousness. How terrible! They will turn the grace of God and manipulate it until it allows one to live in all kinds of lawlessness, immorality and filth. Jude says that what is required of us, therefore, is to contend and fight hard to maintain and live in this grace that God has given to us. Jesus called the sin of lasciviousness the sin of the heart. Jude says they will take God’s grace and suddenly twist it. They will manipulate the truth so that it produces immorality in God’s people. False things are not going to enter into the church from outside the church; they will enter the church from within, through the integral ministries operating in the church.",
		"bible_reading": "Ezra 4:24-6:22 \n 1 Corinthians 3:5-23 \n Psalm 29:1-11 \n Proverbs 20:26-27",
		"image_url": "Empty at the moment",
		"today_command": "Throw your net on the right side of the boat and you will find some. – John 21:6"
	},
	{
		"devotion_id":7, 
		"devotion_title":"Title 0",
		"devotion": "“ This hope we have as an anchor of the soul, a hope both sure and steadfast and one which enters within the veil, where Jesus has entered as a forerunner for us, having become a high priest forever according to the order of Melchizedec.” (Hebrews 6 : 19-20, NASB) A forerunner is the first one to complete the run or race and who is followed by many others. If there is only one person running then he cannot be called a forerunner. A person be-comes a forerunner when many more run the same race after him Jesus having completed the course and has entered behind the veil to sit at the right hand of the Father. He is seated, behind the veil at the right hand of the Father. And it is here that our High Priest and Forerunner intercede with the Father to say that there are many more brothers and sisters running behind Him. He is seated behind the veil that we may also complete the race and come to that place, behind the veil, where He is seated. He is our hope, for as long as He is there, we are drawn to that very place where He abides and sits with the Father. “Wherefore he is able to save them to the uttermost that come unto God by him, seeing he ever liveth to make intercession for them.” (Hebrews 7: 25). Our High Priest the Lord Jesus Christ is ever living to make intercession for us. He talks to the Father and implores Him to stay His judgments upon us.",
		"bible_reading": "Ezra 7:1-8:20 \n 1 Corinthians 4:1-21 \n Psalm 30:1-12 \n Proverbs 20:28-30",
		"image_url": "Empty at the moment",
		"today_command": "Do not be afraid of them (those that persecute you) – Matthew 10:26"
	},
	{
		"devotion_id":8, 
		"devotion_title":"Title 0",
		"devotion": "“Therefore I write these things being absent, lest being present I should use sharpness, according to the power which the Lord hath given me to edification, and not to destruction.” (2 Corinthians 13:10) The New Century Bible says, “I am writing this while I am away from you so that when I come I will not have to be harsh in my use of authority. The Lord gave me this authority to build you up, not to tear you down.” The purpose of true ministerial correction in our lives is to build us up and not to destroy us. The aim of anointed ministries is that the saints of God may not be defiled or contaminated and lose their calling in their lives. In the early church, in spite of good, sound, counsel from men of the stature and anointing of the Apostle Paul, the church lapsed into dreadful conditions. If such a thing could happen in the days when men like the Apostle Paul counselled the church, think of the grave danger that the present church experiences today! Beloved, it is awesome and frightening to contemplate this! Today, many come into the house of God only to feed their flesh and souls; they have little thought for the condition of their spirit. They live in great deception, just as some of the Corinthians did. They come to the house of God dutifully, but they fail to repent of their sins.",
		"bible_reading": "Ezra 8:21-9:15 \n 1 Corinthians 5:1-13 \n Psalm 31:1-8 \n Proverbs 21:1-2",
		"image_url": "Empty at the moment",
		"today_command": "Love one another. As I have loved you, so you must love one another. John 13:35"
	},
	{
		"devotion_id":9, 
		"devotion_title":"Title 0",
		"devotion": "“And the serpent cast out of his mouth water as a flood after the woman, that he might cause her to be carried away of the flood.” (Rev 12:15).The picture we get here is of an enraged enemy spewing out evil like flood waters on the earth. This talks about a fuming Satan who will invade the earth in the last days to seduce God’s people. Satan will be occupied in spewing forth a flood of evil and filth upon the earth in the last days. But, through it all, God’s true bride and remnant will be preserved! Though she will be attacked mercilessly by Satan, yet she will be safe and secure in a ‘prepared place’ of God. Men of God, leaders, and people in responsibility, have to be very careful in this hour. From coast to coast, the terrible sin of immorality is becoming an epidemic in the church. Millions are immersing themselves in river of lawlessness of every kind. People are bent upon feeding their souls and their flesh. As a result, millions of believers have developed pitiable moral standards; they are continuously living without any holy restraints. Beloved, believe me, the sin of immorality in the midst of God’s people has reached terrible proportions today. This is true not only in the West but also in our country. Satan’s evil flood waters are sweeping over this country like a Tsunami! The enemy is bent upon deceiving the children of God. O may God help us!",
		"bible_reading": "Ezra 10:1-44 \n 1 Corinthians 6:1-20 \n Psalm 31:9-18 \n Proverbs 21:3",
		"image_url": "Empty at the moment",
		"today_command": "Listen to him! (God speaking to the disciples about Jesus) – Mark 9:7"
	},
	{
		"devotion_id":10, 
		"devotion_title":"Title 0",
		"devotion": "For he saith to Moses, I will have mercy on whom I will have mercy, and I will have compassion on whom I will have compassion. ..Therefore hath he mercy on whom he will have mercy, and whom he will he hardeneth....And that he might make known the riches of his glory on the vessels of mercy, which he had afore prepared unto glory,.. (Romans 9:15, 18,23). Let us remember that there is a selectiveness of God at work in our lives. It is foolish to think that you have been saved because you cried out to God more than many others! This selectivity of God continues to work in our lives even after we have been saved. Some friends of mine, who were saved at the same time as I was, experienced a splendid beginning in their spiritual lives, but today, they are far away from God’s ultimate purposes. However, I have been carried as it were upon the wings of an eagle. Who can explain these workings of God except to say that there is a hand of God that comes upon us! It’s not that you found Him but He has found you! That is the reality. If the grace of God has appeared to you, then remember that God has a purpose for you.Every person who is saved must know that he is called and chosen by God for a specific purpose that God has in mind. We need an in-wrought work of God within our spirit to know and accept the fact that we are called according to His purpose.",
		"bible_reading": "Nehemiah 1:1-3:14 \n 1 Corinthians 7:1-24 \n Psalm 31:19-24 \n Proverbs 21:4",
		"image_url": "Empty at the moment",
		"today_command": "Do not judge, or you too will be judged. – Matthew 7:1"
	},
	{
		"devotion_id":11, 
		"devotion_title":"Title 0",
		"devotion": "“Lot, vexed with the filthy conversation of the wicked: (For that righteous man dwelling among them, in seeing and hearing, vexed his righteous soul f rom day to day with their unlawful deeds;) (2 Peter 2:7) Lot saw and heard men in his day and he was vexed by their unlawful deeds. Lot was a righteous man but because he lived with evil people, his good heart was hurt by the evil things he heard. He was vexed in his being by the things he saw and heard in Sodom. It was so tasteful and appealing to him that he continued to remain in their midst. Beloved, those who are sitting on the fence in these days are going to fall prey to the terrible things that are happening in religious circles in these last days. Those who refuse to enter into the ark of God’s safety will be swept away in these last days by the terrible flood waters that will be released by Satan. It is for us to make sure that we are in a place of safety. We must refuse to sit on the fence so that we can have the good of both worlds. “Oh, the joys of those who do not follow the advice of the wicked, or stand around with sinners, or join in with mockers.” (Psalm 1:1)",
		"bible_reading": "Nehemiah 3:15-5:13 \n 1 Corinthians 7:25-40 \n Psalm 32:1-11 \n Proverbs 21:5-7",
		"image_url": "Empty at the moment",
		"today_command": "Do not be afraid of those who kill the body but cannot kill the soul. Rather, be afraid of the One who can destroy both soul and body in hell. – Matthew 10:28"
	},
	{
		"devotion_id":12, 
		"devotion_title":"Title 0",
		"devotion": "There were so many difficulties that came upon Apostle Paul, yet something held him up and sustained him through all the perils he faced from time to time. Paul, the Apostle says, “We were pressed out of measure, above strength, inasmuch that we despaired even of life“ (2 Corinthians 1:8).There is an ‘indefinable something’ of God that sustains us in every crisis and dilemma, beloved.There is a grip of God upon our lives. When we become despondent, when we feel we cannot go on any longer, when the situation we face seems untenable, unbearable and unsurmontable, an ‘indefinable something’ holds us and takes us through that circumstance! Something holds us, grips us, and refuses to let us go in any way but the way of God!There is a substance in our salvation that is incomprehensible to us.That indefinable element of God’s holding power or keeping power will not allow the situation to get the better of us. But let us not take this in the wrong sense and make it a doctrine. Let us not say that we can live in any way we want and yet be in the centre of God’s purpose. Do you experience the deep reality of something keeping you and holding you in the midst of every adverse condition? Can you say that there is a consciousness deep within, that tells you that you are being ‘kept’, day by day, by an unseen Divine hand!",
		"bible_reading": "Nehemiah 5:14-7:73 \n 1 Corinthians 8:1-13 \n Psalm 33:1-11 \n Proverbs 21:8-10",
		"image_url": "Empty at the moment",
		"today_command": "Do not let your hearts be troubled. – John 14:1"
	},
	{
		"devotion_id":13, 
		"devotion_title":"Title 0",
		"devotion": "Saving of man from sin, death and hell and getting them to heaven was nothing compared to what Paul saw as to the significance of a believer now in God's economy in His Son - even their destiny! This is what he explains with great clarity in the books of Ephesians and Colossians.Verses 5 to 11 of Chapter 1 of Ephesians, show us clearly that redemption by the blood of Jesus Christ, the forgiveness of sins and even the obtaining of an inheritance in Christ are all part of our salvation. Thus our salvation has a much higher, purpose, beloved. We are often guilty of limiting our salvation to a few things. If you read the writings of Paul carefully, you will realise that his burden for unbelievers was that they might be saved from sin. When it came to believers, however, Paul’s burden was that the believers might live a holy and godly life. He told the believers that the things that they had been called into were much higher — much beyond forgiveness of sins and having a place in Heaven. In the book of Ephesians, we are lifted beyond time to see that our redemption is deeper than the forgiveness of sins. It is something more than being saved from sins.There is a redemption that is ready to be revealed in these last days. It is much deeper and higher than mere deliverance from sin and finding a berth in Heaven.",
		"bible_reading": "Nehemiah 7:73-9:21 \n 1 Corinthians 9:1-18 \n Psalm 33:12-22 \n Proverbs 21:11-12",
		"image_url": "Empty at the moment",
		"today_command": "Seek and you will find; – Matthew 7:7"
	},
	{
		"devotion_id":14, 
		"devotion_title":"Title 0",
		"devotion": "John the Baptist said “He must increase and I must decrease“ ( John 3:30). What this implies is that there must be a growing revelation of Christ in our lives – that the revelation of Christ must increase in our lives, so that there will be a decrease of the old humanity in our lives, as well. The Scripture does not say “I must decrease and He must increase“. The answer of God for me to decrease is that He may increase. When Jesus increases in me by revelation, I shall experience a decrease of my self- life. When there is a growing revelation of the Son and a decrease of the old humanity, there will also be a growing liberation in our lives. We will have a revelation of His Purpose when we have a revelation of the Son. Everything is locked up in the Son. God’s whole emphasis is in His Son, the Lord Jesus Christ. When Apostle Paul had a revelation of Jesus Christ, then he had a revelation of God’s purposes. Without a revelation of Jesus Christ, the Son of God, we will not be able to make an entrance into the purposes of God in our lives. What we need, therefore, above all is for the Father to give us a revelation of the Son in our spirit.",
		"bible_reading": "Nehemiah 9:22-10:39 \n 1 Corinthians 9:19-10:13 \n Psalm 34:1-10 \n Proverbs 21:13",
		"image_url": "Empty at the moment",
		"today_command": "Trust in God; – John 14:1"
	},
	{
		"devotion_id":15, 
		"devotion_title":"Title 0",
		"devotion": "“Behold, I am against them that prophesy false dreams, saith the LORD, and do tell them, and cause my people to err by their lies, and by their lightness; yet I sent them not, nor commanded them: therefore they shall not profit this people at all, saith the LORD.” ( Jeremiah 23:32). The word ‘lightness’ means ‘froth’ or frivolity (playfulness). In other words, Jeremiah says that these false teachers laugh at the things that are to be revered. Have you seen the lightness with which some people handle things in the house of God? Everything they do is a mockery to the Lord. There is no respect and reverence for His name. They laugh at things that are to be respected and viewed with awe. They scoff at His sovereignty; they mock those who are sober. They ridicule the soberness that accompanies the worship of the Lord. What is the devil’s aim in bringing about and encouraging a spirit of lightness in the church? The devil’s purpose in bringing in a spirit of lightness in the church is to get us to believe that the Lord is not serious about sin. Satan wants us to think that with God there is no such thing as wrath for He is a God of love. The enemy of God wants God’s people to be inoculated with the false idea that in His love for us, the Lord will even overlook sin and shame. Beware!",
		"bible_reading": "Nehemiah 11:1-12:26 \n 1 Corinthians 10:14-33 \n Psalm 34:11-22 \n Proverbs 21:14-16",
		"image_url": "Empty at the moment",
		"today_command": "Repent therefore! Otherwise, I will soon come to you and will fight against them with the sword of my mouth. – Revelation 2:16"
	},
	{
		"devotion_id":16, 
		"devotion_title":"Title 0",
		"devotion": "“All things are delivered unto me of my Father: and no man knoweth the Son, but the Father; neither knoweth any man the Father, save the Son, and he to whomsoever the Son will reveal him.” (Matthew 11: 25-27) This Scripture speaks for itself. As we listen to the inner voice of the Spirit in these fragments of the Divine Word, we will surely begin to feel a sense of tremendous meaning,value and content. We should humble ourselves and be like people who have come to the doors of a new realm, full of the unknown, unfamiliar and unexplored truth. At the very threshold, we meet with the statement, “NO MAN KNOWETH THE SON BUT THE FATHER“. This statement is intended to check our step! Now listen saints, if we approach with a sense of knowing or already possessing something, or with a sense of contentment and personal satisfaction, or with a sense other than of needing to know everything, then that statement should bring us to a standstill, at once, for it says, “NO MAN KNOWETH“! No man can know the Son, except the Father! Blessed are the people to whom the Father reveals His Son. Often we think we know the Lord and all the Scriptures concerning the Lord. However, we do not know the Son, as we ought to.",
		"bible_reading": "Nehemiah 12:27-13:31 \n 1 Corinthians 11:1-16 \n Psalm 35:1-16 \n Proverbs 21:17-18",
		"image_url": "Empty at the moment",
		"today_command": "Remain in me, and I will remain in you. – John 15:4"
	},
	{
		"devotion_id":17, 
		"devotion_title":"Title 0",
		"devotion": "Satan is planting a lie in the hearts of God’s people that God’s grace covers unrighteousness! The devil entices us to believe that we can go on sinning fearlessly because His judgments are lie in the wake of God’s immense love and grace for the believer. Never believe that lie. Our God is a righteous judge; He is a holy God who cannot tolerate sinfulness and licentiousness. Millions are drinking moral poison from the devil’s cup of deception; they mock the Lord’s people and laugh at the serious life of the devoted remnant. Sometimes, the enemy whispers in a believers ear, “Don’t be frightened by your lust for worldly things. There is abundant mercy and forgiveness in the Lord. The Lord is good all the time.” Such thoughts are welcomed and readily accepted by many believers. As a result of this, they become guilty of holding the truth in unrighteousness. Saints, such is the culture of disrespectful and impious believers; they sing a popular song for it is being sung in every church. Soberness, reverence and fear has fled from the congregation and gathering of His saints. May God help us not to be swept away by these flood waters in the last days. Let us make a determined bid to enter into the ark of God’s safety in these last days. May we not just gaze at those who are entering into the ark, but make sure that we fail not to enter in along with them while the flood waters of deception are still lapping the sides of the ark.",
		"bible_reading": "Esther 1:1-3:15 \n 1 Corinthians 11:17-34 \n Psalm 35:17-28 \n Proverbs 21:19-20",
		"image_url": "Empty at the moment",
		"today_command": "Seek first his kingdom and his righteousness, and all these things will be given to you as well. – Matthew 6:33"
	},
	{
		"devotion_id":18, 
		"devotion_title":"Title 0",
		"devotion": "“For the grace of God that bringeth salvation hath appeared to all men, Teaching us that, denying ungodliness and worldly lusts, we should live soberly, righteously, and godly, in this present world;Looking for that blessed hope, and the glorious appearing of the great God and our Saviour Jesus Christ; (Titus 2:11-13). The Scriptures make it very clear that the grace of God does two things in the life of every believer. Firstly, it produces anticipation for the coming of the Lord. Secondly, it inculcates a godly fear and a holy reverence for the Lord. These two inward aspects work co-jointly and inseparably in God’s people. We cannot possess one without the other. It cannot be that we anticipate His coming eagerly, but at the same time, continue to live without godly fear and reverence. It is impossible for us to possess one without the other if the grace of God is upon us. But what we see today is that while everyone is waiting for the coming of the Lord Jesus, their lives and their hearts do not exhibit godly fear and reverence. This is nothing short of turning the grace of God into immorality because of the deception of the evil one. In other words, the grace of God produces reverence and godly fear. Reverence includes awe, respect, and soberness.",
		"bible_reading": "Esther 4:1-7:10 \n 1 Corinthians 12:1-26 \n Psalm 36:1-12 \n Proverbs 21:21-22",
		"image_url": "Empty at the moment",
		"today_command": "Ask and you will receive, and your joy will be complete. – John 16:24"
	},
	{
		"devotion_id":19, 
		"devotion_title":"Title 0",
		"devotion": "In the days of Moses, twelve people — one from each tribe — were chosen to go into the land of Canaan. They were to spy the land and bring back a report to the people of God. We know that when the twelve returned, they presented two kinds of intelligence reports. One report said that they would never be able to inherit the land of Canaan because giants occupied the land, before which they were like grasshoppers. The other report said that they were well able to take the land at once. We know that it was this good, positive report of Caleb and Joshua that helped the new generation of Israel to enter into the land later on. When the people heard the report of Joshua and Caleb, they were ready to stone them. This reveals a significant fact. The enemy was not only out there in the land of Canaan, but there was an enemy entrenched in the hearts of God’s people as well. The Israelites had not only to overthrow their enemies in the land of Canaan, but there was a formidable enemy within the Israelite camp also. This enemy had a firm foothold in the hearts of the people of God. Unobtrusively, the enemy had made a way into their very hearts! How true that is to principle and to history!",
		"bible_reading": "Esther 8:1-10:3 \n 1 Corinthians 12:27-13:13 \n Psalm 37:1-11 \n Proverbs 21:23-24",
		"image_url": "Empty at the moment",
		"today_command": "Do not be afraid of what you are about to suffer. – Revelation 2:10"
	},
	{
		"devotion_id":20, 
		"devotion_title":"Title 0",
		"devotion": "“Ye offer polluted bread upon mine altar; and ye say, Wherein have we polluted thee? In that ye say, The table of the LORD is contemptible. And if ye offer the blind for sacrifice, is it not evil? and if ye offer the lame and sick, is it not evil? offer it now unto thy governor; will he be pleased with thee, or accept thy person? saith the LORD of hosts.” (Malachi 1:7-8).The Lord says, “You bring polluted sacrifices to me but you do not revere and fear me. Look at the way you behave in my house; look at your worship; look at your attitude; look at your mentality; look at your lifestyle; look how you behave yourself in My house.” And then He adds, “Go and do the same with your earthly boss, and see what he would do and say to you.” Truly, if we were to misbehave and deal with our earthly bosses as we do with the Lord, we would loose our jobs in the twinkling of an eye. The church would be flooded with prayer requests of those who would have lost their jobs! If we continue to behave in a similar manner towards our Lord, what do we expect the Lord to do? Saints, the question is not how much we worship or serve the Lord, but what is the quality of our worship and service unto the Lord. The Word in Malachi shows that there was no shortage of sacrifices (or meetings) or worship in the house of God in those days but quality was wanting.",
		"bible_reading": "Job 1:1-3:26 \n 1 Corinthians 14:1-17 \n Psalm 37:12-29 \n Proverbs 21:25-26",
		"image_url": "Empty at the moment",
		"today_command": "Take away the stone. – John 11:38"
	},
	{
		"devotion_id":21, 
		"devotion_title":"Title 0",
		"devotion": "“And now, Israel, what doth the LORD thy God require of thee, but to fear the LORD thy God, to walk in all his ways, and to love him, and to serve the LORD thy God with all thy heart and with all thy soul, To keep the commandments of the LORD, and his statutes, which I command thee this day for thy good?” (Deuteronomy 10:12-13). What did the law require of God’s people in days past? Only to fear the Lord, love Him, walk in His ways and serve Him! It is the same even today! To fear the Lord, our God, and to love Him, and to walk in His ways, and to serve the Lord our God with all our heart, with all our soul, and with all our being, is the consistent, inflexible and unfailing desire of God for each one of us. “Now therefore fear the LORD, and serve him in sincerity and in truth: and put away the gods which your fathers served on the other side of the flood, and in Egypt; and serve ye the LORD.” ( Joshua 24:14). Many believers do not understand that the love of God can never be separated from the reverential fear and respect of God. The fear of God and the love of God are two sides of the same coin. God will be pleased with our lives only if fear and love for Him are not separated from each another.",
		"bible_reading": "Job 4:1-7:21 \n 1 Corinthians 14:18-40 \n Psalm 37:30-40 \n Proverbs 21:27",
		"image_url": "Empty at the moment",
		"today_command": "Repent and do the things you did at first. – Revelation 2:5"
	},
	{
		"devotion_id":22, 
		"devotion_title":"Title 0",
		"devotion": "If we only fear God, and do not also love Him, we will be like slaves who stand in the terror and dread of their masters. God does not want man to be His slave. We know this because He made man in His own image and His likeness. He loves man and He wants man to know the love of God. At the same time, God wants man to fear Him in a reverential, godly way. To fear God does not mean that we become fearful of Him; the right fear of God will bring a desire to obey Him spontaneously. The incorrect kind of fear of God will bring us to obey God in a certain way, it will lead us to a certain kind of obedience, but not to the obedience of faith where love for God is the driving motive. Serving God with a heart that fears Him but does not also love Him, will result in dead works, without a life-fellowship with the Father, the Son and with one another. Abraham did not obey the Lord because he feared that some terrible evil would befall him unless he obeyed God. He obeyed the Lord because of an inherent and integral love for God. The obedience of faith leads us to love the Lord uncondionally. Abraham loved the Lord not because he feared the judgments of the Lord or the punishments that the Lord could mete out to Him, but because a love for the Lord was working in him.",
		"bible_reading": "Job 8:1-11:20 \n 1 Corinthians 15:1-28 \n Psalm 38:1-22 \n Proverbs 21:28-29",
		"image_url": "Empty at the moment",
		"today_command": "What you are about to do, do quickly – John 13:27"
	},
	{
		"devotion_id":23, 
		"devotion_title":"Title 0",
		"devotion": "The glory of Christ was because of certain incorruptible characteristics. One of them was His union with the Father. Jesus’ union with the Father, and His intimacy with the Holy Spirit of God, was something deep and real. His relationship with the Father was not superficial, theoretical, or judicial. It was something so real, so deep and so unshakeable. It could sustain Him in every trial, test and affliction. In spite of all the efforts of men, demons, the powers of hell, and the devil himself, to separate Jesus from the Father, Jesus kept a close and intimate fellowship with His Father. His union with the Father remained unshakeable. It was not anything superficial; it was something tried, tested and proven. Jesus was sensitive to the Father’s desires at all times. His union with the Father remained uninterrupted throughout His life. The Lord made it very clear that the union that existed between Him and the Father could also exist between the Father, Christ and us. We can experience the same organic oneness, reality and fellowship that He went through. This is the kind of relationship and fellowship we ought to have with the Father. Wherever we go and whatever we do, we need to remain in the place of union with God.",
		"bible_reading": "Job 12:1-15:35 \n 1 Corinthians 15:29-58 \n Psalm 39:1-13 \n Proverbs 21:30-31",
		"image_url": "Empty at the moment",
		"today_command": "Give, and it will be given to you. – Luke 6:38"
	},
	{
		"devotion_id":24, 
		"devotion_title":"Title 0",
		"devotion": "The history of man is the history of an effort to get glory without getting it from God! This seeking for glory is seen as something that started very early in the scripture and we see it going all the way through; but the glory of man always ended in corruption! We are living in a world where man is trying to obtain glory for himself. The pronouncement of God on the life of man that brings a glory of his own, is one of corruption. This corruption of man which seeks his own glory is a self-destroying thing. It will result in obliterating man from the face of this earth. On one hand, man is trying to invent devices to destroy other men, but on the other, man is clothing himself with a self-made glory, that will result in his own destruction. Men use self-proclaimed designations, grand titles and high-sounding words to glorify themselves. People elevate themselves with the honour that comes from others. Their glory lies in the honour that others give them because of their elaborate titles and terminology. Man honours himself for inventing things — inventions that will, one day, blot out the very human race! Is that something glorious? It seems that man cannot help himself because he is energised by another power and is no more his own master. He is ruled by another spirit. He calls it “glory”, but it is nothing but the blindness of man!",
		"bible_reading": "Job 16:1-19:29 \n 1 Corinthians 16:1-24 \n Psalm 40:1-10 \n Proverbs 22:1",
		"image_url": "Empty at the moment",
		"today_command": "Strengthen what remains and is about to die, for I have not found your deeds complete in the sight of my God. – Revelation 3:2"
	},
	{
		"devotion_id":25, 
		"devotion_title":"Title 0",
		"devotion": "“That world which our Savior once refused to buy at the price of disobedience to God is now wooing His professed followers with every sly, deceptive artifice. The glory which our Lord once rejected with cold scorn is now being admired and sought after by multitudes who make a loud profession of accepting the gospel. The old trick which our Lord saw through so easily is charming His present day followers into smiling acquiescence. The devil did not know Christ, but apparently he knows Christians. Satan’s effort to destroy Christianity on the doctrinal front has not been a success; there are probably more Bible believers now than at any time in world history. Still the true religion of the cross is in great and serious peril on another front and strangely enough, many of the very warriors who fought so valiantly when the veracity of the Bible was attacked have failed to recognize the enemy when he has approached from a new direction. The real peril today arises from within the fold of orthodox believers. It consists of an acceptance of the world’s values, a belief that the kingdoms of the world and the glory of them are valid prizes to be pursued by believing men and women. Blind leaders of blind souls are admitting that there is something to be said in favor of the world-glory after all; they insist that Christians should not cut themselves off from the pleasures of the world, except, of course, from those that are too degraded for respectable society.” -AWT",
		"bible_reading": "Job 20:1-22:30 \n 2 Corinthians 1:1-11 \n Psalm 40:11-17 \n Proverbs 22:2-4",
		"image_url": "Empty at the moment",
		"today_command": "Do not worry about what to say or how to say it. (when you are arrested) – Matthew 10:19"
	},
	{
		"devotion_id":26, 
		"devotion_title":"Title 0",
		"devotion": "The Lord is going to gather those believers whose hearts are really grieved because of the condition of God’s house in this hour. In the OldTestament, the last day of the Feast of Tabernacles was called the day of the solemn assembly. On that day the people put aside everything else, and gave themselves wholly to worship the Father. There is more light on the solemn assembly in Isaiah. “To what purpose is the multitude of your sacrifices unto me? saith the LORD: I am full of the burnt offerings of rams, and the fat of fed beasts; and I delight not in the blood of bullocks, or of lambs, or of he goats.When ye come to appear before me, who hath required this at your hand, to tread my courts? Bring no more vain oblations; incense is an abomination unto me; the new moons and sabbaths, the calling of assemblies, I cannot away with; it is iniquity, even the solemn meeting.” (Isaiah 1:11-13) Even on the last day of the feast when the people had separated themselves for focused worship, the Lord was not pleased. However in Zephaniah, the Lord says that He will gather those who are sorrowful for the solemn assembly. The solemn assembly talked about a people who were separated unto God. The feast was a time to meet with the Lord. This is true for the Church as well, for the Church is a solemn assembly. The Church is the gathering of separated people.",
		"bible_reading": "Job 23:1-27:23 \n 2 Corinthians 1:12-2:11 \n Psalm 41:1-13 \n Proverbs 22:5-6",
		"image_url": "Empty at the moment",
		"today_command": "Receive the Holy Spirit. – John 20:22"
	},
	{
		"devotion_id":27, 
		"devotion_title":"Title 0",
		"devotion": "We are living in a world where every man seems to have an opinion about everything under the sun, irrespective of whether they have any knowledge about the subject or not! In spiritual circles it is no different. The people of God seem to foster their own opinions about the things of God. We need to understand that in spiritual matters, there are different measures of satisfaction, dissimilar desires and differing aspects of fulfillment. In the midst of such a wide variety of attitudes and opinions, to perceive and know the mind of God, and to see what would satisfy His heart, is not easy. One would speak out and say, “This is of God.” Another would say, “This bears the mark of His testimony.” Yet another would say that this is not the highest, for there is something more.” And some would proclaim that though this would not satisfy a holy, righteous God, but He would be pleased with this or by that. This kind of opinionated approach is so real in the spiritual world. What should we do in the midst of such debate and confusion? It is not easy to differentiate the true things of God. That is why our inward eyes need to be opened. If our eyes fail to behold the right things, then it is only a matter of time when some areas of our lives will begin to fall apart and it could be in our individual lives or in our family life or in the family of God, which is the Church.",
		"bible_reading": "Job 28:1-30:31 \n 2 Corinthians 2:12-17 \n Psalm 42:1-11 \n Proverbs 22:7",
		"image_url": "Empty at the moment",
		"today_command": "Take my yoke upon you and learn from me, for I am gentle and humble in heart, and you will find rest for your souls.- Matthew 11:29"
	},
	{
		"devotion_id":28, 
		"devotion_title":"Title 0",
		"devotion": "David’s unfortunate, impulsive action in bringing the Ark back on a new cart (1 Chronicles 13), contrary to the instructions of the Lord, led to an unexpected crisis in Israel. He made a cart like the one he saw when he had escaped to the land of the Philistines some time ago. He saw this ‘new technology’ for the first time in the land of the Philistines and desired to use it to bring back the sacred Ark of the Covenant to Jerusalem. Beloved, is this not what some people are doing even today – bringing in new ideas and technologies to do the work of the Lord and bring growth in the ministry?David thought that using a new cart was a good and easy way to get the Testimony back from the Philistines. He did not realize that by doing this he would break one of God’s important principles. He did not realize that using his ‘own way’ of bringing back the ark of God’s testimony would breach God’s principles. In making a cart like that of the Philistine’s, David linked God’s sacred ark to the things of this world, thus opening the door to death. The result was that the whole movement was brought to a standstill! Despite the zeal, enthusiasm and mighty voices of songsters, God was not happy and did not commit Himself to it.",
		"bible_reading": "Job 31:1-33:33 \n 2 Corinthians 3:1-18 \n Psalm 43:1-5 \n Proverbs 22:8-9",
		"image_url": "Empty at the moment",
		"today_command": "Do not be afraid of them (those that persecute you) – Matthew 10:26"
	},
	{
		"devotion_id":29, 
		"devotion_title":"Title 0",
		"devotion": "Daniel purposed inwardly to ref rain from defiling or corrupting himself in the King’s palace. “But Daniel purposed in his heart that he would not defile himself with the portion of the king’s meat, nor with the wine which he drank: therefore he requested of the prince of the eunuchs that he might not defile himself. “ (Dan 1:8) It is interesting to look at the word ‘defile’ in greater detail. In the original the word defile means ‘freeing through repudiation’. For Daniel it was a matter of being free inwardly. In other words Daniel said, “If I compromise of standards, in any way, I will be robbed of my freedom”. This implies that any compromise of the standards that God has set for me would rob me of my freedom with God. What a tremendous commitment that was in Daniel’s life! It talks of an inward commitment to God and not of some wishy-washy, outward commitment made to impress others. Many of God’s people do not hesitate to show forth their commitment to God, His church, His work and His purpose when others are around but withdraw their commitments when they are on their own and nobody watches. Daniel was not like that. He purposed that he would not surrender the liberty he had with the living God.",
		"bible_reading": "Job 34:1-36:33 \n 2 Corinthians 4:1-12 \n Psalm 44:1-8 \n Proverbs 22:10-12",
		"image_url": "Empty at the moment",
		"today_command": "Trust also in me. – John 14:1"
	},
	{
		"devotion_id":30, 
		"devotion_title":"Title 0",
		"devotion": "Daniel was willing to bury all offers of partial acceptance to appease the king. He was prepared to give up his own life to remain pure and undefiled before his God. This is the way Daniel consecrated and sanctified himself unto the Lord. What they saw when they first arrived in Babylon must have shocked them beyond belief. The society in Babylon was hopelessly loose and immoral. The sensitive spiritual senses of the Hebrew children were assaulted, as it were. Therefore, they jointly made a commitment and told each other, “We dare not compromise. We dare not adopt the moral standards of Babylon. We will separate ourselves; we will be wholly disciplined in our walk of faith! Daniel’s decision to abstain from the king’s meat was not just a matter of eating and drinking. The Babylonian Empire at that time was at its peak of grandiose. Immorality reigned; they were full of pride, vanity and arrogance. In refusing to eat the tasty meal set before him, Daniel made a strong statement or stand against the whole nation that did not serve the living God. That was their resolve. They sanctified themselves to the Lord of Hosts. They did not go about preaching their life to others but they lived that sanctified, separated and holy life. It was strictly a matter between them and their God.",
		"bible_reading": "Job 37:1-39:30 \n 2 Corinthians 4:13-5:10 \n Psalm 44:9-26 \n Proverbs 22:13",
		"image_url": "Empty at the moment",
		"today_command": "Ask and it will be given to you; – Matthew 7:7"
	}
]