[
	{
		"devotion_id":0, 
		"devotion_title":"Title 0",
		"devotion": "Fellowship emanates from a relationship with one another through the working of the cross. As we walk in the light, there is an unwritten covenant that exists and shackles the consciences; there is a fusing that becomes deeper and deeper as believers grows together in the Lord. Many think that we are called to have friendship in the Body of Christ; but in the true Body, we know no man after the flesh.   Fellowship calls for a determination on our part to walk by His word in truth, in the narrow way and in the discipline of His calling. As we daily take decisions to walk in the reality of His light, there will be a strengthening of our ties and we shall truly be 'brethren' as the word of God says. Often there is no progression in our spiritual lives because our relationships in the Body of Christ are based on an outward and worldly type of friendship. Invariably, we find that those who do not have a fellowship based on the pattern of God's word soon part. Ultimately, a wrong way of fellowship leads to separation and dismemberment from the Body. Another aspect of fellowship is one's ability to receive corrections from another brother without in any way feeling offended in the spirit. It calls for humility and a determination to die to the flesh, to maintain the bonds of fellowship.",
		"bible_reading": "Daniel 8:1-27\n 1 John 2:1-17\n  Psalm 120:1-7\n Proverbs 28:25-26",
		"image_url": "Empty at the moment",
		"today_command": "Speak not evil one of another.  James 4:11"
	},
	{
		"devotion_id":1, 
		"devotion_title":"Title 1",
		"devotion": "Now therefore, I pray thee, if I have found grace in thy sight, shew me now thy way, that I may know thee, that I may find grace in thy sight: and consider that this nation is thy people.  And he said, My Presence shall go with thee, and I will give thee rest.   And he said unto him, If thy Presence go not with me, carry us not up hence. For wherein shall it be known here that I and thy people have found grace in thy sight? is it not in that thou goest with us? so shall we be separated, I and thy people, from all the people that are upon the face of the earth.”(Exodus 33:13-16) The children of Israel had become content and satisfied with the blessings that they received from the hand of the Lord.  They did not want anything more.  They were not prepared to exert themselves for the things of the Lord.  However, Moses was a different kind of a person.  Only one thing would satisfy his strong hunger for the Lord – to experience the very Presence of the Lord. Today many believers seek for ‘presents’ from the Lord, rather than the ‘Presence’ of the Lord.  While the children of Israel were satisfied with His ‘presents’ Moses was only satisfied with His Presence.  What is your desire?  Do you desire His presents or His Presence?",
		"bible_reading": "Daniel 9:1-11:1\n  1John 2:18-3:6\n  Psalm 121:1-8\n  Proverbs 28:27-28",
		"image_url": "Empty at the moment",
		"today_command": "But he that glorieth, let him glory in the Lord.  2 Corinthians 10:17 "
	}, 	
	{
		"devotion_id":2, 
		"devotion_title":"Title 2",
		"devotion": "The Lord warned Moses that no man could see Him and live.  Even in the New Covenant, this statement stands as the truth.  Only a dead man can see the face of God.  There is a close connection between His glory and our death.  In the past, we had received some light concerning the manifestation of His glory, the reality of the glorious Church, and the Glory of God that shall fill His temple etc.  However, now the Lord is showing us that we need to be further prepared in our inner man to experience and practically realize the glory of God in our lives.  God is preparing His people for His glory in these days.   The Spirit wants us to set our face towards God, as Moses did.  God would say even to His remnant in these days, “Let your face be set to see My glory.  But always remember that only the dead shall see My face”.   God had chosen Moses to, not only receive the architectural details of the pre-Calvary model of salvation, but also to receive some knowledge of the ultimate restoration of His Presence to humanity.  Moses had received many details concerning the Tabernacle, the priesthood and several other spiritual things from the Lord, but Moses wanted to press forward towards the throne or the dwelling place of God. He was not content with the understanding of these things!  His cry before God was to behold the glory of God, to the exclusion of everything else.",
		"bible_reading": "Daniel 11:2-35\n  1 John 3:7-24\n  Psalm 122:1-9\n  Proverbs 29:1",
		"image_url": "Empty at the moment",
		"today_command": "Therefore ye must needs be subject, not only for wrath, but also for conscience sake.  Romans 13:5"
	},
	{
		"devotion_id":3, 
		"devotion_title":"Title 0",
		"devotion": "Establishing and strengthening the souls and the hearts of the disciples, urging and warning and encouraging them to stand firm in the faith, and [telling them] that it is through many hardships and tribulations we must enter the kingdom of God. ( Acts 14:22-23 AMP).  At every place that the apostles halted, they shared with others the great necessity of going through much tribulation so that they could enter into the kingdom of God.  It is only through hardship and tribulation that we must enter the kingdom of God.  It is remarkable that not a single member from the churches they visited ever asked them, “Is it not enough to have already suffered so much for His name?”  The apostles knew the extent of the difficulties that they had gone through, but they did not sympathize with them.  They did not say, “Beloved brethren, you have already suffered more than your share of suffering and now you need to take it easy.”  On the contrary, they urged them, warned them, and encouraged them to stand firm in the faith.  They emphasized that it would only be through hardships that they would be able to enter into the full measure of the kingdom of God.  In other words they said, “Beloved brethren, there are many more hardships that you must yet suffer. There are tribulations that are yet to come upon all of you and it is in going through these trials and afflictions that the kingdom of God will become a reality to you.",
		"bible_reading": "Daniel 11:36-12:13\n 1 John 4:1-21 \n Psalm 123:1-4 \n Proverbs 29:2-4 ",
		"image_url": "Empty at the moment",
		"today_command": " Thou shalt love thy neighbor as thyself. There is none other commandment greater than these. Mark 12:31 "
	},
	{
		"devotion_id":4, 
		"devotion_title":"Title 1",
		"devotion": "During our meetings, while mothers are carefully listening to the sermons, their hungry babies often cry out loudly for milk.  The babies could not care less who is preaching!  Do you think that baby would stop to think, “Oh, that is the pastor speaking, so I better be quiet!”  If that baby is hungry, things are going to get noisy.  All that the baby is interested in is to satisfy its desire for food.  Hungry babies make an open display of their hunger and refuse to stop crying.  The babies do not think of the need to be quiet in the worship hall.  When babies get hungry, they will cry.  There will be a lot of noise until the babies get what they want.  They are not bothered who watches them.  They do not care who hears them.  They do not care who sits next to their mother.  They proclaim their hunger with loud cries.  They put their hunger on display, wherever they are.  The baby says, “I do not care.  I will continue to cry as long as my hunger is not satisfied.”  The babies do not care for our spiritual condition, our clothing, our religious belief, or our fervour.  These things make no difference to the hungry ones.  All that the baby knows is, “If I do not get some immediate nourishment or help, I shall die.”God’s people need to display a strong cry in this hour for God’s Presence.",
		"bible_reading": "Hosea 1:1-3:5 \n 1 John 5:1-21 \n Psalm 124:1-8 \n Proverbs 29:5-8  ",
		"image_url": "Empty at the moment",
		"today_command": "Today's command 1"
	}, 	
	{
		"devotion_id":5, 
		"devotion_title":"Title 2",
		"devotion": "“And I will give power unto my two witnesses, and they shall prophesy a thousand two hundred and threescore days, clothed in sackcloth.  These are the two olive trees, and the two candlesticks standing before the God of the earth” . (Revelation 11:3,4).  The two witnesses here represent the corporate people of God, who like John the Baptist and Ezekiel have eaten the scroll (word of God) in their lives. The number two stands for 'more than one'. Number two signifies that there can be agreement and testimony. God's revelation is two-fold (the old and the new covenants), God's testimony of the truth to man. Two is often connected with faithful testimony. Caleb and Joshua were two faithful witnesses of God's truth (Numbers 13:30-31). Two out of six lakh possessed their inheritance. May this encourage us to stand firm in these days of backsliding and apostasy, with ears closed to the words of man but attentive to the words of God. “Let God be true but everyman a liar“ (Romans 3:4).  The word of God tells us that there were two olive trees and two candlesticks standing before God. Figuratively they represent God's purposes upon earth. The two witnesses, without a doubt represent the godly minority of overcomers. Their ministry is to provide power to the entire Church. ",
		"bible_reading": " Hosea 4:1-5:15 \n 2 John 1:1-13 \n Psalm 125:1-5 \n Proverbs 29:9-11 ",
		"image_url": "Empty at the moment",
		"today_command": "Let every one of you lay by him in store, as God hath prospered him, 1 Corinthians 16:2 "
	},
	{
		"devotion_id":6, 
		"devotion_title":"Title 1",
		"devotion": "It is a matter of great celebration that when the Lord commands us to do something, He doesn't tell us to do it by our own strength!! Often the task ahead seems impossible and hopeless, but He knows how to perform it. “For strength shall no man prevail“ (I Samuel 2:9) “but the way of the Lord is strength “(Proverbs 10:29). The task of measuring the temple that of purifying and cleansing the church, seems a tall order!! How can the remnant believers ever accomplish such a task? How can the body-minority think of purging the entire church system? Praise God, they do not even have to try; for God will raise up a people, furnish the power and generate that which He intends. They will increasingly be aware of God's purposes and intentions and they will move in total harmony even as the Lord Jesus Christ moved in total harmony, with the Father while He was upon this earth. while it seems impossible to cleanse the Church of all the abominations that are occurring within, yet the Almighty has put a measuring rod in the hand of a people who are His faithful witnesses!! He shall provide them God-given Holy Spirit power to do that which appears impossible. The two witnesses shall perpetually pour oil into the candlesticks (Zech 4)!  They are a corporate people having power and anointing from on high.",
		"bible_reading": " Hosea 6:1-9:17 \n 3 John 1:1-14 \n Psalm 126:1-6 \n Proverbs 29:12-14  ",
		"image_url": "Empty at the moment",
		"today_command": "Be not carried about with divers and strange doctrines. For [it is] a good thing that the heart be established with grace. Hebrews 13:9"
	}, 	
	{
		"devotion_id":7, 
		"devotion_title":"Title 2",
		"devotion": "In the book of First Samuel, we read about the woman Hannah, in the house of the Lord, who prayed and sought His Presence with a heavenly weeping.  However, the priesthood of that time did not understand the kind of prayer she was making.  The religious order of the day, failed to understand what this woman was doing in the house of the Lord.  She was misunderstood and wrongly judged by them.   “And it came to pass, as she continued praying before the LORD, that Eli marked her mouth. Now Hannah, she spake in her heart; only her lips moved, but her voice was not heard: therefore Eli thought she had been drunken.   And Eli said unto her, How long wilt thou be drunken? put away thy wine from thee. And Hannah answered and said, No, my lord, I am a woman of a sorrowful spirit: I have drunk neither wine nor strong drink, but have poured out my soul before the LORD.” (1 Sam 1:12-15).  God is drawing His people to a place where they come to Him, pouring out their souls to Him in brokenness before the Lord.   We can draw strength from the lives of men of God who stood before the Lord, day after day, with wet eyes and broken spirits.  We need not know the doctrines they followed, but we ought to see the manner in which they prepared themselves to meet God.  Some of them stood in the puddle of their own tears, before the Lord seeking His Presence, and waiting for His response. ",
		"bible_reading": "Hosea 10:1-14:9 \n Jude 1:1-25 \n Psalm 127:1-5 \n Proverbs 29:15-17 ",
		"image_url": "Empty at the moment",
		"today_command": " Be thou an example of the believers, in word, in conversation, in charity, in spirit, in faith, in purity. 1Timothy 4:12"
	},
	{
		"devotion_id":8, 
		"devotion_title":"Title 0",
		"devotion": "Through the minor tests and trials that we undergo from time to time, we are trained and prepared to undertake greater suffering and tribulation that will come our way.  The little trials we face in office, in social circles, and in our homes for His name’s sake groom us for what lies ahead.  The difficulties we experience amongst our dear ones, relatives and acquaintances are nothing but a preparation for things that lie ahead.   David had to be faithful when the sheep were committed to him for his care.  He had to be faithful in every trial that he came across and experienced.  He was faithful unto death when, first a bear and then a lion attacked the sheep that his father had entrusted to his care as a shepherd boy.  It was while he tended and grazed the sheep daily in the pastures that God prepared David for his battle against the giant Goliath.   We are not to crib and cry when trying situations come our way.  Do not lose hope.  Though we may feel that the trials we face are beyond our capacity to bear, we need to trust the Lord and turn to Him in faith.  Remember, we must enter the things of God with many hardships and tribulations.  Just hold on to the Word and be open.  God is never unjust; He is ever faithful.  Do not believe the whispers of the devil who is an inveterate, incurable, and chronic liar.  Even when he speaks the ‘truth’, there is an inherent lie right there!",
		"bible_reading": "Joel 1:1-3:21 \n Revelation 1:1-20\n Psalm 128:1-6\n Proverbs 29:18  ",
		"image_url": "Empty at the moment",
		"today_command": " And of some have compassion... And others save with fear, pulling [them] out of the fire; hating even the garment spotted by the flesh. Jude 1:22,23 "
	},
	{
		"devotion_id":9, 
		"devotion_title":"Title 1",
		"devotion": "Bethany means ‘the house of figs’. We need to know that the Lord Jesus Christ, the coming King, shall return to the spiritual Bethany (the Church), to His own people “who look steadfastly toward heaven.” He shall return to those whom He has redeemed by His blood and to those who look unto Him for full salvation.   The fig tree, unlike many other trees, has fruit that is green in color and of the same tone as its own leaves. At the time of ripening the fruit is concealed among leaves. When Jesus went to Bethany with His disciples, He saw a fig tree afar off and desired to eat its fruit, being hungry. However, when He came near He found no fruit upon the fig tree; and He cursed it (Matthew 21:19-21; Mark 11:12-14). From a distance the leaves showed forth the promise of fruit, but on drawing near there was none. As such the tree was a hypocrite. Such a one our Savior cursed. O how the Lord detests a hypocritical believer!! (outward show of good character without real fruit). The fig tree seemed to have fruit; but in reality it was barren. There is inherent in this incident a warning to such believers who pretend to know the Lord but are in reality false teachers. Their roots shall dry up; the Lord shall depart from their lives (Mark 11:20). ",
		"bible_reading": "Amos 1:1-3:15 \n Revelation 2:1-17 \n Psalm 129:1-8\n Proverbs 29:19-20 ",
		"image_url": "Empty at the moment",
		"today_command": "Study to show thyself approved unto God, 2 Timothy 2:15"
	}, 	
	{
		"devotion_id":10, 
		"devotion_title":"Title 2",
		"devotion": "In Matthew 24:32-34, the Lord speaks a parable concerning the times and seasons by giving the example of the fig tree. By looking at the Body of Christ (the true Church) and seeing their lives it will be possible to tell whether the “summer is nigh”, that is, whether the Day of Christ is at hand. It is the body of believers who will be the Lord’s ‘litmus paper’ indicating whether the solution is acid or alkaline, i.e. whether the day of the Lord has truly come. It is best not to confuse the hope of His coming with an approach which is too scholarly and theoretical as to what is going to occur when He comes. But rather let us take the advice of our Lord and just look at the condition of the Church. “Be patient therefore, brethren unto the coming of the Lord. Behold, the husbandman waiteth for the precious fruit of the earth, and hath long patience for it, until he receive the early and latter rain...”(James 5:7).   In another parable Jesus spoke to natural Israel about the consequences of not bearing fruit (Matthew 21:33-43); the kingdom of God shall belong to those who bring forth fruit-the true body of Christ (Matthew 21:43). The Husbandman is waiting for the precious fruit of our lives to come forth. He shall certainly come back to His vineyard, to His own, to those who are abiding in the Vine.",
		"bible_reading": "Amos 4:1-6:14 \n Revelation 2:18-3:6 \n Psalm 130:1-8 \n Proverbs 29:21-22  ",
		"image_url": "Empty at the moment",
		"today_command": "The night is far spent, the day is at hand: let us therefore cast off the works of darkness,  Romans 13:12 "
	},
	{
		"devotion_id":11, 
		"devotion_title":"Title 0",
		"devotion": "“And he said unto them, Ye are they which justify yourselves before men; but God knoweth your hearts: for that which is highly esteemed among men is abomination in the sight of God.”  (Luke 16:15 ).   It must be acknowledged that there is a great lust in man for his own glory.  It is common practise for men to have titles, credits and appendages, so that others may look upon them with approval and admiration.  Such things have crept into the Church as well.  Priest and laymen alike, use exalted titles and signs to signify their achievements and appointments.  They make every effort to appease and please the heart of man.  Satan once tried to bring about the downfall of Christ by offering Him all the kingdoms of the world and the glory of them. Here is sufficient proof that the devil is wise but not wise enough. He knew fallen human nature and just how to handle it.  He knew the power of pomp and circumstances to charm the sinful heart and bring it into captivity.  In presenting to the Man Jesus the glory of the world he was shrewdly taking advantage of a known weakness in the human race.  The trick should have worked, and it would have worked but for one thing: This was no fallen man Satan was attempting to seduce; it was a sinless Man full of the Holy Ghost and wisdom, whose penetrating glance pierced the world’s attractive exterior and saw what was inside.  What He saw revolted Him.  He would have no part of it.",
		"bible_reading": "Amos 7:1-9:15 \n Revelation 3:7-22 \n Psalm 131:1-3 \n Proverbs 29:23 ",
		"image_url": "Empty at the moment",
		"today_command": "Jesus saith unto him, If I will that he tarry till I come, what is that to thee? follow thou me.  John 21:22"
	},
	{
		"devotion_id":12, 
		"devotion_title":"Title 1",
		"devotion": "“The kingdom of God cometh not with observation:  Neither shall they say, Lo here! or, lo there! for, behold, the kingdom of God is within you.” (Luke 17:21).   While addressing the Pharisees, Jesus said, “Behold, the Kingdom of God is within you.”  We have to note here that He did not mean that the Kingdom of God is within the Pharisees who heard Him speak. One Pharisee called Nicodemus, who came to Him secretly at night, clearly did not possess the kingdom of God!  This is clear from John 3:5 in the Amplified Bible wherein Jesus tells Nicodemus, “. .  I assure you, most solemnly I tell you, that unless a person be born again (anew from above) he cannot ever see (know, be acquainted with, and experience) the kingdom of God.”  Jesus did not tell Nicodemus, who was a Pharisee that the Kingdom of God is within him!  He told him that he had to be born from above to see the Kingdom of God!  The Lord told those demanding Pharisees, those hostile Pharisees, those ever-watching-to-accuse-Him-Pharisees, that they were not to look for the kingdom of God in outward displays or in supernatural manifestations.  No.  The Kingdom of God is not localized nor is it an earthly display.  The Kingdom of God is more than just observation of a law; it is something within.  It is not the observation of this thing and that thing.",
		"bible_reading": "Obadiah 1:1-21 \n Revelation 4:1-11 \n Psalm 132:1-18 \n Proverbs 29:24-25  ",
		"image_url": "Empty at the moment",
		"today_command": "If any [man] come to me, and hate not his father, and mother, and wife, and children, and brethren, and sisters, yea, and his own life also, he cannot be my disciple. Luke 14:26"
	}, 	
	{
		"devotion_id":13, 
		"devotion_title":"Title 2",
		"devotion": "In the Tabernacle of Moses, as the smell of the sacrifices rose up and filled the nostrils of God, His Presence descended amongst His people.  It was as if the sacrifice was a signal that God could draw near!  He drew near to His people, without striking them down, when He got the smell of death that arose from the sacrifice.  This is true for us as well.  God’s Presence is manifested in our lives when the aroma of the death of our flesh rises up unto Him.  If God were to descend in our midst and find that there is no sweet aroma of death or sacrifice, we would all be struck down by His awesome Presence.  That is why it is so essential to come to Him with sacrifices of our own lives as a living sacrifice upon the altar.  God will not come if He does not see a sacrifice on the altar! God’s end goal has always been reunion and intimate communion with mankind.   However, God cannot come close to living flesh; God will destroy it.  He waits to receive the smell of burnt, dead flesh.  The Lord looks for that smell of dead flesh and of burning hair so that He could come close to His people.  The more death God smell in our lives, the closer He will come to us. Positive confessions, confessing the word of God, saying ‘I am crucified with Christ’, or saying ‘it is no longer I but Christ who lives within’, will not help us in our spiritual walk with Christ.  There is something more we need in our lives.",
		"bible_reading": "Jonah 1:1-4-11 \n Revelation 5:1-14 \n Psalm 133:1-3 \n Proverbs 29:26-27 ",
		"image_url": "Empty at the moment",
		"today_command": "    Go! It will be done just as you believed it would. (To the centurion because of his faith)- Matthew 8:13"
	},
	{
		"devotion_id":14, 
		"devotion_title":"Title 0",
		"devotion": "One cannot dance around the burning bush!  God is a consuming fire.  He is a God of glory.  His desire for His people is that they may come to His glory and live in the glory that He has.  The Old Testament says that the dead shall see the glory of the Lord.  The New Testament equivalent of this truth lies in repentance, brokenness, and humility before the Lord.  Often we agree to this mentally and accept it, but we seldom remain in a condition of death to the self.  If the Lord says that only a dead man can see His face, then the one who sees His face cannot live.  If you desire to see God’s glory, He will show it to you but then you will not be able to live any longer.  If God were to show His glory to us in full measure we would all be dead!   We need to realize that there is truth in what God says.  His glory is not an ordinary matter.  The Scripture says, “the mountains melt down before the Lord…” (Judges 5:5).  Again prophet Nahum says, “The mountains quake at him and the hills melt and the earth is burned at his Presence…”.  If this is so, how much more must man’s flesh experience a death when face to face with His glory.  Beloved, we may have known something of His glory, but a greater glory remains hidden to us.  We ought to be able to see His full glory, if we yield ourselves to His workings and experience a death.",
		"bible_reading": "Micah 1:1-4:13 \n Revelation 6:1-17 \n Psalm 134:1-3 \n Proverbs 30:1-4  ",
		"image_url": "Empty at the moment",
		"today_command": " But ye, brethren, be not weary in well doing. 2 Thessalonians 3:13 "
	},
	{
		"devotion_id":15, 
		"devotion_title":"Title 1",
		"devotion": " “For the LORD spake thus to me with a strong hand, and instructed me that I should not walk in the way of this people, saying, Say ye not, A confederacy, to all them to whom this people shall say, A confederacy; neither fear ye their fear, nor be afraid. Sanctify the LORD of hosts himself; and let him be your fear, and let him be your dread.” (Is 8:11-13).  The Lord is specifically calling His church to a place of separation and sanctification in this hour. That is something that the Lord has laid upon my heart for His church, which goes in line with verse 11 of Isaiah 8.  One translation mentions that the Lord said in the strongest terms not to go along with the plans of Judah to surrender (to worldly influences), under any circumstances.  Today, there are many believers who are surrendering themselves to the things around them, but we have to move and stay away from any kind of surrender.   The Lord would like His people to sanctify Him, the Lord of Hosts; their fear is to be for Him and not for any other (verse 13).  To sanctify the Lord of Hosts, Himself, talks of coming into a deeper separation unto Him.  The Lord wants His people, His church, His remnant, to be fully separated unto the Lord in and through their lives.  The Holy Spirit has shown us, from the example of the separation of Levites, that the Lord had always depended upon the Levites for the forward movement of God’s people.",
		"bible_reading": "Micah 5:1-7:20 \n Revelation 7:1-17 \n Psalm 135:1-21 \n Proverbs 30:5-6 ",
		"image_url": "Empty at the moment",
		"today_command": " Not slothful in business; fervent in spirit; serving the Lord; Romans 12:11 "
	}, 	
	{
		"devotion_id":16, 
		"devotion_title":"Title 2",
		"devotion": "“Behold, I will send my messenger, and he shall prepare the way before me: and the Lord, whom ye seek, shall suddenly come to his temple, even the messenger of the covenant, whom ye delight in: behold, he shall come, saith the LORD of hosts.”               (Mal 3:1).   The New Testament clearly shows that the purpose of John’s ministry was to prepare a people for the Lord.  The prophecies of Malachi are echoed in the Gospels that tell of Elijah who would go before and prepare a people, securing a people for the Lord, so that God could move on to fulfill His purpose.  The Lord Jesus spoke of the fulfillment of the prophecy of Malachi saying, “And if ye will receive it, this is Elias, which was to come” (Mat 11:14).  John the Baptist lived before the face of the Lord, preparing a way for the Lord and for the preparation of a people for the Lord.  He secured a people prepared for the Lord. The ground on which the Lord will work seems to be the ground of a separated people who are sanctified for the Lord.   Seeing this principle, we need to give ourselves for God to have a separated people, a sanctified people, a people prepared of the Lord, for God’s purpose to be fulfilled in this generation.  The Lord Jesus came into a prepared place at that point of time in the Father’s will, so that the Father could fulfill His purpose.",
		"bible_reading": "Nahum 1:1-3:19 \n Revelation 8:1-13 \n Psalm 136:1-26 \n Proverbs 30:7-9  ",
		"image_url": "Empty at the moment",
		"today_command": "Look to yourselves, that we lose not those things which we have wrought, but that we receive a full reward. 2John 1:8"
	},
	{
		"devotion_id":17, 
		"devotion_title":"Title 0",
		"devotion": "God does not conduct His work, solely, with men of education or of wealth or of business capacity. Neither can He carry on His work through men of large intellects or of great culture, nor yet through men of great social eminence and influence. All these can be made to count provided they are not regarded as being primary. These men, by the simple fact of these qualities and conditions, cannot lead in God's work nor control His cause. Men of prayer, before anything else, are indispensable to the furtherance of the kingdom of God on earth. No other sort will fit in the scheme or do the deed. Men, great and influential in other things, but small in prayer, cannot do the work Almighty God has set out for His Church to do in this, His world.   Men who represent God and who stand here in His stead, men who are to build up His kingdom in this world, must be in an eminent sense men of prayer. whatever else they may have, whatever else they may lack, they must be men of prayer. Having everything else and lacking prayer, they must fall. Having prayer and lacking all else, they can succeed. Prayer must be the most conspicuous and the most potent factor in the character and conduct of men who undertake divine commission. God's business requires men who are versed in the business of praying.",
		"bible_reading": "Habakkuk 1:1-3:19 \n Revelation 9:1-21 \n Psalm 137:1-9 \n Proverbs 30:10 ",
		"image_url": "Empty at the moment",
		"today_command": "But be ye doers of the word, and not hearers only, deceiving your own selves. ames 1:22 "
	},
	{
		"devotion_id":18, 
		"devotion_title":"Title 1",
		"devotion": "While Moses was on the Mount with the Lord, we know what a shameful thing the Lord’s people did!  The gold was for the sanctuary in which the Lord was to dwell; it was for the Lord alone.  However, they used that very thing that was for the Lord, and made a golden calf and began to worship it.  On the day that they made the golden calf, all the evil powers broke into their midst.  Why did the evil powers make a golden calf?  Their evil intention was that God should not have His people’s worship, and that the very gold that was intended for God’s sanctuary would be used for their own evil purpose.  Thus, the evil powers sought to use the same gold as the basis and instrument for the worship of God’s people to Satan!  This is what the enemy did at that time.  Is this not happening today as well?  The things that God gives us is not for ourselves, but it is unto Him; it is for His purpose.  Whatever God may have given you—health, material, a good voice, some ability—they must be brought into His service, into His sanctuary.  They are for His purpose.  But notice how diabolically the powers of hell and darkness break into the psyche of the natural man!  The natural man easily gives in to the enemy’s suggestions and that which is meant for the Lord is utilized by the enemy for his own purpose!  The enemy has broken into the midst of God’s people time and time again! ",
		"bible_reading": "Zephaniah 1:1-3:20 \n Revelation 10:1-11 \n Psalm 138:1-8 \n Proverbs 30:11-14  ",
		"image_url": "Empty at the moment",
		"today_command": "Do to others what you would have them do to you, for this sums up the Law and the Prophets – Matthew 7:12 "
	}, 	
	{
		"devotion_id":19, 
		"devotion_title":"Title 2",
		"devotion": "Concerning the practices of the high priests, a  writers says, that the high priest never slept the night before he had to enter the most holy place.  The children of Israel had to keep the high priest awake all night, to prevent the high priest from dreaming while asleep!  They were afraid that the High Priest would defile himself, if he dreamt.  All night long, the Levites sat with the high priest and kept him awake by reading the Law of Moses to him.    After the high priest had made all preparations to enter the Tabernacle, according to the Mosaic Law, he would sorrowfully tell his family, “I do not know whether I will return after I have entered the most holy place, where I am going to seek the face of God on behalf of all Israel.  According to the Law and the commandments of God, no one can see His face and live.  I will enter the most holy place with the blood of the sacrifice and sprinkle it upon the mercy seat.  I fear that if there be any iniquity amongst God’s people, I will die. God will smite me down and I will not return alive.  But if I die, I die for I am going to see the King!”  Finally, before entering the most holy place of the Tabernacle, the high priest would have to tie a rope around his ankles, so that if he died there, other priests would be able to pull him out, without their having to enter the sacred place.",
		"bible_reading": "Haggai 1:1-2:23 \n Revelation 11:1-19 \n Psalm 139:1-24 \n Proverbs 30:15-16 ",
		"image_url": "Empty at the moment",
		"today_command": "Keep this commandment without spot, unrebukeable, until the appearing of our Lord Jesus Christ: 1 Timothy 6:14 "
	},
	{
		"devotion_id":20, 
		"devotion_title":"Title 0",
		"devotion": "“Behold, we will pass over unto these men, and we will discover ourselves unto them.  If they say thus unto us, Tarry until we come to you; then we will stand still in our place, and will not go up unto them.  But if they say thus, Come up unto us; then we will go up: for the LORD hath delivered them into our hand: and this shall be a sign unto us.”  (1 Samuel 14:8-10).  If we were in Jonathan’s place we would have said, “If they come down to us, then it would be a sign unto us.”  Our thoughts would be, “If God is with me then my way will be made easy.  Climbing up to the enemy is difficult; it is more dangerous; it would be disadvantageous to climb up to the enemy rather than to bear down upon the enemy from above.  I will know that God is with me if the way is made easy.”  But Jonathan’s heart in this matter was very different for he thought that as climbing up involved suffering, danger and uncertainty, he would only know that God had delivered the enemy into his hands if he suffered as he climbed.  A normal person would think that the absence of suffering would reveal the hand of God, but Jonathan realized that he must be prepared to suffer to do God’s will.  That would bring him certain victory.   Here in this account of Jonathan we find that the attitude of a true overcomer is to have a faith that is willing to stretch itself. ",
		"bible_reading": "Zechariah 1:1-21 \n Revelation 12:1-17 \n Psalm 140:1-13 \n Proverbs 30:17  ",
		"image_url": "Empty at the moment",
		"today_command": " Let all things be done unto edifying. 1 Corinthians 14:26 "
	},
	{
		"devotion_id":21, 
		"devotion_title":"Title 1",
		"devotion": "“And there was an enlarging, and a winding about still upward to the side chambers: for the winding about of the house went still upward round about the house: therefore the breadth of the house was still upward, and so increased from the lowest chamber to the highest by the midst.” (Ezekiel 41:7).  In describing the temple that he saw in a vision, Ezekiel the prophet says that “ the side chambers were three one over another” (41:6) and there was “winding still upward”, a phrase he uses three times in verse 7. Solomon’s Temple had winding stairs going upwards. “The door for the middle chamber was in the right side of the house; and they went up with winding stairs into the middle chamber, and out of the middle into the third”(1 Kings 6:8). Ezekiel’s temple (of his vision), however, had stairs winding upward again and again still upwards. As we have seen earlier, his temple represents the temple of our day, which is not built by human hands, in which there are higher spiritual realms still upward and yet higher up. God desires to reveal the truth concerning higher spiritual realms to His Body, which is the Church.  Beloved, there are realms which we as a body have never ascended into. God is calling His people to meet with Him in higher realms.",
		"bible_reading": "Zechariah 2:1-3:10 \n Revelation 13:1-18 \n Psalm 141:1-10 \n Proverbs 30:18-20 ",
		"image_url": "Empty at the moment",
		"today_command": "Be merciful, just as your Father is merciful – Luke 6:36"
	}, 	
	{
		"devotion_id":22, 
		"devotion_title":"Title 2",
		"devotion": " In our lives we are called to be sojourners and not squatters; to be pilgrims and not lodgers. We are called to be a people of the promised land of Canaan and to be strangers and sojourners upon this earth, as was Abraham, looking unto a heavenly city for our citizenship (Hebrews 11:8-10). We are not to stop half way and build something in our own strength, but we are to continually move on in God, keeping our eyes upon the Lord Jesus Christ. His glorious church is called to be a glorious bride who will stand with the glorious Bridegroom before the Father, not in some wretched, tattered clothes but in garments woven of ‘fine linen’ which is the righteousness of Christ Jesus. At no stage of our pilgrimage can we proclaim that we have ‘arrived’, or that we have ‘attained’ any proficiency. Whether we be pastors, preachers or prophets, the Word of God says that we are ‘to press forward’, because we have still not achieved our spiritual goal. Beloved, let us, therefore move on, together with the saints of God, toward the goal set before us. leaving behind all the old things, past relationships, experience, ideas, habits and behaviour. Let us continually march forward with the Lord in the lead; and the Holy Spirit of God will show and teach us of the things we need to leave behind in these days.   Let us reach out to the things that lie ahead of us.",		
		"bible_reading": "Zechariah 4:1-5:11 \n Revelation 14:1-20 \n Psalm 142:1-7 \n Proverbs 30:21-23  ",
		"image_url": "Empty at the moment",
		"today_command": " Do not give dogs what is sacred; do not throw your pearls to pigs. – Matthew 7:6"
	},
	{
		"devotion_id":23, 
		"devotion_title":"Title 0",
		"devotion": "Genesis 2:24 and Ephesians 5:31 emphasize that a man must leave his father and mother and cleave to his wife. This is also what the Lord Jesus says in Mark 13:7. In Ephesians 5:31 the word used is ‘joined’ (instead of ‘cleaving’). The original Greek word is PROSKOLLAO which means to glue, to join firmly or to be cemented together. It is interesting to note what the apostle Paul says in the very next verse— “This is a great mystery but I speak concerning Christ and the church.” (Ephesians 5:32).  Apostle Paul dramatically links the leaving of father and mother and the joining unto the wife with Christ and the Church. What does he mean? We know that Genesis 2:24 and Ephesians 5:31 are often quoted at Christian marriages to show what married life is. So Paul, in effect, says that a believer’s life with the Lord Jesus has to be like that between a husband and a wife. As believers we too are to leave, our fathers, household and cleave or be joined wholly to the Lord Jesus, so also the church.  But Paul says this is a great mystery. It was difficult to explain how Christ and the Church were really of one flesh. The Lord and His Church are one entity. How this is so cannot be explained in words but one has to understand in the spirit. The principles of leaving and cleaving or joining are to be applied to our church life even as they are applied to our married life.",
		"bible_reading": "Zechariah 6:1-7:14 \n Revelation 15:1-8 \n Psalm 143:1-12 \n Proverbs 30:24-28  ",
		"image_url": "Empty at the moment",
		"today_command": "And said unto them that sold doves, Take these things hence; make not my Father's house a house of merchandise. John 2:16 "
	},
	{
		"devotion_id":24, 
		"devotion_title":"Title 1",
		"devotion": "In the days of old, when God’s people had broken loose, everything that was related to the onward move of God from Egypt to the land of Promise came to a standstill.  It was a time of crisis in the plan and purpose of God.  And at such a time God gave a word to Moses to proclaim, “Who is on the Lord’s side.”  And we know, only the Levites responded positively to the Lord’s call at that time of crisis.  “For Moses had said, Consecrate yourselves to day to the LORD, even every man upon his son, and upon his brother; that he may bestow upon you a blessing this day.” (Ex 32:29).  During the time of crisis in Israel, the Levites were the only ones who responded to God.  And therefore, the doors to the onward move of God were only opened through the Levites.  The prospect of an onward journey opened up only when the Levites consecrated themselves unto the Lord.   There can be no forward move until there is a sanctification and a separation unto the Lord.  Everything was held in suspense until the Levites came forward to take up the issue that caused their enemies to deride and ridicule them.  They took responsibility to answer that challenge to deal with that issue and get it out of the way, so that the purpose of God should be fulfilled - the people of God should go on.  They answered the derision by their submission to God’s mind.",
		"bible_reading": "Zechariah 8:1-23 \n Revelation 16:1-21 \n Psalm 144:1-15 \n Proverbs 30:29-31  ",
		"image_url": "Empty at the moment",
		"today_command": "Grudge not one against another, brethren, lest ye be condemned: behold, the judge standeth before the door. Jam 5:9"
	}, 	
	{
		"devotion_id":25, 
		"devotion_title":"Title 1",
		"devotion": "When the Lord commissioned Elijah to anoint Elisha in his place( 1 Kings 19:19-23), Elijah, on finding Elisha, cast his mantle upon him. And Elisha said only one thing, “Let me go and kiss my father and my mother. Then,” he added, “I will follow thee.” Elisha merely wanted to say farewell to his parents but in reality it was an excuse to get away from the responsibilities that Elijah was led of God to give him. And Elijah knew that the time had come for Elisha to decide whether to leave his parents or not. And therefore Elijah, who was a true prophet of God, said in effect that Elisha could do whatever he wanted. “Go”, he said, “do whatever you want to do.” Whether it be a wedding or your wife’s birthday or your parents’ anniversary, do whatever you want to do assume I have not done anything. Imagine I have not even said anything”. The sarcastic Elijah was ruthless in his treatment of Elisha. But in truth he wanted to make it plain that if Elisha truly wanted to be a part of what God wanted to do then, he must relinquish everything joyfully, voluntarily and without any hesitation.  Remember the Lord Jesus said to a certain disciple, “Follow me; and let the dead bury the dead.” (Matthew 8:22). Elisha had to pay a price for the calling he was called into.  Our response to the direct call of the Lord demands an altar and a sacrifice that shall be costly.",
		"bible_reading": "Zechariah 9:1-17 \n Revelation 17:1-18 \n Psalm 145:1-21 \n Proverbs 30:32 ",
		"image_url": "Empty at the moment",
		"today_command": "Ask the Lord of the harvest, therefore, to send out workers into his harvest field. – Matthew 9:38"
	}, 	
	{
		"devotion_id":26, 
		"devotion_title":"Title 2",
		"devotion": "Since God's work is primarily an internal work that is eternal in character, there is no way that Satan can thwart God's work by using some external means.   It is very important for all of us to know and understand this.  God is primarily doing an inner work in our hearts.  Let us not add outward things to our lives and deceive ourselves imagining that we are becoming more spiritual.  We could be greatly deceived.  Surely, this is the greatest deception of the day!  God is focusing upon an inward work.  If we focus our attention on our inward spiritual growth, we will be kept from great deception. This will shield us from the imprudent efforts of many sincere, well-meaning, and earnest Christians, who fail to see what is happening in the invisible, spiritual, realm and are only able to focus their attention on the visible realm. If we concentrate upon what the Lord is attempting to do within us, we would prevent misguided Christians from influencing and even ruining our lives.  If our concentration is upon His work in us, then we will be kept from many deceptions and their ill effects upon our lives.  Many times we come under the influence of powerful men and women; we are blown by  different kinds of wind; and sadly many of us drift away from God's purpose.",
		"bible_reading": "Zechariah 10:1-11:17 \n Revelation 18:1-24 \n  Psalm 146:1-10 \n Proverbs 30:33  ",
		"image_url": "Empty at the moment",
		"today_command": " And be not drunk with wine, wherein is excess; but be filled with the Spirit; Ephesians 5:18"
	},
	{
		"devotion_id":27, 
		"devotion_title":"Title 0",
		"devotion": "Moses was brought up in the lap of luxury in his child­hood. Being a prince in the palace of Pharaoh, Moses was accustomed to have the very best. Moses grew up under the influence of the best Egyptian priests and tutors. The Bible says that Moses was educated in all the learning of the Egyptian princes (Acts 7:22). He learned of their wisdom and was instructed in all their culture.   Moses was not only groomed in the art of warfare but he became well versed in the science of his time.   It is with this background that we must see the character of Moses!  He saw that the pomp, power and pleasures of his life were in sharp contrast to the poverty, slavery and pitiable plight of his people, the Hebrews.  “By faith Moses, when he was come to years, refused to be called the son of Pharaoh’s daughter;  Choosing rather to suffer affliction with the people of God, than to enjoy the pleasures of sin for a season;” (Hebrews 11: 24,25).  The faith in Moses, when he had grown to maturity and become great, was aroused and so he refused to be known as the son of Pharaoh’s daughter, preferring to endure ill- treatment and suffer hardships with the people of God.  He made a deliberate choice to identify himself with the afflictions and hopes of Israel. He preferred to leave the king’s palace and be counted as a Hebrew despite the pain and disadvantages of such an alliance. With an eye of faith he saw the hand of God upon his life",
		"bible_reading": "Zechariah 12:1-13:9 \n Revelation 19:1-21 \n Psalm 147:1-20 \n Proverbs 31:1-7 ",
		"image_url": "Empty at the moment",
		"today_command": "First take the plank out of your own eye, and then you will see clearly to remove the speck from your brother’s eye.  - Matthew 7:4"
	},
	{
		"devotion_id":28, 
		"devotion_title":"Title 1",
		"devotion": "Christians have often considered people like Nero, Hitler, Stalin and Mussolini as the antichrist.  We often think that the antichrist is a person!  But John the apostle makes it very clear that antichrist is a spirit more than a person.  The antichrist is more an evil spirit that works against the purposes of Christ; the spirit of antichrist makes every attempt to usurp the place of the Spirit of Christ in a believer’s life.  And this spirit of the antichrist even works internally in our lives.   Oh how careful we need to be in these last days before His coming again!  Beloved, though the enemy cannot stop the eternal God from fulfilling what He has purposed in His eternal Son the Lord Jesus Christ, but the reality is that the enemy can stop us from being part of that purpose if we are not extremely diligent in our spiritual walk. The spirit of antichrist can deceive us, and even stop us from receiving God’s full salvation in our lives.  He may not be able to stop the work of God in His Son, but he can stop us from being a part of God’s purposes in the earth. This highlights the necessity for arming ourselves with great diligence in our spiritual walk.  Our lives stand in a great danger if we do not take this seriously.",
		"bible_reading": "Zechariah 14:1-21 \n Revelation 20:1-15 \n Psalm 148:1-14 \n Proverbs 31:8-9  ",
		"image_url": "Empty at the moment",
		"today_command": "Take heart, son; your sins are forgiven. – Matthew 9:2"
	}, 	
	{
		"devotion_id":29, 
		"devotion_title":"Title 2",
		"devotion": "In Numbers 13 we read that when the Israelites arrived at Kadesh-Barnea, the Lord told Moses to send twelve Spies into the land of Canaan. Ten returned with their hearts full of unbelief and the Lord decreed that the whole generation (except for Joshua and Caleb) would perish in the wilderness. When God said ‘Go’ they refused but after His judgment was pro­nounced upon them, they said, ‘We will go up”. Moses warned them not to go because the Lord would not lead them and be with them. Nevertheless they went and disaster fell upon them because the Ark of the Covenant ‘departed not out of camp’ (Exodus 14:44). During this period God expressly taught the children of Israel that it was (and still is) presumptuous and indeed foolish, to move about without His presence and His will. If God is not with us we are hopeless; we are bound to come against the enemy and be defeated. We are to follow the Lord and not try to go ahead of Him. Joshua, the successor of Moses, was quick to learn this valuable, everlasting principle; for when they were crossing the Jordan, he told the priests, ‘Take up the ark of the Covenant and pass over before the people’ (Joshua 3:6. 1).",
		"bible_reading": "Malachi 1:1-2:17 \n Revelation 21:1-27 \n Psalm 149:1-9\n Proverbs 31:10-24 ",
		"image_url": "Empty at the moment",
		"today_command": "It is written, Man shall not live by bread alone, but by every word that proceedeth out of the mouth of God.  Matthew 4:4 "
	},
	{
		"devotion_id":30, 
		"devotion_title":"Title 2",
		"devotion": "“For as in the days that were before the flood they were eating and drinking, marrying and giving in marriage, until the day that Noe entered into the ark, And knew not until the flood came, and took them all away; so shall also the coming of the Son of man be.” (Matt 24:38-39).  They knew not!  The majority of the people knew not.  But, there was a man called Noah and his family who knew.  While the majority knew not, there was a minority, a remnant who knew what was coming.  The majority did not realize that God’s judgment was coming down upon them.  The word ‘knew’ in Greek means knowing by experience.  Those people did not realize or perceive that the judgment of God was coming because they had not learned by experience.  But Noah knew by experience that the judgment of God was inching closer and closer.  Noah knew because he had chosen the ways of God.  When others chose not to know by experience, Noah chose to know God and His ways by experience.  Others chose not to learn. Noah chose to perceive and understand but others chose not to do so.  Let us examine ourselves in this light.  This is what we see even today.  The Lord is instructing His people.  He said that it shall be as in the days of Noah.  The majority were not prepared to learn the ways of God and the judgments of God by experience.",
		"bible_reading": "Malachi 3:1-4:6 \n Revelation 22:1-21 \n Psalm 150:1-6\n Proverbs 31:25-31  ",
		"image_url": "Empty at the moment",
		"today_command": "Let your light shine before men, that they may see your good deeds and praise your Father in heaven – Matthew 5:16"
	}
]