[
	{
		"devotion_id":0, 
		"devotion_title":"Title 0",
		"devotion": "The Scripture proclaims very clearly that repentance is the way to receive the Lord’s presence. The times of refreshing will come from the presence of the Lord. Repentance prepares the way and leads us into the Lord’s presence. Repentance prepares us for His presence. It helps us to stay in His presence. Repentance also enables us to continuously pursue His presence. Repentance makes the road of our heart straight. Repentance is not merely being sorry for the sins we have committed; it is something in which we should continue to live and remain in the presence of the Lord. It is a posture, God’s remnant need to maintain in these last days. \n\t History shows that revivals have always been preceded by repentance; they were accompanied by a strong spirit of repentance among the people. When they began to seek the face of God, when repentance and godly sorrow began to lay hold of their lives, they began to experience seasons of God’s refreshing in their lives. Repentance is the means that God uses to throw open the gates of heaven.  Repentance is thus God’s method of preparing broken vessels upon the earth.",
		"bible_reading": "Exodus 13:17-15:18 \n Matthew 21:23-46 \n Psalm 26:1-12 \n Proverbs 6:16-19 ",
		"image_url": "Empty at the moment",
		"today_command": " And saying, Repent ye: for the kingdom of heaven is at hand. Matthew 3:2"
	},
	{
		"devotion_id":1, 
		"devotion_title":"Title 1",
		"devotion": "Glimpsing into the history of Israel, one notices that in the beginning Israel was not really a nation as such, but rather a group of  large families that moved and lived together.  Initially, the families of Abraham, Isaac and Jacob formed the greater part of the nation of Israel. God Almighty was their King and He was the dominant influence of their lives.  God spoke to the early fathers and virtually filled and controlled every aspect of their lives. After Jacob, however, the families began to pay less attention to God, for they had multiplied and were greatly blessed. Soon they came under the yoke of the Egyptian kings. For nearly 400 years the Israelites remained slaves to the Pharaohs.  They laboured and groaned as slaves and cried out to the Lord in their misery.  The Lord heard their cries of affliction and delivered the children of Israel from Egyptian bondage.  He told them that He would take them to the land that had been promised to their father Abraham. \n\t It is important to observe that it was the Lord Himself who took the initiative to call the Israelites out of Egypt. It was none other than the Lord Himself who called them out of Egypt to become a separated people unto God.",
		"bible_reading": "Exodus 15:19-17:7 \n Matthew 22:1-33 \n Psalm 27:1-6 \n Proverbs 6:20-26",
		"image_url": "Empty at the moment",
		"today_command": "But that which ye have already hold fast till I come.  Revelation 2:25"
	}, 
	{
		"devotion_id":2, 
		"devotion_title":"Title 1",
		"devotion": "But ye are a chosen generation, a royal priesthood, an holy nation, a peculiar people; that ye should shew forth the praises of him who hath called you out of darkness into his marvellous light:” (1 Peter 2:9). \n\t The New Covenant quite clearly shows that God has chosen us and called us to be a separated and a peculiar people.  When we are born again in Christ, the Word of God says that we become a peculiar people unto God.  We are a chosen generation – a people called out by God from darkness into His likeness.\n\t The word ‘peculiar’ means uncommon, different from anything else.  Every born again child of God is called to be a peculiar person unto God.  We are not to be like other people of this world.  We are called to be a special people for God.  This is just like the calling that rested upon the children of Israel in the Old Covenant.  In the book of Deuteronomy, we read, “For thou art an holy people unto the LORD thy God, and the LORD hath chosen thee to be a peculiar people unto himself, above all the nations that are upon the earth.” (Deuteronomy 14:2).",
		"bible_reading": "Exodus 17:8-19:15 \n Matthew 22:34-23:12 \n Psalm 27:7-14 \n Proverbs 6:27-35 ",
		"image_url": "Empty at the moment",
		"today_command": "Confess your faults one to another, and pray one for another, that ye may be healed.   Jam 5:16"
	}, 	
	{
		"devotion_id":3, 
		"devotion_title":"Title 1",
		"devotion": "The elders of Israel asked Samuel the prophet to make them a king.  Instead of looking upon God and seeking His will, they began to look at the neighbouring nations.  They even wanted to imitate them. They envied other nations who had kings to rule over them.  So they asked Samuel to give them a king like all the surrounding nations had.  They said, “…make us a king like unto all the nations”. (I Samuel 8:5).  They wanted to do away with their heavenly King and replace Him with someone tangible and visible, like the earthly kings of other nations.  They failed to seek the will of their God.  Instead, they looked at their neighbouring countries so that they could imitate them and copy their ways.  What a terrible, backward, unfaithful, step the Israelites had taken! \n\t In the times in which we live, many believers also manifest this problem in their lives.  They see what worldly people are doing and they long to do what they do.  They harbour and nourish a complaining spirit; they envy their neighbours; they compare themselves to the ungodly; they long to imitate their superficial ways and they itch to adopt their colorful customs. In trying to do what others do, we reject God’s rule upon our lives.",
		"bible_reading": "Exodus 19:16-21:21 \n Matthew 23:13-39 \n Psalm 28:1-9 \n Proverbs 7:1-5",
		"image_url": "Empty at the moment",
		"today_command": "What therefore God hath joined together, let not man put asunder.  Mark 10:9 "
	}, 	
	{
		"devotion_id":4, 
		"devotion_title":"Title 1",
		"devotion": "The spirit of emulation and comparison is becoming an epidemic in the Christian world.  It is growing at a furious rate, as epidemic fevers often do.  One hears of men of God wanting to build houses, establish projects and raise buildings because that is the craze in the society.  In the process of doing these things and endeavoring to copy worldly people, they are drawn to many unscriptural activities and fail to honour God’s principles.  Thus they cease to be special, peculiar and unique unto the Lord.  They forsake the rule of God in their lives and try to be like others who do not even know the Lord.  They are dominated by society.  They look to people to meet their needs instead of looking unto God.  \n\t It is sad to see many believers living like the people of the world, forgetting the calling of God upon their lives.  They are prepared to suffer so that their earthly needs are met – a house, a car or such other comforts – but they are not prepared to suffer for the sake of the Lord.  They are prepared to stagnate in their spiritual life provided they have some tangible outward evidence of the blessings of God.",
		"bible_reading": "Exodus 21:22-23:13 \n Matthew 24:1-28 \n Psalm 29:1-11 \n Proverbs 7:6-23 ",
		"image_url": "Empty at the moment",
		"today_command": "Fear God, and give glory to him; for the hour of his judgment is come Revelation 14:7"
	}, 	
	{
		"devotion_id":5, 
		"devotion_title":"Title 1",
		"devotion": "King Ahasuerus had a queen whose name was Vashti (Esther 1:9). Queen Vashti had the privilege of knowing the king. She lived in the King’s palace along with the king. Vashti provides us on one hand a picture of the Israelites who had the privilege of knowing God as their Lord. She also typifies on the other hand, the modern day church that has the privilege of knowing the Lord.  \n\t Vashti didn’t appreciate the great privilege she had as the queen of the land. She neglected her great calling. She was not really living according to the King’s desires and will. We read, in Esther 1:9, that queen Vashti, had a great feast for the women of the palace. Although the king had prepared a feast for all the people (verse 5), yet Vashti decided to have a separate feast (verse 9) for the women. She wanted to walk in her own ways and do her own things. Queen Vashti didn’t do what was expected of her as the queen; she neglected her calling to be the queen; she made her calling to be of scant importance. There are many believers who have the privilege of knowing the Lord, but unfortunately, like Vashti, they are busy in various activities of there own making. They have forgotten the calling of God upon their lives. They have disregarded the commands of their King.",
		"bible_reading": "Exodus 23:14-25:40 \n Matthew 24:29-51 \n Psalm 30:1-12 \n Proverbs 7:24-27",
		"image_url": "Empty at the moment",
		"today_command": "Watch ye and pray, lest ye enter into temptation. The spirit truly is ready, but the flesh is weak. Mark 14:38 "
	}, 	
	{
		"devotion_id":6, 
		"devotion_title":"Title 1",
		"devotion": "In the days of Jesus, the Jews, and especially the scribes and Pharisees, felt secure because they were of the seed of Abraham (Romans 11:1). The natural Jews lived under a false sense of security. The Apostle Paul argues brilliantly in Romans Chapters 2 and 3, that the Jews did not have any special privilege.  God was no respecter of persons (Romans 2:11); no one could be justified by the deeds of the law (Romans 3:20). \n\t The Jews thought they were the children of God but they didn’t walk according to God’s commandments and expectations. Hence, the children of natural Israel were rejected by God. They felt secure and comfortable by virtue of their heritage, but it proved to be a false sense of comfort.  Many believers, today, have a false sense of security. They are content to be part of God’s kingdom; they feel secure in God’s house; they feel they cannot be removed from their place in Christ. They feel secure because of their past experiences, but they don’t see the need of having a living relationship with the Lord. They are quite content to be involved in church activities; they derive satisfaction from attending all the church events.  Do you have a false sense of comfort and security in Christ Jesus?",
		"bible_reading": "Exodus 26:1-27:21 \n Matthew 25:1-30 \n Psalm 31:1-8 \n Proverbs 8:1-11 ",
		"image_url": "Empty at the moment",
		"today_command": "Believe not every spirit, but try the spirits whether they are of God: because many false prophets are gone out into the world. 1Jo 4:1 "
	}, 	
	{
		"devotion_id":7, 
		"devotion_title":"Title 1",
		"devotion": "The Scripture say that just because queen Vashti (Esther 1:9) did not respond to the king’s calling, nor appreciate his will for her, the place of her privilege was given to another queen—one who would be better (more obedient) than her. Vashti forfeited her place (in the palace), her position (as one who was living with the king) and her possessions (her royal estate) due to her disobedience. She had lived under a false sense of security and hence the Queen’s robe and estates were removed from her and given to someone who would be worthy of those privileges. \n\t God has called us into a high calling in Christ Jesus. The Israelites and the Jews in not accepting Jesus, didn’t meet God’s desire. The Apostle Paul writes in Romans Chapter 11 that God rejected the Pharisees and Jews and instead called the Gentiles to be a people unto God. Similarly, Peter writes in 1 Peter 2:10, “Which in time past were not a people, but are now the people of God : which hadn’t o tamed mercy but row have obtained mercy.” The Scripture says that we were not a people (unto God) but now we have been called to be a people unto God.  In a spiritual sense, we have been called to take the place of Vashti in the Kingdom of God.",
		"bible_reading": "Exodus 28:1-43 \n Matthew 25:31-26:13 \n Psalm 31:9-18 \n Proverbs 8:12-13",
		"image_url": "Empty at the moment",
		"today_command": "Wherefore laying aside all malice, and all guile, and hypocrisies, and envies, and all evil speakings, 1 Peter 2:1 "
	}, 	
	{
		"devotion_id":8, 
		"devotion_title":"Title 1",
		"devotion": "God the Father has always wanted His Church to be a beautiful Bride for His Son. Which father would like to see his grown-up son roaming about in questionable places with unchaste women?  So also, the heart of the Father would be grieved to see His Son in the company of a woman who is not pure and chaste. In the book of James Chapter 4, verse 4 we read, “You (are like) unfaithful wives (having illicit love affairs with the world) breaking your marriage vow to God. Do you not know that being the world’s friend is being God’s enemy? So, whoever chooses to be a friend of the world takes his stand as an enemy of God.” (Amplified Bible).  The Living Bible puts it this way, “You are like unfaithful wives who love their husband’s enemy”. \n\t Remember that the Church is normally depicted as a woman and a bride in the Bible. If we are friendly with the world then we could well be likened to unfaithful wives who love their husband’s enemy. This is the condition of the Church today. She is friendly with world, the enemy of God, the Father. Let us not imagine that God will accept any type of bride for His Son.  He wants a bride-people who are separated unto God; He wants a Church with a virgin heart.",
		"bible_reading": "Exodus 29:1-30:10 \n Matthew 26:14-46 \n Psalm 31:19-24 \n Proverbs 8:14-26 ",
		"image_url": "Empty at the moment",
		"today_command": "Is any among you afflicted? let him pray. Is any merry? let him sing psalms.  Jam 5:13 "
	}, 	
	{
		"devotion_id":9, 
		"devotion_title":"Title 1",
		"devotion": "It is interesting to note that the work of purification that Esther had to go through was divided into two halves—six months with the oil of myrrh, and six months with sweet odors. (Esther 2:12) The number six represents ‘man’ in Biblical numerology. For six months the flesh was to be purified and then for another six months human spirit was to be cleansed. This means that we are to be purified first of the Adamic nature and then of the spirit of the first man. \n\t The oil of myrrh refers to the death of the flesh. When the Lord Jesus Christ was crucified He was embalmed with the oil of myrrh and spices, as was customary in those days. Oil represents the Holy Spirit. The oil of myrrh is used to cleanse us of every impurity and filth. We are to be soaked in the spirit of truth, the Holy Spirit.  This is the way that we will be prepared to put on fine linen garments. Our lives are to be fully immersed and soaked in the wonderful life-giving oil of myrrh that we may be fully cleansed and purified. Thus, the purifying of our lives is spread over a period of time. ",
		"bible_reading": "Exodus 30:11-31:18 \n Matthew 26:47-68 \n Psalm 32:1-11 \n Proverbs 8:27-32",
		"image_url": "Empty at the moment",
		"today_command": "And he said unto them, Exact no more than that which is appointed you.  Luke 3:13"
	}, 	
	{
		"devotion_id":10, 
		"devotion_title":"Title 1",
		"devotion": "The second half of the purification process of the bride was carried out with sweet odours. The bride had to prepare herself for six months with sweet odors’. (Esther 2:12).  In the Old Testament times, when God accepted an offering made by the priest at the altar, a sweet smell arose to His nostrils. A sacrifice that has been accepted by God provides a sweet odour to His nostrils.  It is sweet smell, a sacrifice acceptable, well pleasing to God (Philippians 4:18, Leviticus 26:31). The last six months of the bride were spent in preparing herself to please the king in a manner that would be acceptable to Him. Romans 12:1 call us to present our bodies as a living sacrifice, holy, acceptable unto God, which is our reasonable worship or service. \n\t Our lives are to be a worship unto God. This is another form of preparation. The surrender of our bodies should be considered a reasonable service unto God and not an exceptional and unique act. Worship is not just a matter of singing hymns, clapping hands and raising one’s hands; we are to offer our lives as a living sacrifice. There is a purifying that shall take place as we offer our lives upon God’s altar.",
		"bible_reading": "Exodus 32:1-33:23 \n Matthew 26:69-27:14 \n Psalm 33:1-11 \n Proverbs 8:33-36 ",
		"image_url": "Empty at the moment",
		"today_command": "Honor all men. Love the brotherhood. Fear God. Honor the king.  1Pe 2:17"
	}, 	
	{
		"devotion_id":11, 
		"devotion_title":"Title 1",
		"devotion": "Paul said that if any man uses wood, hay or straw, (that is, the things of the world and the choice of man) to build upon the foundations laid by Christ, then that building would fall and come to naught (1 Corinthians 3:12). The work and effort done by man can never have any lasting value because it would not please the King. The Apostle Paul tells the Corinthian church to take heed how they build for they can either build their house with man’s resources or they could build their house with foundation stones provided by God. There is a choice that needs to be exercised in the things we do. We are to choose to do that which would please God. \n\t Some people think that since the Son of Man has set them free, they are free to do whatever they like! They argue that at one time they were undoubtedly under the law, but now they have been set free from bondage, and hence they are free as birds to do exactly as they wish. Beloved, such as they, deceive themselves. They live under a misconception. Our Savior has freed us from the bondage of sin that we may become servants of God (Romans 6:22). ",
		"bible_reading": "Exodus 34:1-35:9 \n Matthew 27:15-31 \n Psalm 33:12-22 \n Proverbs 9:1-6",
		"image_url": "Empty at the moment",
		"today_command": "Be not wise in thine own eyes. (Proverbs 3:7)"
	}, 	
	{
		"devotion_id":12, 
		"devotion_title":"Title 1",
		"devotion": "Often we get into a lackadaisical, spiritless, indifferent and languid attitude towards spiritual things, unconsciously.  This attitude always prompts us to move out of the essential nature of spiritual life within.  Then we gravitate towards something that is unprofitable, needless and earthly. Spirituality is a tremendous power as far as God is concerned.   \n\t What is spirituality?  For many people spirituality means, giving one self to gatherings, to soul winning, to the study of the scriptures etc.  Such an individual we call  a spiritual person.  But that is not true  as far  as God is concerned.  The Lord Jesus said to Nicodemus, “ that which is born of the Spirit  is spirit.”  In other words that which is born of the Spirit is spiritual. The Spirit of God not only births it, but the Spirit also sustains it.  Our life needs to be wholly spiritual.  In other words, it should be birthed, sustained and consummated by the Spirit of God.  The Lord wants to reinforce the fundamental and essential reality in our lives.  If we remain in a place of sensitivity, we shall realise what the church needs today.  God needs spiritual men and women for preserving and carrying on  of His testimony in the earth.  The Lord needs re-enforced spirituality in the midst of His peop",
		"bible_reading": "Exodus 35:10-36:38 \n Matthew 27:32-66 \n Psalm 34:1-10 \n Proverbs 9:7-8 ",
		"image_url": "Empty at the moment",
		"today_command": "That he no longer should live the rest of his time in the flesh to the lusts of men, but to the will of God. 1 Peter 4:2 "
	}, 	
	{
		"devotion_id":13, 
		"devotion_title":"Title 1",
		"devotion": "What is the Second Coming of the Lord? \n\t  “When he shall come to be glorified in his saints, and to be admired in all them that believe (because our testimony among you was believed) in that day.”  (2 Thessalonians 1:10). \n\t This talks of the life of the Lord coming into His fullness in a people inwardly but many preachers, who talk of the Second Coming, are caught up only with the outward things.  They are only interested in what is going to happen in Jerusalem, in the temple, and in countries like Iraq and Iran.  Yes, there will be a manifestation of the signs of the times, but they will happen within and among God’s people first. Beloved, Adventism is the consummation of something that has been going on in an inward way.   How then do I best know that the coming of the Lord draws nigh?  Not best of all by prophetic signs but by what is going on within the heart of the Lord’s people. The best of the ‘signs of the time’ is what the Holy Spirit is doing in His own people.",
		"bible_reading": "Exodus 37:1-38:31 \n Matthew 28:1-20 \n Psalm 34:11-22 \n Proverbs 9:9-10",
		"image_url": "Empty at the moment",
		"today_command": "Take heed therefore that the light which is in thee be not darkness. Luke 11:35 "
	}, 	
	{
		"devotion_id":14, 
		"devotion_title":"Title 1",
		"devotion": "It is common to hear people express spiritual birth in words such as,  “I have come into Christianity.”  “I have accepted the Christian religion”.. etc. And they come into a new type of behaviour and form.  They begin to do things in a different way.  Some think it is just outward and objective and that one has come into some other sphere of interests, activity, life and conduct!  That is the idea many, therefore, hold about Christianity.  Yet true Christianity is far different.  It is a new entity.  Recently, when some young non-Christian brothers accepted Christ, their parents found it difficult to accept the changes in them but they felt that they would soon return to the religion of their parents.  They thought that all that had happened to their offspring was merely a change of interests temporarily. They even allowed their children to continue to be associated with a living church if that is what interested them.  The parents thought that they will change after some time!  However, the Christian life, as we see in John Chapter 3, is not just a change of interest.  It is not a movement from one sphere of interest and activity to another sphere of religious activity. ",
		"bible_reading": "Exodus 39:1-40:38 \n Mark 1:1-28 \n Psalm 35:1-16 \n Proverbs 9:11-12 ",
		"image_url": "Empty at the moment",
		"today_command": "Be watchful, and strengthen the things which remain that are ready to die:  Rev 3:2"
	}, 	
	{
		"devotion_id":15, 
		"devotion_title":"Title 1",
		"devotion": "A born-again person is not an improved edition of humanity or even a new edition of humanity.  He has a totally new constitution and is a new species of being.  \n\t The homo-sapien, the natural man, always relies on his natural abilities, like the use of human reasoning.  He uses his reasoning to figure out anything he does not understand.  He tries to comprehend everything with the faculty of his mind.  A person always acts according to the understanding of his natural capacities and capabilities.  This is the way Nicodemus behaved in John Chapter 3. When the Lord told him that he needed to be born again, he wondered how a person could be born twice!  He applied his natural reasoning to the words that Jesus spoke.  He reasoned with his mind and intellect and found that no man could be born from the womb of his mother a second time.  The natural man always acts upon the reasoning of his mind.  When God speaks, the natural man receives it, but first tries to understand it in the strength of his natural ability.  It appears that he must be able to reason the thing through to comprehend.",
		"bible_reading": "Leviticus 1:1-3:17 \n Mark 1:29-2:12 \n Psalm 35:17-28 \n Proverbs 9:13-18",
		"image_url": "Empty at the moment",
		"today_command": "Little children, keep yourselves from idols. Amen. 1Jo 5:21 "
	}, 	
	{
		"devotion_id":16, 
		"devotion_title":"Title 1",
		"devotion": "What was the difference between the Pharisees and Saducees on the one hand and Christ, on the other?   It was not the difference of religion or devotion.  It was not that Jesus was more devoted and religious than the Pharisees. It was the difference of the spiritual and the natural.  Jesus was from above.  He was born of the Spirit.  The others were of the natural.  Jesus was an enigma to the Pharisees, because they walked and lived in the natural, while He was spiritual.  That is why they could not have any relationship with Him.  Jesus was a mystery to them.  They always thought Him to be wrong. When Jesus spoke, the Pharisees said that He spoke against them.  They even said that He had a devil inside Him!  Why could they not accept Him?  They belonged to two different realms.  \n\t If God’s people do not walk in the Spirit, there can be similar differences in  the midst of God’s people, even in the church.  We may be a sincere and a devoted people, but what matters is whether we belong to the natural realm or the realm of the Spirit.  Only the realm of the Spirit can bring forth spiritual fruit.",
		"bible_reading": "Leviticus 4:1-5:19 \n Mark 2:13-3:6 \n Psalm 36:1-12 \n Proverbs 10:1-2 ",
		"image_url": "Empty at the moment",
		"today_command": " But ye, beloved, building up yourselves on your most holy faith,  Jude 1:20"
	}, 	
	{
		"devotion_id":17, 
		"devotion_title":"Title 1",
		"devotion": "Jesus healed many people, but when He began to speak the things He heard his Father speak, they were offended and left Him alone.  He lived aloof from others, but for a few faithful disciples.  He was a man of the Spirit while others were just in the natural realm. \n\t We are all called to walk and live in the realm of the Spirit.  Today, the tragedy is that many do not like that rejection, that lonely walk.  I still remember that in the initial days of my  ministry, while I fasted and waited on Him the Lord spoke to me very specifically  from the book of Luke and said , “Blessed are ye, when men shall hate you, and when they shall separate you from their company, and shall reproach you, and cast out your name as evil, for the Son of man’s sake. Rejoice ye in that day, and leap for joy: for, behold, your reward is great in heaven: for in the like manner did their fathers unto the prophets.” (Luke 6:22,23)  It took some years for me to understand these words.  I did not like the rejection I suffered but gradually I realised that we are called to walk this way.  If you walk by the Spirit, you will walk with the Man whom the world has rejected.  ",
		"bible_reading": "Leviticus 6:1-7:27 \n Mark 3:7-30 \n Psalm 37:1-11 \n Proverbs 10:3-4",
		"image_url": "Empty at the moment",
		"today_command": "And the Spirit and the bride say, Come. And let him that heareth say, Come  Revelation 22:17 "
	}, 	
	{
		"devotion_id":18, 
		"devotion_title":"Title 1",
		"devotion": "“The wind bloweth where it listeth, and thou hearest the sound thereof, but canst not tell whence it cometh, and whither it goeth: so is every one that is born of the Spirit” (John 3: 8) \n\t When the wind blows across the land, it does not have to give any prior notice.  Our weather satellites cannot tell us from where the wind originates.  Winds, typhoons, hurricanes are totally unpredictable.  Meteorologists have a lot of difficulty in forecasting the path the wind would take.  The wind blows wherever and whenever it decides to blow!  It just blows and when it does, we cannot say it is ever out of date, that it should have blown yesterday and not today!  Nor can anyone tell the wind not to blow for a time.  None can say that the wind has come at the wrong time.  One cannot say that it is an inconvenient time for the wind to blow.  The wind blows where it will, and no one can subject the wind to his will.  The wind blows and that is all.  Man cannot hasten it, prevent it, control it or do anything about it.  It blows and that is all there is to it.  It proceeds from the vast sovereign hand of God.  Here we have the principle of the sovereignty of the Spirit as represented by the sovereignty of the wind.",
		"bible_reading": "Leviticus 7:28-9:6 \n Mark 3:31-4:25 \n Psalm 37:12-29 \n Proverbs 10:5 ",
		"image_url": "Empty at the moment",
		"today_command": "Casting all your care upon him; for he careth for you.  1Pe 5:7"
	}, 	
	{
		"devotion_id":19, 
		"devotion_title":"Title 1",
		"devotion": "In the book of Ezekiel  Chapter 47, we read about the river of God that flows from the threshhold of the Sanctuary of the Lord.  There are many prophetic details here.  One thing I wish to share is that the river could not be passed through. “ it was a river that I could not pass over: for the waters were risen, waters to swim in, a river that could not be passed over.” (Ezekiel 47:5).  It is impossible to cope with this river!  It is too much for man!  You cannot bring  the Holy Spirit within your ability.  Oh,  if only  we know the Spirit like this!  This is what the Spirit is and what He does!  He refuses to be tied down to our human systems and our human resources.  He refuses to be limited to our natural man, to our traditions, to our prejudices.  \n\t The Holy Spirit is beyond the control of the people of Jerusalem, too much and too difficult for Peter and all his prejudices. He was too much for everything that got into His way!  It is a river you cannot control. It flows in it’s own sovereign way.  The Spirit has a way that He will take.  He has His own mind.",
		"bible_reading": "Leviticus 9:7-10:20 \n Mark 4:26-5:20 \n Psalm 37:30-40 \n Proverbs 10:6-7",
		"image_url": "Empty at the moment",
		"today_command": "Give to every man that asketh of thee; and of him that taketh away thy goods ask them not again.  Luke 6:30 "
	}, 		
	{
		"devotion_id":20, 
		"devotion_title":"Title 1",
		"devotion": "People seem to be in  tearing hurry.  We have become a hurrying people, a very busy lot.  God’s people have come to a place where they have no time for Him and His purposes.  They are all in a great hurry; and spending time in His House, has become a matter of great struggle .  Even ministries in  the House of God, are people are in a hurry.  The only time when they are not in a hurry is when they spend time in the pleasure and enjoyment of their flesh.  One of the signs of the end times is that men shall be lovers of pleasures.  The apostle Paul says while writing to Timothy, “This know also that in the last day perilous times shall come.  For men shall be lovers of their own selves, covetous........lovers of pleasures more than lovers of God; Having a form of godliness but denying the power thereof; from such turn away.”   Christians have begun to spend week-ends for their own pleasure and enjoyment.  What a ghastly thing is happening!  And all these things have brought us the place where we have become real paupers, as far as the things of the Spirit are concerned.  O beloved, we have come to a place where we are harbouring a spirit of lightness, ease, easiness, excitement, glamour and emotion.  We are living in a time when the Church has been overcome by many, many of such things.",
		"bible_reading": "Leviticus 11:1-12:8 \n Mark 5:21-43 \n Psalm 38:1-22 \n Proverbs 10:8-9 ",
		"image_url": "Empty at the moment",
		"today_command": "Beloved, if God so loved us, we ought also to love one another.  1Jo 4:11 "
	}, 	
    {
		"devotion_id":21, 
		"devotion_title":"Title 1",
		"devotion": "Church life is the essence of Christian life.  Some people say they want to have a deeper Christian life.  They cherish and aspire for a deeper life in Christ.  Their lives must necessarily be closely knit to a full church life because one cannot separate a Christian from his church.  As a Christian, ones life cannot be lived apart from the church; it is a church responsibility. You bear the responsibility to represent the Lord’s thought and mind for His Church in the local church.  We must live a life that God holds for the church.  We must be able to see the mind of God for the living Church. \n\t What is the Church?  This is  a matter of great importance.  What is God’s first and supreme thought concerning the Church?  The Apostle Paul gives us some guidance to the answer.  In 2 Timothy 2:10, Paul says, “Therefore I endure all things for the sake of the elect (that is ‘God’s chosen’ according to the Amplified Bible).” In other words,  if you see what the church is in the mind of God, if you see what is in the heart of God, if you see what the church is meant to be, your behaviour, your responses, your attitude would also be changed. As a member in the church you are not just an individual Christian, but your life is church life. ",
		"bible_reading": "Leviticus 13:1-59\n Mark 6:1-29 \n Psalm 39:1-13 \n Proverbs 10:10",
		"image_url": "Empty at the moment",
		"today_command": "Strive to enter in at the strait gate: for many, I say unto you, will seek to enter in, and shall not be able.  Luke 13:24 "
	}, 	
	{
		"devotion_id":22, 
		"devotion_title":"Title 1",
		"devotion": "The Church is not something that has been formed and constituted by mankind.  It has not been brought into existence by human effort.  The Church has been birthed by the pure act of God.  The Eternal Spirit constitutes it.  We have been made a part of God’s eternal purpose (in Christ) by an act of God in our lives.  We are not only born again by an act of God, we are also brought into His eternal programme by a work of God. \n\t An individual Christian is called to be a part of this eternal Church constituted by the Spirit.  When we are born again by the Spirit, the Spirit’s work does not come to an end. The individual Christian is essentially constituted a spiritual being by the work of the Holy Spirit.  What is true of the individual is also true of the aggregate or the corporate – the Church.  The Church is something born of the Holy Spirit and therefore, is a spiritual thing.   Due to the constituting work of the Holy Spirit in an individual’s life, a person is transformed into a spiritual being.  This is also true of the corporate body of believers, which is His Church.  The Church is born of the Spirit, just as we are born of the Spirit.  The Church is born of the Spirit and therefore it is wholly spiritual. ",
		"bible_reading": "Leviticus 14:1-57 \n Mark 6:30-56 \n Psalm 40:1-10 \n Proverbs 10:11-12 ",
		"image_url": "Empty at the moment",
		"today_command": "Let your loins be girded about, and your lights burning; Luke 12:35 "
	}, 
	{
		"devotion_id":23, 
		"devotion_title":"Title 1",
		"devotion": "In the Apostolic times, the Church was a single entity, though it was represented in numerous local companies all over the Roman Empire.  There were local churches at different places, such as at Ephesus, Corinth and Phillipi, but they were all known as the Church of God.  The church as a whole was a single entity.  It was not divided into denominations.  All the believers, wherever they lived, identified with the Church of God.    The expression of Apostle Paul in I Corinthians Chapter 1 verse 2 clarifies this thought;  he says, “Unto the church of God which is at Corinth, to them that are sanctified in Christ Jesus, called to be saints, with all that in every place call upon the name of Jesus Christ our Lord, both theirs and ours:”(1 Cor 1:2).   There were different levels of growth, but the church was a single entity.  They were united and held together by their spiritual ties and spiritual ministries.  The church was not divided into denominations in the Apostolic times.  It was not divided into ‘ists’ and ‘ians’ and ‘ites’ and ‘isms’ and all other terminations that we know of today.   The little differences among the churches was with regard to their level of growth.   They were held together by spiritual ties and by spiritual ministries.  It was just one everywhere! ",
		"bible_reading": "Leviticus 15:1-16:28 \n Mark 7:1-23 \n Psalm 40:11-17 \n Proverbs 10:13-14",
		"image_url": "Empty at the moment",
		"today_command": "But rather give alms of such things as ye have; and, behold, all things are clean unto you.  Luke 11:41"
	}, 	
	{
		"devotion_id":24, 
		"devotion_title":"Title 1",
		"devotion": "The question I wish to place before us is, “for what does the Church exist?”  We find a clue in the words of the  Apostle Paul, where he says, “…the house of God, which is the church of the living God, the pillar and ground of the truth. And without controversy great is the mystery of godliness: God was manifest in the flesh, justified in the Spirit, seen of angels, preached unto the Gentiles, believed on in the world, received up into glory” (1 Tim 3:15-16).  The deposit in the Church is the testimony of Jesus.  The Church exists for that alone.   “That good thing which was committed unto thee keep by the Holy Ghost which dwelleth in us.”( 2 Tim 1:14).  The Church is the repository of the Testimony of Jesus! \n\t What is the testimony of the Lord?  It is the present living Person of Jesus in the power of the Holy Spirit.  He is the living, victorious Jesus in the power of the Holy Spirit. That is where it begins – the living Person of Jesus Christ.  It is not the historic Jesus of Palestine who lived centuries ago.  No. He is the right-up-to-date, here-and-now living Jesus, manifested, demonstrated and proved to be alive in the power of the Holy Ghost!",
		"bible_reading": "Leviticus 16:29-18:30 \n Mark 7:24-8:10 \n Psalm 41:1-13 \n Proverbs 10:15-16 ",
		"image_url": "Empty at the moment",
		"today_command": "Humble yourselves therefore under the mighty hand of God, that he may exalt you in due time:  1Pe 5:6 "
	}, 	
	{
		"devotion_id":25, 
		"devotion_title":"Title 1",
		"devotion": "It is of significance to note what John the Apostle said,  “I John, who also am your brother, and companion in tribulation, and in the kingdom and patience of Jesus Christ, was in the isle that is called Patmos, for the word of God, and for the testimony of Jesus Christ” (Rev 1:9).  John could see the sovereign hand of God in that situation, so hard and so difficult.  John could see that God had exercised His  Divine sovereignty over the Roman Empire, over the persecutors and over the one who had sent him to Patmos; a divine sovereignty which says, “this is why I have brought you here for!  The Romans sent you, but I have brought you!  It is not their sovereignty that has put you here, it is mine!  I have something to say to the churches.  And I have given you a quite time to say it for me!”  John did not say, “I was in the Isle of Patmos, because the Roman Empire or the Roman Emperor sentenced me there. Because the Roman persecutors caught me and sent me there?  Not a bit of that!  But he said,  “I was in the Isle of Patmos… for the testimony of Jesus”. \n\t Now that has been true of John, because he had stood for the testimony of Jesus.  It is so expressive that that phrase runs through the whole book of Revelation! ",
		"bible_reading": "Leviticus 19:1-20:21 \n Mark 8:11-38 \n Psalm 42:1-11 \n Proverbs 10:17",
		"image_url": "Empty at the moment",
		"today_command": "Fear not, little flock; for it is your Father's good pleasure to give you the kingdom.  Luke 12:32 "
	}, 	
	{
		"devotion_id":26, 
		"devotion_title":"Title 1",
		"devotion": "What is the testimony of the Lord Jesus?  It is the living presence of Jesus Christ!  The livingness of Jesus in the midst of His people! In certain countries, though there is an absence of freedom to preach the gospel, still we see that Jesus is alive and very much present, for God cannot be limited by man.  Men may try to curb Christian evangelism, but this will not limit the power of God.  Even though the preaching of the gospel is prohibited, yet we see that the Lord Jesus Christ is raised up in their midst.  In such countries where it is forbidden to speak and declare the gospel openly, people hunt down Christian believers, and yet, Jesus is manifested as the one who is alive in their midst.  They search for Christian believers so that they may eliminate them only because Jesus is alive in their midst.  That is the testimony of Jesus.  His testimony is not in just a bold declaration.  His testimony is a living witness of a greater measure of His life, which is visible and demonstrated in His people.  The testimony of the Lord Jesus is presented to us symbolically right at the beginning of the book of Revelation - “I am he that liveth, and was dead; and, behold, I am alive for evermore, Amen; and have the keys of hell and of death” (Revelation 1:18).",
		"bible_reading": "Leviticus 20:22-22:16 \n Mark 9:1-29 \n Psalm 43:1-5 \n Proverbs 10:18 ",
		"image_url": "Empty at the moment",
		"today_command": "Behold, I come quickly: hold that fast which thou hast, that no man take thy crown.   Rev 3:11 "
	}, 	
	{
		"devotion_id":27, 
		"devotion_title":"Title 1",
		"devotion": "The early Church experienced the power of  the resurrection in a clear, demonstrative way which is evident from the book of Acts.  They lived in the power of His resurrection.  I was greatly encouraged by meditating on this aspect.  Death could not swallow the early disciples because death itself had been swallowed up in victory!  What a glorious assurance the early Apostles had in their lives! What a ground of confidence!  What an encouragement!  They stood on a solid ground of confidence in the resurrected One.  \n\t What a glorious assurance governed the lives of the Apostles!  From the circumstances and situations they faced, it seemed as if they would never survive, but they endured and lived through all the adversities they underwent.  Time and time again, it looked as though they would succumb and that the end had come, but they survived!  As far as man was concerned everything was over, but the One who says, “I am alive for evermore,” was in their very midst.  The saints of old did not place their confidence in themselves, but in the One who had been resurrected.  Herein lies the difference!   We may feel that we are not going to survive and get through!  But never believe that!  It is a lie!  Never believe the lie of the enemy.  We shall survive because the One who said that He is alive for evermore is present in our midst.  ",
		"bible_reading": "Leviticus 22:17-23:44 \n Mark 9:30-10:12 \n Psalm 44:1-8 \n Proverbs 10:19",
		"image_url": "Empty at the moment",
		"today_command": " And this commandment have we from him, That he who loveth God love his brother also.  1 John 4:21"
	}
]