[
	{
		"devotion_id":0, 
		"devotion_title":"Title 0",
		"devotion": "As far as God is concerned, the Church is not a subject or even an object!  It is a fallacy to think and speak of the Church as a separate entity without knowing that the Church is Christ Himself.  The Bible says that the Church is Christ’s body.  It is Christ.  The Church is His bride, His wife.  Ephesians five makes it clear that, the Church is His body and that being of one flesh She is an integral part of Him.  Beloved, we must make sure that the Church, by itself, is not the object of our attention and devotion.  We must not pursue after the Church as an object having a distinctive identity of its own, but rather pursue after the person of Christ, Himself.  It would be a tremendous tragedy if we have the Church but miss Christ!  Then we would have the misfortune of having the blessing but missing the One who blesses!  God and Heaven are not looking for something called the universal Church.  O no, they are not!  Neither are they looking out for any local church.  The Father’s eye is only upon Christ, His Son.  God is looking for one thing only and that is Christ!  We thank God for the Church but it must not be a Christ~less Church, for she is the wife of the Lord, Jesus Christ.  God is looking for Christ’s nature, His life, His conduct and behavior, His virtue and character, His influence and impact, His victory over Satan and the forces of darkness.  ",
		"bible_reading": "2 Samuel 18:1-19:10 \n John 20:1-31 \n Psalm 119:153-176 \n Proverbs 16:14-15 ",
		"image_url": "Empty at the moment",
		"today_command": " Be sober, be vigilant; because your adversary the devil, as a roaring lion, walketh about, seeking whom he may devour: 1 Peter 5:8"
	},
	{
		"devotion_id":1, 
		"devotion_title":"Title 1",
		"devotion": "Are you displeased with your style of life?  Are you dissatisfied with your spiritual growth in the midst of God’s people?  Has the absence of hunger caused you to be satisfied with a substandard life in the church?  Do you live far from the experience of His fullness?  Has success and achievements in the ministry weaned you away from the things of God?  If you are hungry for the Lord, you will always remain  dissatisfied because nothing but His fullness will satisfy you.  Forced to live without His fullness, you will always remain hungry for more of Him!  God’s people today do not display the hunger that the psalmists had.  There is a strong sense of spiritual poverty and a lack of true hunger in the Church.  Many things are likely to happen in these last days.  The Lord Himself said that the love of many would wax cold.  Will He find faith when He returns?  Many shall depart from faith.  These very things are happening in these last days.  Yet, in the midst of such spiritual apathy, the Lord’s desire is to repossess His church.  He is looking for the thirsty and the hungry in the earth, in this hour.  One thing prevents Him and restrains Him from filling the desires of His people, beloved.  He is waiting for His people to have a deeper hunger for His manifest Presence and Person.  ",
		"bible_reading": "2 Samuel 19:11-20:13 \n John 21:1-25 \n Psalm 120:1-7 \n Proverbs 16:16-17",
		"image_url": "Empty at the moment",
		"today_command": "Stir up the gift of God, which is in thee by the putting on of my hands. 2 Timothy 1:6"
	}, 	
	{
		"devotion_id":2, 
		"devotion_title":"Title 2",
		"devotion": "For a long time the Church has been trying to make things happen and work things out in the power of its own strength!  However, now, the Lord wants to make things happen by the power of His Presence.  God wants us to turn our faces towards Him so that we can begin to see what He is doing.  This involves a radical turn-about.  Instead of asking Him to join us, we have to take the initiative to join Him!  The general cry of His people, so far, has been, “Lord, I have a burden to do this work.  I need your help, Lord.  Please come and bless my sacrifice and this work!”  However, what we need to do is to seek His face first, and know His will and the desire of His heart.  Then, we have to give ourselves to the execution of His will.  Though our ways are so different to the ways of the Lord, the Lord has set His heart upon drawing a people to Himself.  Let us therefore, see what He is doing, and what is upon His heart.  Let us not delay to join Him in this hour.  That is what Jesus, the Son of Man did.  God is no respecter of persons.  He would like to manifest Himself to His people, but He is looking for something specific in us – a true hunger.  He will go wherever there is a true hunger for His Presence.  He is coming back to repossess His Church, but we need to have the kind of hunger that He is looking for in these days.  ",
		"bible_reading": "2 Samuel 20:14-21:22 \n Acts 1:1-26 \n Psalm 121:1-8 \n Proverbs 16:18 ",
		"image_url": "Empty at the moment",
		"today_command": "Wherefore let him that thinketh he standeth take heed lest he fall. 1 Corinthians 10:12"
	},
	{
		"devotion_id":3, 
		"devotion_title":"Title 3",
		"devotion": "Is there a strong hunger and yearning in your depths for the Presence of the Lord?  Have you come to a point where you do not care what your near and dear ones, relatives, and neighbours would say?  Is your response to God, “Let the people say what they want to, but I deeply yearn for you, your Presence, and your person!”  How long has it been since you hungered for more of God?  Do you have a hunger for Him that consumes you to the point that nothing else counts?   God is looking for a certain condition in us.  Today, we find plenty of religious literature with catchy titles such as, “Ten Steps to Gold”, “Five Principles to God’s Presence”, “Easy Steps to Know God” etc.  These have not helped God’s people to progress and grow.  We cannot use some forms and methods to approach the Lord and come into a greater intimacy with Him.  First, there must be a deep dissatisfaction within.  In the midst of your successes, your accomplishments, and even your spiritual growth, there must be a deep discontent.  Forget about what people think of you or have thought of you in the past.  Saints, let me challenge you to forget about every distraction, set aside every human opinion including your own, and let the Spirit of God cultivate one thing within each one of us, namely a genuine hunger and thirst for His manifest Presence.",
		"bible_reading": "2 Samuel 22:1-23:23 \n Acts 2:1-47 \n Psalm 122:1-9 \n Proverbs 16:19-20",
		"image_url": "Empty at the moment",
		"today_command": "Wherefore, my dearly beloved, flee from idolatry. 1Corrinthians 10:14 "
	},
	{
		"devotion_id":4, 
		"devotion_title":"Title 4",
		"devotion": " “And the men rose up from thence, and looked toward Sodom: and Abraham went with them to bring them on the way.   And the LORD said, Shall I hide from Abraham that thing which I do;” (Genesis 18:16,17)  The Lord said to Himself, “Shall I hide from Abraham that which I do.”  Just as the Father showed everything to the Son and hid nothing from Him, so also the Father hid nothing from Abraham.  Why did the God do that?  He was not honour bound to tell all things to Abraham, but there was something in Abraham that began to draw God to Abraham.  That something in Abraham prompted the Lord to think, “How can I withhold this from my friend Abraham?”  What a relationship that was!  A people should arise like Abraham to maintain a posture before the Lord from whom the Lord would not hide anything.  This is the need of the hour, beloved saints of God.Saints, there was a bringing forth of God’s promise to Abraham.  The Lord began to speak to him about the son that He had promised him.  There was a surfacing and a breaking forth of God’s work in his life.  There was an emphasizing of the promise, once again.  God’s promises will not fall into our laps all of a sudden, merely because He has made a covenant with us.  Because of Abraham’s posture and attitude towards the Lord, the Lord would not hide anything from Abraham.",
		"bible_reading": "2 Samuel 23:24-24:25 \n Acts 3:1-26 \n Psalm 123:1-4 \n Proverbs 16:21-23 ",
		"image_url": "Empty at the moment",
		"today_command": "Be not forgetful to entertain strangers: for thereby some have entertained angels unawares.  Hebrews 13:2"
	}, 	
	{
		"devotion_id":5, 
		"devotion_title":"Title 5",
		"devotion": "John the Baptist opens the New Testament with a cry for repentance.  He shows that repentance is the way to return to God.  Repentance prepares the road of our heart that leads straight to the Lord.  Repentance builds up every low place.  Repentance brings down every exalted state and high thinking.  Both individually and collectively, repentance prepares the way for the Lord to enter our lives.  Repentance prepares us for His Presence.  O may this go deep into our being.  Let us not justify our ways, beloved people of God.  If we do not have an attitude of repentance, we cannot hope to reach God.   \n\t We repented before we received Jesus Christ into our lives, but that is not good enough.  Repentance has to work in us continually.  It is time to take note of this.  To have a spirit of repentance we need to seek the face of God continually.  If we find that we lack in a hunger for the Lord, it is because we have yet to repent of our ways fully.  Repentance paves the way to get to God.  It prepares us for His Presence.  We cannot live in His Presence without repentance! No one can live in the Presence of God without humility and meekness.   It is through continual repentance alone that one is able to remain in the Presence of such a Holy One.  ",
		"bible_reading": "1 Kings 1:1-53 \n Acts 4:1-37 \n Psalm 124:1-8 \n Proverbs 16:24",
		"image_url": "Empty at the moment",
		"today_command": "Quench not the Spirit.  1Thessalonians 5:19 "
	},
	{
		"devotion_id":6, 
		"devotion_title":"Title 6",
		"devotion": "How long has it been since you said, “Lord, I want you in my life”?  When did you last lay down all things and cry out to the Lord, “Lord I desire you and none other.  I desire nothing else and no one else in my life.”  When you pursue God in this manner and run after Him; when you run on the road of repentance and say, “Lord I want nothing else but you in my life”, you will surely find Him,  you will experience His Presence in greater measures in your life!    When we run on the road of repentance, crying out to Him, we will find that He turns to meet us half way.  This is what we see in the life of the prodigal son!  When he repented of his ways in the midst of feeding with the swine, He saw the Father walk towards him with outstretched arms.  Many will try to hinder us from going this way.  They will stop and ask, “Where are you going?  What are you doing?”  However, do not stop to answer them, or wonder what we should say to them.  All we have to say is, “I am running after Him.  I am going after God.  I must meet Him somehow.”  Let nothing discourage, daunt, or dishearten you.  Let your heart be set on one thing alone.  You will meet with Him as you run on this road of repentance.  This is not a matter of pride.  It is a matter of hunger for the Lord!  May we settle this in our heart!",
		"bible_reading": "1 Kings 2:1-3:2 \n Acts 5:1-42 \n Psalm 125:1-5 \n Proverbs 16:25 ",
		"image_url": "Empty at the moment",
		"today_command": " Let every soul be subject unto the higher powers. For there is no power but of God:Romans 13:1"
	},
	{
		"devotion_id":7, 
		"devotion_title":"Title 7",
		"devotion": "When Jesus said, “I am the Bread,” even the disciples lost their hunger for bread!  They lost the desire for the bread of this world, but set their eyes upon the Bread of Heaven.  Is this your condition today?  Do you feel something deep within your being?  The Lord is tired of the superficiality and hypocrisy of His people.  He is weary of their double standards.  What His people consider good is just not good enough for the Lord.  He is exhausted with their pretentiousness and love for religious, showy, false, outward things.  Their good things have become the enemy of His best things.   \n\t As you read this and hear the voice of the Spirit let your heart be broken by the Holy Spirit.  If you yearn and hunger for the Lord, the Holy Spirit will deal with you and break you.  The power of the Spirit of God will crush and break you.  It is time to be holy.  It is time to make our lives holy.  The time has come to choose God.  It is time to refrain from many legitimate things that you indulge in.  Quit reading other books more than you read the Word of God.  Quit watching what you used to watch.  Be diligent to redeem the time.  It is time to reschedule your priorities and be holy (which really means to be separated and devoted).  Therefore, take time to be holy.",
		"bible_reading": "1 Kings 3:3-4:34 \n Acts 6:1-15 \n Psalm 126:1-6 \n Proverbs 16:26-27",
		"image_url": "Empty at the moment",
		"today_command": "Take heed therefore how ye hear: Luke 8:18 "
	}, 	
	{
		"devotion_id":8, 
		"devotion_title":"Title 8",
		"devotion": "For what do you truly hunger?  Do you hunger to do many things for the Lord and then in the midst of all your activities give Him second place in your life?  This is what is happening in churches all over the world.  People gather to worship the Lord, but He is not found in their midst.  The music instruments are there, the voices are there, the beautiful songs are there!  But, where is the One whom they sought to worship?  This is the tragedy that causes my heart to break.  The main point is that in the midst of all the worship and the Christian activities that are taking place, He is missing.  He occupies the second place in every worship service and meeting!  The motivating factor of our lives should be doing His will and meeting His pleasure.  We should do nothing out of a selfish motive.  Apart from His will and His pleasure, nothing else should draw us to Him.  To do things for Him and forget Him midway is not the way of pursuing God.  What we do must be “Him” and not “His”! God’s deep desire is for a people who will hunger and ask, “God where are you?  Where are you in our midst?”  We have satiated our hunger for Him by filling our lives with many other things.  People finish their meetings and return home!  They are satisfied with their worship and their service to the Lord.  We have satiated our hunger for Him by many unnecessary activities.",
		"bible_reading": "1 Kings 5:1-6:38 \n Acts 7:1-29 \n Psalm 127:1-5 \n Proverbs 16:28-30",
		"image_url": "Empty at the moment",
		"today_command": " Flee fornication.  1Corrinthians 6:18"
	},
	{
		"devotion_id":9, 
		"devotion_title":"Title 9",
		"devotion": "Too often, God’s people draw false finish lines in their lives, because the flesh sometimes gets excited in matters concerning the Lord.  The natural man would like to interpret God’s revelations according to the flesh.  We like to build our own sand castles, which are quickly built, but easily broken.  We desire to make a monument and draw our own boundaries and lines.  We choose to make our own memorials and portray our own opinions.  In our zeal, we prefer to draw our own conclusions to events and situations, without grasping the whole picture.  We feel so good about the spiritual things we have experienced, and delightedly exclaim, “It is good for us to be here, Lord.”   Peter on the mount of transfiguration  did not realize that there was much more in store for him, in the Lord (Luke 9:30-36).  He had no idea in what manner God wanted to use him in the days ahead.  In childish enthusiasm, Peter suggested that the three disciples build some structures (monuments), which did not quite fit into God’s economy.  At that point of his life, Peter innocently drew a false finish line.  He thought it was good to be there.  Many have erected monuments around some good experiences in their lives and have settled there.  Many have false finish lines! ",
		"bible_reading": "1 Kings 7:1-51 \n Acts 7:30-50 \n Psalm 128:1-6 \n Proverbs 16:31-33",
		"image_url": "Empty at the moment",
		"today_command": " Distributing to the necessity of saints; given to hospitality. Romans 12:13"
	},
	{
		"devotion_id":10, 
		"devotion_title":"Title 10",
		"devotion": "In the Scriptures, both in the Old Testament as well as in the New Testament, we find that the Lord knocks at the door of His house.  In the Old Testament, we see Him prophetically knocking at the door of His own House, seeking the attention of His beloved people, in the Song of Solomon, “I sleep, but my heart waketh: it is the voice of my beloved that knocketh, saying, Open to me, my sister, my love, my dove, my undefiled: for my head is filled with dew, and my locks with the drops of the night.” (S of S 5:2)   \n\t The Lord is knocking at the door of His own House!  In the New Testament also, He is seeking the attention of His beloved, the Church.  Why is the door of His own house locked?  Who has the key to the door of His house?  The door is locked because He has given the keys away.  To whom has He given the keys?  We read of this in the book of Matthew. “And I say also unto thee, That thou art Peter, and upon this rock I will build my church; and the gates of hell shall not prevail against it.  And I will give unto thee the keys of the kingdom of heaven: and whatsoever thou shalt bind on earth shall be bound in heaven: and whatsoever thou shalt loose on earth shall be loosed in heaven. (Matthew 16:18,19)",
		"bible_reading": "1 Kings 8:1-66 \n Acts 7:51-8:13 \n Psalm 129:1-8 \n Proverbs 17:1 ",
		"image_url": "Empty at the moment",
		"today_command": "But pray ye that your flight be not in the winter, neither on the sabbath day: Matthew 24:20 "
	}, 	
	{
		"devotion_id":11, 
		"devotion_title":"Title 11",
		"devotion": "David’s wife, Michal, became barren because of her attitude towards David, the king. (2 Samuel 6:20-23)  She valued dignity over deity!  She refused to look upon and behold the king in an uncovered state (without his kingly robes).  She felt offended and slighted because David danced, sang, and worshipped before the Lord in an uncovered condition in front of his people.  She paid more attention to the outward rather than to the inward.  She placed greater emphasis upon the dignity of the king before the people, and did not value the desire of his heart to honour the Lord above all else.  The Scripture says that she was barren from that day. Could it be that David was never again intimate with Michal, his wife?  Her barrenness may be because he was not intimate with her any longer!.  The disgust she felt towards David locked the door to intimacy, joy and fruitfulness!  May we not find ourselves barren like David’s wife Michal! \n\t Beloved, the Church’s reluctance to pay the seemingly high cost of intimate worship is the root cause of her barrenness!  The bride of Christ has grown accustomed to living in the King’s house, in the absence of the King! The Church, the bride of Christ, has become accustomed to the luxuries of the King’s palace and the absence of the King of Kings.",
		"bible_reading": "1 Kings 9:1-10:29 \n Acts 8:14-40 \n Psalm 130:1-8 \n Proverbs 17:2-3",
		"image_url": "Empty at the moment",
		"today_command": "et not your heart be troubled: ye believe in God, believe also in me.  John 14:1"
	},
	{
		"devotion_id":12, 
		"devotion_title":"Title 12",
		"devotion": "The cry of God’s remnant in this hour must be for the Reviver Himself and not merely for revival!  The cry of Lord’s people today must not be for a visitation or a revival but a cry must go out from them for the Reviver Himself.  Instead of seeking for the One who is the Reviver, God’s people are running helter-skelter to find places where revivals are taking place.  Some have named their church Revival Church, though the Reviver left them long ago!  All their works and efforts are nothing but mere doctrine!  The Church instead had memorialized the visitations of the past as if her Spouse has passed away and all future meetings with Him (except the meeting in the sky) are out of question!  What a tragedy! \n\t  The Lord does not want me to embrace the hollow memory of what once was!  I want Him!  We must want Him!  If we listen to the voice of the Holy Spirit, we shall know when He knocks on the door of our lives.  However good and nice our experiences have been with Him in the past, let us not be satisfied with the fragrance of ‘where He once stood in our lives’. “Lord, show me your face.  I am not content with your fragrance.  I deeply yearn for your face, Lord.  Show me your face.”",
		"bible_reading": "1 Kings 11:1-12:19 \n Acts 9:1-25 \n  Psalm 131:1-3 \n Proverbs 17:4-5 ",
		"image_url": "Empty at the moment",
		"today_command": " Therefore let us not sleep, as [do] others; but let us watch and be sober.  1Thessalonians 5:6"
	},
	{
		"devotion_id":13, 
		"devotion_title":"Title 13",
		"devotion": "Bartimaeus was the blind man who ignored the cries of disapproval from the crowd, but cried out to Jesus for mercy.  (Mark 10:46-52).    He was a blind man who could not see Jesus himself, but had to have blind faith to believe the testimony of someone who told him, “Jesus is close by”. \n\t Someone told Bartimaeus that Jesus had come to Jericho.  He told him that Jesus would pass through the gates of Jericho city.  Being a beggar who was considered useless by the citizens, he took his usual place outside the city gates.  He did not know where the Lord Jesus was and when He would pass by.  He confessed that there was no way he could know where He was.  But someone came and told him that Jesus had come and was very close by.  Bartimaeus believed him though he could not see Jesus.  It was difficult for him to believe the testimony of another person, nor was he familiar with Jesus’ voice, yet he  relied and believed upon someone else’s confession and experience that Jesus was near.  Though Bartimaeus had never seen Jesus, believing in His Presence and in His nearness through someone else’s testimony, resulted in the commencement of a deep work of God in within him. ",
		"bible_reading": "1 Kings 12:20-13:34 \n Acts 9:26-43 \n Psalm 132:1-18 \n Proverbs 17:6",
		"image_url": "Empty at the moment",
		"today_command": " Therefore all things whatsoever ye would that men should do to you, do ye even so to them: Matthew 7:12"
	}, 	
	{
		"devotion_id":14, 
		"devotion_title":"Title 14",
		"devotion": "Many of us suffer from spiritual blindness.  Many things have clouded our eyes and dimmed our vision.  We have many hindrances.  Many things hinder our seeing of the Lord; the cares of life and the weariness of life can temporarily blind us or numb our senses so that we cannot perceive the nearness of God!  (Nevertheless, there are men of God who were been able to see and experience the Presence of God).  Bartimaeus’ blindness did not stop him from crying out to the Lord to receive a touch from Him. Why should our blindness stop us?  Something incredible worked within him to bring forth a cry for Jesus, the Son of David.  Let us be humble enough to admit that we are blind, but let our blindness not stop us from crying out to Jesus.  When we hear that Christ is here, in our midst, let us not hesitate to cry out to Him from our depths!   \n\t If you cannot see, feel or sense the Presence of the Lord in these days, then it is time to find someone you can trust, who can sense His Presence.  It is time to hear about the nearness of the Lord from such people.  Take them at their word.  They may have encountered God in some small measure only, but be willing to hear them and follow their example.  ",
		"bible_reading": "1 Kings 14:1-15:24 \n Acts 10:1-23 \n Psalm 133:1-3 \n Proverbs 17:7-8 ",
		"image_url": "Empty at the moment",
		"today_command": " Praying always with all prayer and supplication in the Spirit, Ephesians 6:18"
	},
	{
		"devotion_id":15, 
		"devotion_title":"Title 15",
		"devotion": "There are many in Christendom whose eyes remain dry.  They were broken vessels at one time, but now they have lost their sensitivity for the Spirit of God.  In the past, a slight touch from the Lord would have caused them to be broken, but they seem to have lost their feeling for heaven’s workings.  Some have lost that brokenness!  I am not talking about emotions, but of something initiated by the Holy Spirit.  We need to be open to the Spirit so that He can work upon us and bring about a brokenness upon our inner man.  Only God can initiate a brokenness in us.  True godly sorrow will invariably bring forth tears and deep emotions as well.   \n\t Tears are valuable to the Lord.  Beloved, let us not waste our tears in self-pity.  The tears that flow at railway stations, airports, and places of farewell are the product of our natural affections.  However, the tears of brokenness and repentance, fall at the feet of the Lord.  We need to wash His feet with such tears continually.  Our tears are so precious to the Lord. They are meant for His feet. He has promised to accept the sacrifices, worship, and praises of those who have a broken spirit.  He will not overlook such a heart.  Are your eyes dry in these days?  Is there a brokenness welling up within your being?  ",
		"bible_reading": "1 Kings 15:25-17:24 \n Acts 10:24-48 \n Psalm 134:1-3 \n Proverbs 17:9-11",
		"image_url": "Empty at the moment",
		"today_command": " But covet earnestly the best gifts: and yet shew I unto you a more excellent way.  1Corrinthians 12:31"
	},
	{
		"devotion_id":16, 
		"devotion_title":"Title 16",
		"devotion": "Hebrews 12, Verse 18 says, “For ye are not come…..”.   Then in Verse 22 we read, “But ye are come….”  There is a ‘NOT’ and there is also a ‘BUT’.   The words NOT and BUT, in relation to one another, occur frequently in the New Testament.  When we read the expressions of the Spirit in the New Testament, we see that the word NOT is used frequently and repetitiously.  We also cannot fail to notice that the NOT invariably culminates in a resounding BUT of God.  These two words are two governing words.   \n\t To make it clear, there lies a new comprehension (revelation) of the meaning of Christ, of the difference that He has made to us, of the great divide we see  and of our present position.  Let us first take a verse from the Gospel according to John. John 1:13.     Which were born, not of blood, nor of the will of the flesh, nor of the will of man, but of God.  There is a negative side and also a positive side.  Jesus was born to the accompaniment of a NOT (or NOR used thrice in succession); at the same time He was born to a BUT of God!  There is something positive and dynamic in the use of the BUT of God, for it is linked and coupled to the resurrection of the Lord Jesus Christ.  ‘BUT’ is the positive of God.",
		"bible_reading": "1 Kings 18:1-46 \n Acts 11:1-30 \n Psalm 135:1-21 \n Proverbs 17:12-13 ",
		"image_url": "Empty at the moment",
		"today_command": "And he saith unto them, Follow me, and I will make you fishers of men. Matthew 4:19 "
	}, 	
	{
		"devotion_id":17, 
		"devotion_title":"Title 17",
		"devotion": "“Almost unannounced and mostly undetected there has come in modern times a new cross into popular evangelical circles.  From this new cross has sprung a new philosophy of the Christian life, and from that new philosophy has come a new evangelical technique – a new meeting and a new kind of preaching.  \n\t The old Cross would have no truck with the world.  For Adam’s proud flesh it meant the end of the journey.  The new cross, if understood right , is the source of oceans of good clean fun and innocent enjoyment.  It lets Adam live without interference.  His life motivation is unchanged, he still lives for his own pleasure.  \n\t The new cross does not slay the sinner, it direct him.  It gears him into cleaner and jollier way of living and saves his self- respect.  The old Cross is a symbol of death, God salvages the individual by liquidating him and then raising him again to newness of life.  God offers life, but not an improved life.  The life He offers is life out of death.  It stands always on the far side of the cross.” \n\t -  The Old  Cross and the New,  A. W Tozer",
		"bible_reading": " 1 Kings 19:1-21 \n Acts 12:1-23 \n Psalm 136:1-26 \n Proverbs 17:14-15",
		"image_url": "Empty at the moment",
		"today_command": " Be ye therefore ready also: for the Son of man cometh at an hour when ye think not. Luke 12:40"
	},
	{
		"devotion_id":18, 
		"devotion_title":"Title 18",
		"devotion": "In the Old Covenant days, talking of the new nation of Israel, God declared, “I have chosen thee” (Isaiah 41:8) , “ Thou art My people” (Isaiah 51:16).  These words are repeated several times in different books of the Old Testament signifying that from that time onwards the Israelites were designated as God’s own people.  Thus Sinai is remembered for the birthing of a nation, a nation that was non-existent, a nation separated from other nations.  Something new was wrought by the hand of God.  History was made.  When God said, “Thou art My people.”  He meant, “You are the result of My working.”  This is what God reminded His people repeatedly through the prophets.  A new beginning had been made.  God had laid hold of a nation.\n We need to know that our God is a God of action.  He has been working from the beginning and He is still working.  In Genesis 1:1 it is written, “In the beginning God …..” and in Hebrews 1:1 we read, “God, who at sundry times and in divers manners spake in time past unto the fathers by the prophets, Hath in these last days spoken unto us by his Son, ..”  God is still speaking to us.  He is still a God of action.",
		"bible_reading": "1 Kings 20:1-21:29 \n Acts 12:24-13:15 \n Psalm 137:1-9 \n Proverbs 17:16 ",
		"image_url": "Empty at the moment",
		"today_command": " Servants, be subject to your masters with all fear; not only to the good and gentle, but also to the froward. 1Pe 2:18"
	},
	{
		"devotion_id":19, 
		"devotion_title":"Title 19",
		"devotion": "Our natural birth was different.  You are not born Christians.  We are never born naturally as a child of God.  We never inherit divine life by natural birth, BUT when we are born again, it is a divine act of God.  The new man is not born of the natural.  This new creation, after the Lord Jesus, is not the result of the mingling of the bloods of man and woman.  It is not the result of the joining of two sexes.  It is not a mixture of bloods, but it is a direct work of the hand of God.  This is what we need to understand very clearly.  It is not of man but it is of God.  We are born again by the Spirit of God, Hallelujah.  Thus, we become a part of His new creation, which He has brought forth by His own hand.   \n\t Praise God that every born-again believer is born, not as a result of the mingling of bloods of their natural parents, but as a direct consequence of the hand of God in their lives.  We are God’s  act.  We have become Christians by the blood of the Lord Jesus Christ.  Hallelujah!  This is a precious truth we need to hold on to.  No wonder that Jesus told Nicodemus, a leader of the Jews, “That which is born of the flesh is flesh; and that which is born of the Spirit is spirit.”  (John 3:6).",
		"bible_reading": "1 Kings 22:1-53 \n Acts 13:16-41 \n Psalm 138:1-8 \n Proverbs 17:17-18",
		"image_url": "Empty at the moment",
		"today_command": " Be not deceived; God is not mocked: for whatsoever a man soweth, that shall he also reap.  Galatians 6:7"
	}, 	
	{
		"devotion_id":20, 
		"devotion_title":"Title 20",
		"devotion": "‘Messiah’ is a Hebrew term.  It’s equivalent in the New Testament is ‘Christ’.  They both mean the same.  The ‘Messiah’ in history and the ‘Messiah’ according to Hebrew concept and expectation is the ‘Christ’ in the New Testament of the new Israel of God.  It is one name, the same name, with the same meaning but carried over now to the New Testament.  The Book of Hebrews makes it very clear, that all of the old Israel’s hopes, expectations of the coming Messiah and all they had associated with that name are now taken up in Christ.  Christ comprehends and fulfils it and goes beyond their conceptions and thus beyond their acceptance!   The Scriptures clearly show that the Jews had placed all their hope in the Messiah to save them from foreign rule.  They had associated themselves fully with the concept that the Messiah would come as a saviour in the natural sense.  Their conceptions were limited to the outward and the physical, compared to what the Father had purposed for them in and through Christ, His Son.  Their conception concerning the Messiah was one of exclusiveness pertaining to the Jews.  However, the Christ of the New Testament of God’s New Israel is much much greater and much bigger than all that the Old Israel ever hoped for, looked for, prayed for and anticipated!",
		"bible_reading": "2 Kings 1:1-2:25 \n Acts 13:42-14:7 \n Psalm 139:1-24 \n Proverbs 17:19-21  ",
		"image_url": "Empty at the moment",
		"today_command": " Walk in wisdom toward them that are without, redeeming the time. Colossians 4:5"
	},
	{
		"devotion_id":21, 
		"devotion_title":"Title 21",
		"devotion": "Jesus was not revived!  Yes, he was raised to life.  JESUS is God’s act in His resurrection.   The Father saw to it that His Son was properly, clinically dead before the Holy Spirit raised Him up and made Him to sit on the right of the Father’s throne.  Jesus was under the earth for three days, before He was raised from the dead.  This makes it clear that it was nothing but a divine act of the Eternal God that raised Him from the dead.  Anybody can revive a man from coma or unconsciousness, but a man who has been dead for three days cannot be revived unless God intervenes and raises him up.  Paul writes in his letters that there was a direct intervention of God in raising His Son from the dead.  It was an act of the Eternal God that Jesus was raised to life and to the throne.  It must register very clearly in our spirits that Jesus was not revived but  was raised from the dead.  Many believers are living as though they have been revived in Christ and not raised up with Christ from the dead.  One can only be raised up if one is fully dead!  Several Christians, however, fail to appropriate their death in Christ.  They continue to live with the old man still alive and kicking!  They live a revived life, only to slump back to their old state after sometime.  We are not revived in Christ but raised up in Christ.  We are called NOT to live a revived life BUT a resurrected life!",
		"bible_reading": "2 Kings 3:1-4:17 \n Acts 14:8-28 \n Psalm 140:1-13 \n Proverbs 17:22",
		"image_url": "Empty at the moment",
		"today_command": "But sanctify the Lord God in your hearts: 1Peter 3:15 "
	}, 	
	{
		"devotion_id":22, 
		"devotion_title":"Title 22",
		"devotion": "The kingdom of God is constituted within an individual.  It is something inward.  This is what the new humanity is all about.  It is something, which is engraved within.  It does not come by doing certain outward activities.  It does not come by observation; it comes by conception.  It is conceived within an individual by the Holy Spirit.  It is not acquired by certain outward adjustments or conformities.  It is wrought within by the process of conception.  The life of Christ does not come by following some outward rules and regulations. \n\t It is a sad reflection upon Christianity that the Christian life we see all around  us is something that has come by outward observation rather than by an inward conceiving and constituting work by the Spirit.  The new man and the new humanity comes by the working of the Holy Spirit in the individual’s life.  It is organic.  It is something innate, intrinsic and inherent.  It is not something, which is the result of man’s desire to organise, categorise and classify.  He has given us a new constitution within that is conceived by the Holy Spirit Himself and that enables us to truly worship Him and follow Him.  It is something that radiates life.  It is a movement of life within.    It is not an activity, that is a product of man’s zeal.   ",
		"bible_reading": "2 Kings 4:18-5:27 \n Acts 15:1-35 \n Psalm 141:1-10 \n Proverbs 17:23 ",
		"image_url": "Empty at the moment",
		"today_command": " Salt is good: but if the salt have lost his saltness, wherewith will ye season it? Mark 9:50 "
	},
	{
		"devotion_id":23, 
		"devotion_title":"Title 23",
		"devotion": "When the Lord lowered a basket and told Peter to arise, kill and eat, Peter was in a particular place with God where the Lord was wanting to bring about a change in his constitution.  The account in Acts Chapter 10 shows us that Peter was very reluctant to move ahead at the bidding of the Spirit.  God was wanting to change Peter in an organic manner.  This is so often the case with us, as well.  It is a matter of a divine movement within us wherein we need to allow the Holy Spirit to work within us.  Sometimes those in leadership lose patience with brothers and sisters who resist the workings of the Spirit or when they do not see a quick work of the Spirit in them.  The way of the Holy Spirit, however, is so different.  God the Holy Spirit had to perform a work in the life of Peter.  There was a movement of God within him, as there is so often within us.  It is not something legal; it is not a matter of do’s and don’ts or of must and must not.  It has to come from within us, as we would subject ourselves to the Holy Spirit.  It is the act of God, the initiative of God, the dawning of a new awareness that “Something is happening to me because it is happening in me”. ",
		"bible_reading": "2 Kings 6:1-7:20 \n Acts 15:36-16:15 \n Psalm 142:1-7 \nProverbs 17:24-25",
		"image_url": "Empty at the moment",
		"today_command": " But take ye heed: behold, I have foretold you all things.Mark 13:23"
	},
	{
		"devotion_id":24, 
		"devotion_title":"Title 24",
		"devotion": "  One of my friends visited me after many years.  As a part of a group, he is committed to raise New Testament local churches.  He shared some of his convictions with me.  He explained what was actually happening.  The intentions were noble and worthy, but the birthing power of the Spirit was absent.  We have never had such confusion as we have today among God’s people.  Men are trying to set up spiritual things in the name of the Lord, and many of them seem to be sincere.  We know that we could also be a part of such a company if we do not exercise extreme caution.  Many are working hard to raise up the Body of Christ.  Christian movements are taking place, brethren are coming together with a new understanding of one another, institutions and organisations are being raised up to meet the demands of the day.  Nevertheless, in the midst of all this activity, the confusion increases.  I am not exaggerating, nor am I saying that we are the only people who seem to be going in the right direction.  We stand in as much danger as anybody else does, if we are not sensitive to the working of the Holy Spirit.  Beloved, the only answer in this hour is for God, the Holy Spirit to work in us and bring about a new constitution among God’s people.",
		"bible_reading": "2 Kings 8:1-9:13 \n Acts 16:16-40 \n Psalm 143:1-12 \n Proverbs 17:26 ",
		"image_url": "Empty at the moment",
		"today_command": "But refuse profane and old wives' fables, and exercise thyself rather unto godliness. 1 Timothy 4:7 "
	}, 	
	{
		"devotion_id":25, 
		"devotion_title":"Title 25",
		"devotion": "I read a statement that said that ‘the empty tomb proves that Jesus is alive’.  We may have heard this earlier for it is a popular phrase or slogan.  There were times in our lives when we appreciated such slogans and also used them to witness about Christ.  However, in the light of all  that the Lord is speaking to us in these days, we know that there is an artificial ring about such popular statements.  The statements are correct and proper by themselves.  The basis of the statements are legal and officially acceptable, but the statements lack conviction because of the absence of life. \n\t The proof that Jesus is alive is that He is living in you.  The empty tomb does not prove that Jesus is alive.  The world is never going to believe that Jesus is alive, unless Jesus is manifested in and through our lives.  It is not an official or legal matter but it is a matter of LIFE.  This is a very important principle to apply to our daily lives.  The Scriptures say that we have passed from death to life.  We have moved from death to life, where the power of resurrection has begun to take hold of our lives.  The Lord is looking for a constitution of His life in His people.  This is not a matter of a legal or official standing, but  of life.",
		"bible_reading": "2 Kings 9:14-10:31 \n Acts 17:1-34 \n Psalm 144:1-15 \n Proverbs 17:27-28",
		"image_url": "Empty at the moment",
		"today_command": " And Jesus answering saith unto them, Have faith in God. Mark 11:22"
	},
	{
		"devotion_id":26, 
		"devotion_title":"Title 26",
		"devotion": "A man of God named John Owen, an old puritan leader, warned his people with these words:   \n\t “You have an imaginary Christ and if you are satisfied with an imaginary Christ, you must be satisfied with an imaginary salvation.” \n\t Many people live according to an imaginary Christ in them.  Your salvation is not by the work of your intellectual ability.  It is by the pure work of the Spirit of God.  What Owen says is true and relevant today.  Many have an imaginary Christ today, a Christ of  their  theology and doctrine.  This Christ of their doctrine and theology does not resemble the One in the Scripture!  The Christ of their imaginations  revolves around their self life.  This is true even among the so-called believers!  If any of us are going to be satisfied with an imaginary Christ of our own making then we must be satisfied with an imaginary salvation in our lives, as well.   \n\t “There are  a great many bogus Christ’s among us these days”.  -A.W.Tozer",
		"bible_reading": "2 Kings 10:32-12:21 \n Acts 18:1-22 \n Psalm 145:1-21 \n Proverbs 18:1 ",
		"image_url": "Empty at the moment",
		"today_command": " Let no man seek his own, but every man another's [wealth].  1 Corinthians 10:24"
	},
	{
		"devotion_id":27, 
		"devotion_title":"Title 27",
		"devotion": "Zion is not a place in heaven; it is a realm in God.  People have misunderstood the true meaning of Zion.  In reality it is quite different from what people have thought.  Today, the emphasis is that, when we are born again by the Spirit of God, we find a berth in heaven after our death.  This is Scriptural no doubt, but the early disciples did not give such an emphasis to their messages.  Nor did this form the major part of the teaching of the early apostles.   \n\t When a person accepts Jesus as His Saviour and Lord, the important thing is that the person has come to a new place or realm.  He has not only become a new person in Christ but he has also come to a new place in Christ.  Yes, he has come to Zion, the city of God.  The Scripture does not say that we are coming to Mt. Zion.  but that we have already come to Mt Zion, which is the picture of the consummation of all things in Christ.   We have become the inhabitants of Mt Zion by virtue of believing in Christ, the Son of God.  There are many experiences we have to go through yet, but the end of them lies in Zion, which, is the consummation of the full purposes of God.  Zion comes into view in one’s life, when one turns to the Lord and is born again by the Spirit.  ",
		"bible_reading": "2 Kings 13:1-14:29 \n Acts 18:23-19:12 \n Psalm 146:1-10 \n Proverbs 18:2-3",
		"image_url": "Empty at the moment",
		"today_command": "Go ye therefore, and teach all nations, baptizing them in the name of the Father, and of the Son, and of the Holy Ghost: Mat 28:19 "
	}, 	
	{
		"devotion_id":28, 
		"devotion_title":"Title 28",
		"devotion": "The Lord has given the key of His House to His own people!  He has given His people the strength and ability to open the windows of heaven and close the gates of hell!  In other words, the Lord has given His Church the keys that will unlock the door to His own appearance!  If His people open the door, He will enter in.  Opening the door will lead to His very Presence.  The latch is on our side!  Beloved, the Church has locked and bolted the door from inside.  The door is securely locked from within.  Therefore, it is up to His people to open the door so that He may come in!  Who has locked the door?  The religious traditions of men have barred the door and even closed the windows.  There is no way for light to filter into the Church through barred doors and windows.  Religious men have painted the windows of His home with the traditions of man!  Nevertheless, the reality is that the Lord has given the keys of the door to His people.  The seeming tragedy in this hour is that the Lord is persistently knocking at the door of His own house, and there is none to listen to His knock and open the door.  In the Song of Solomon, we get an accurate picture of the Bridegroom (the Lord Jesus Christ), persistently and continually knocking at the door.  We find a double-hearted woman (the Church) say, “I sleep but my heart waketh. . .”  ",
		"bible_reading": "2 Kings 15:1-16:20 \n Acts 19:13-41 \n Psalm 147:1-20 \n Proverbs 18:4-5 ",
		"image_url": "Empty at the moment",
		"today_command": "Rebuke not an elder, but entreat him as a father; and the younger men as brethren; 1 Timothy 5:1-2 "
	},
	{
		"devotion_id":29, 
		"devotion_title":"Title 29",
		"devotion": "Man is attempting to master space, nuclear forces, and many other things, but he has not yet been able to master or overcome the landslide moral degradation that has set in.  We have advanced scientifically and technologically more than any other generation, and yet there is a new kind of barbarism, inhumanity, cruelty, lust and destruction!   We get to read about it in newspapers and get to see and hear it in the news channels.   Intellectual advancement has not been able to stop the moral decline of man.  Many scientists wonder and fear what will happen in the earth.  They are fearful of the outcome of their research programs.  They warn the world of an unspeakable holocaust!  There is much more ungodliness and unrighteousness in the world today than ever before!  Truly we are living in times when the wisdom of man is at its peak; it is driving man to his destruction.  Though ungodliness and unrighteousness abound universally, the prince of this world has also contrived to give a small place to the Divine, be it politics, in society and secularism, as if to show his great understanding and knowledge of all things.  In the zenith of man’s wisdom even the things of God are handled with impunity.  It seems therefore that man can manage everything, and yet he cannot manage himself!",
		"bible_reading": "2 Kings 17:1-18:12 \n Acts 20:1-38 \n Psalm 148:1-14 \n Proverbs 18:6-7",
		"image_url": "Empty at the moment",
		"today_command": " But take heed lest by any means this liberty of yours become a stumblingblock to them that are weak. 1Corrinthians 8:9"
	}
]