[
	{
		"devotion_id":0, 
		"devotion_title":"Title 0",
		"devotion": "The philosophy in the world today is to get everything as quickly as possible and as cheaply as possible.  We seem to be living in an age of cheapness. Common thinking  tells us to get as much as possible at the least cost and with the least amount of effort. This philosophy seems to have engulfed the whole world.  It is ruling the whole world at this time.  Everything is designed to meet the ends of this philosophy.  Do you agree with me ?  It is an age of bargains and discounts, of manipulating and of influencing the minds of people, be it the home or the office.  Every realm and sphere of our lives seems to be governed by this philosophy.  Wherever we go we want to give the least amount of money and get as much as possible for that amount.  The motto is, “get it quickly, get it easily and get it cheaply.”   Everything is tailored to meet the need of this philosophy.  Now, what is true in the secular has become very largely true in the spiritual, as well. The standards have been terribly brought low.  The thinking that is ruling the world seems to have also affected the Church.  The worldly spirit of getting quick, easy results with the least effort,  is now affecting and even ruling the spiritual world.  There are many who have begun to bargain and look for discounts in their transactions with the Lord.  ",
		"bible_reading": "Leviticus 24:1-25:46 \n Mark 10:13-31 \n Psalm 44:9-26 \n Proverbs 10:20-21 ",
		"image_url": "Empty at the moment",
		"today_command": "Give diligence to make your calling and election sure: for if ye do these things, ye shall never fall:  2Pe 1:10 " 
	},
	{	
		"devotion_id":1, 
		"devotion_title":"Title 1",
		"devotion": "A life of real sacrifice, a poured-out life, is considered visionary.  The Pauline altar, to which the great apostles were called to suffer and die for their Lord, is being replaced by an invitation to come, and get over suffering!  The altars of the twentieth century have become  comfortable and cushy.  Men and women approach this altar to receive and not to give.  \n\t The present-day Gospel has become a diluted one.  This is what has ruined the Church.  The Church today, has not even heard the Gospel of the Kingdom, as she ought to.  The true Gospel presents Jesus as King, as the Lord, as the First One.  This is the Gospel which Jesus and the early apostles preached.  The Church has let humanism enter her precincts and now have become partakers of this humanistic gospel which appeals to the interests of man and not God.  While the Gospel of the Kingdom demands obedience, discipline, consecration ,and dying to self, the diluted and watered-down Gospel of today pleads and coaxes men to come to Jesus and receive every blessing!  Cheapness and easiness have entered spiritual circles and brought a proliferation of sham.  People have sought easy ways. ",
		"bible_reading": "Leviticus 25:47-27:13 \n Mark 10:32-52 \n Psalm 45:1-17 \n Proverbs 10:22",
		"image_url": "Empty at the moment",
		"today_command": "[Be] of the same mind one toward another. Romans 12:16 "
	},
	{
		"devotion_id":2, 
		"devotion_title":"Title 1",
		"devotion": "One of the words that has lost its meaning in this hour, is the word, ‘fellowship’.  It is sad that the standard of fellowship has been brought terribly low!  It has been brought down to the level of the earth!  It has become so carnal and fleshly.  Fellowship has lost its inherent quality of the heavenly.  It has become so earthy. The standard of righteousness is being eroded by modern theology.  Many are falling prey to the ecumenical spirit in the name of ‘renewal’.  It is totally wrong to invite people who have never been ‘born-again’, to be renewed in the Spirit.  \n\t Many leaders are trying to bring ‘renewal’ to people who are religious, in that they go to church and abide by religious practices and rituals, but are unregenerate in their spirit  Such people need to repent like any other godless person have  to.  There are many a Nicodemus in the pew and pulpit who get caught up with renewal, but first need  be told, “You must be born again.”  Instead, people are taught to meet God in a highly emotional, undisciplined soul dimension, often leading to varying forms and degrees of sensuality.",
		"bible_reading": "Leviticus 27:14-Numbers 1:54 \n Mark 11:1-26 \n Psalm 46:1-11 \n Proverbs 10:23",
		"image_url": "Empty at the moment",
		"today_command": "Be ye therefore ready also: for the Son of man cometh at an hour when ye think not. Luke 12:40"
	},
	{
		"devotion_id":3, 
		"devotion_title":"Title 1",
		"devotion": "Bigness has become a substitute of the true greatness that the Word of God would declare. The whole spiritual world has been taken over by big showmanship. An increasing number of Charismatic and Pentecostal ministries are becoming corrupted by a ‘showmanship’ format, a spirit of entertainment, the use of mass psychology and the Babylonish element of ‘greatness’. Our present form of evangelism and church system is out of focus. Easiness has taken over the Church. Lightness and glamour has come upon the Church. Excitement and emotion seem to be the order of the day. All these horrifying things are a part of the spiritual world, today. Ezekiel, the prophet says, “And ye have not kept the charge of my holy things; but ye have set keepers of my charge in my sanctuary for yourselves.”(Ezekiel 44:8). In the Bible, Balaam is seen as the first ‘hired preacher’. He was hired by King Balak to curse the Israelites. Today Christendom is filled and flooded with hirelings, for whom preaching is a way of earning a wage. God is against such hirelings who pretend to be shepherds and only fleece the sheep. At first, Balaam did not go out because God told him not to go. When Balak offered a higher wage and greater honour to him, he sought ‘God’s will again.’ So, God allowed Balaam to go after money, and honour so that he would destroy himself.",
		"bible_reading": "Numbers 2:1-3:51 \n Mark 11:27-12:17 \n Psalm 47:1-9 \n Proverbs 10:24-25",
		"image_url": "Empty at the moment",
		"today_command": "Be ye angry, and sin not: let not the sun go down upon your wrath: Neither give place to the devil. Ephesians 4:26,27"
	},
	{
		"devotion_id":4, 
		"devotion_title":"Title 1",
		"devotion": "“....stand at the cross roads and look; ask for the ancient paths, ask where the good is and walk in it, and you will find rest for your soul. I appointed watchmen over you and... listen to the sound of the trumpet.”( Jeremiah 6:16, 17). The good way lay in the old paths. Walk therein and ye shall find rest for your souls. But they said, “We shall not walk therein.” The Word says, “harken to the sound of the trumpet.”, but they said, “We will not harken.” This is the mentality and attitude of the majority today. Brothers and sisters, let us seek for those old paths where our fathers walked at one time. We may be living in a modern time, but I want to tell you that God’s voice, in this hour to the His true people, is to ‘‘walk in the old paths wherein our fathers walked’. This is the way we too can fulfil the purposes of God and glorify the name of the Lord. Hallelujah! The way that Abraham walked, the way that Moses took, the way that even David went, after the mind of God, is the way for us. In this time of easiness and cheapness, glamour and emotion, God is telling His people that we need to search the old paths and walk in the purposes of God in His Son, the Lord Jesus Christ. The Lord’s counsel is “Walk therein and ye shall find rest for your souls.”",
		"bible_reading": "Numbers 4:1-5:31 \n Mark 12:18-37 \n Psalm 48:1-14 \n Proverbs 10:26",
		"image_url": "Empty at the moment",
		"today_command": "Distributing to the necessity of saints; given to hospitality. Romans 12:13"
	},
	{
		"devotion_id":5, 
		"devotion_title":"Title 1",
		"devotion": "We may be living in any age, in any time but God’s principles are eternal. Throughout the Bible, womanhood is seen as something very precious and admirable. In the Old Testament, we read about the mothers of Israel. O surely, “woman is the glory of man.” ( 1 Corinthians 11:7). But today, she has lost her rightful place. Woman, who is the glory of man, is no longer in the place of her glory. She lost her place of womanhood because she claims she is equal to man. There are women who will take the Bible and preach that “there is neither male or female” but all are equal. There are certain women who teach that because men have failed, they have been appointed as apostles and prophets by God! Womanhood, in the Bible, is very precious, but that is lost today, because of the philosophies of men. We have to believe that, that which God has declared in His eternal word is the truth. We cannot do things out of convenience. We have to do things from the convictions of our hearts, things which have been wrought by the Spirit of God, as laid down by Him. In His economy, God has a wonderful calling for the sisters. Dear sisters, be careful not to pay any attention to your ungodly neighbours, friends and relatives, who do not know God’s eternal purposes and paths.",
		"bible_reading": "Numbers 6:1-7:89 \n Mark 12:38-13:13 \n Psalm 49:1-20 \n Proverbs 10:27-28",
		"image_url": "Empty at the moment",
		"today_command": "Man shall not live by bread alone, but by every word that proceedeth out of the mouth of God. Matthew 4:4"
	},
	{
		"devotion_id":6, 
		"devotion_title":"Title 1",
		"devotion": "In the physical body of Jesus, there was no trace of the ‘old man’, literally as in the case of believers. Jesus was devoid of the old man of the flesh, but He had a will of His own. He had the self of His own. By which He could have made His own decisions by the faculty of His will. He could have made his own choices according to His mind. But as we had just mentioned, in type and in figure the natural man went out of view in the waters of baptism. There He came into a real consecration, wherein the natural man was put out of sight. The Lord Jesus took a position in the will of God. His position was that nothing shall be in His life that is not of the Father by the Holy Spirit. That is what it means when He said, “not my will but thy will be done” (Luke 22: 42). What we need to realise is that the Son of Man took a real position in the rivers of Jordan. In Him it was wholly true. But in us it is a position that needs to be taken and then made real as we walk in the Spirit. God’s people have to be baptised into His death deep enough in these days. The Church must come into a deeper apprehension of His death and experience it. This is the need of the hour.",
		"bible_reading": "Numbers 8:1-9:23 \n Mark 13:14-37 \n Psalm 50:1-23 \n Proverbs 10:29-30",
		"image_url": "Empty at the moment",
		"today_command": "And as ye would that men should do to you, do ye also to them likewise. Luke 6:31"
	},
	{
		"devotion_id":7, 
		"devotion_title":"Title 1",
		"devotion": "There are two kinds of builders mentioned in Matthew Chapter 7. The two builders, in no way, refer to an unbeliever and a believer. They talk about those who know the Lord. They represent two categories of people, those who do the will of God, and those who do their own will. Jesus said “ Not every one that saith unto me, Lord, Lord shall enter into the kingdom of heaven ;but he that doeth the will of my Father which is in heaven. ( Matthew 7:21). And this He said about thetwo builders, the one who built on the rock and the one who built on mere sand. The two kinds of builders are right here in our midst. One heard the Word and obeyed it in his heart. The other one heard the voice of God but did not bring it into practice, in his life. He did not obey that voice. And that man was likened to the man who built on sand. What he built looked exactly like the building that stood upon the rock. They looked alike on the outside. Both types of believers are found in the church, clapping and raising their hands. Both attend all the camp meetings. But the Scripture says, “And the rain descended” and not if the rains descended. The rains shall surely come despite every favourable forecast by “blessing” preachers. One house fell and the other stood for the Lord.",
		"bible_reading": "Numbers 10:1-11:23 \n Mark 14:1-21 \n Psalm 51:1-19 \n Proverbs 10:31-32",
		"image_url": "Empty at the moment",
		"today_command": "But let none of you suffer as a murderer, or as a thief, or as an evildoer, or as a busybody in other men's matters. 1Pe 4:15"
	},
	{
		"devotion_id":8, 
		"devotion_title":"Title 1",
		"devotion": "“In the days of His flesh he cried with strong cries” (Hebrews 5:5). Why did He do so? It was because He wanted to walk in fellowship with the Father. He never wanted to be separated from the bright presence of the Father. “in the days of His flesh ( Jesus) offered up definite, special petitions (for that which He not only wanted but needed), and supplications, with strong crying and tears, to Him Who was (always) able to save Him (out) from death, and he was heard because of His reverence toward God — His godly fear, His piety (that is, in that Hew shrank from horrors of separation from the bright presence of the Father). (Hebrew 5:5 Amplified Bible). Every time His own will rose up, He cried with a strong cry and said, “Father, I revere your will. I do not want to be separated from your fellowship”. This was the way He became the ‘first-born’. He is our elder brother, our forerunner. He has shown us how to walk in fellowship with the Father. This fellowship with the eternal Son does not seem to be an important matter to many but it is the basis of our very existence in Christ. Let there be a strong cry from our inner man, “Lord Jesus, I do not want to be separated from you.” The answer to all kinds of spiritual problems lies in having a revelation of the call and the Person of the Lord Jesus.",
		"bible_reading": "Numbers 11:24-13:33 \n Mark 14:22-52 \n Psalm 52:1-9 \n Proverbs 11:1-3",
		"image_url": "Empty at the moment",
		"today_command": "Be ye therefore merciful, as your Father also is merciful Luke 6:36"
	},
	{
		"devotion_id":9, 
		"devotion_title":"Title 1",
		"devotion": "In the Old Covenant days the Lord spoke by the prophets in different ways. But His speech is totally different in the New Covenant days. The Amplified version of Hebrews 1: 2 says, “But in the last of these days He has spoken to us in the person of a Son, Whom He appointed Heir and lawful Owner of all things, also by and through Whom He created the worlds and the reaches of space and the ages of time He made, produced, built, operated, and arranged them in order.” He has spoken to us in the person of a Son. He has not spoken “through His Son”, but He speaks to us “by his Son”, “in His Son”, “in the person of a Son”. In these last days, the Lord is speaking to us IN the Person of His Son. If only we could understand this we would be quick to realise that is an enormous and a tremendous thing. It means God is not speaking to us about His son. He is not giving us a doctrine or a teaching. He is speaking to us IN the person of His Son. We must allow that to sink into the depths of our being so that we may fully be apprehended by it. Beloved, it is in Him, in Christ that God speaks.",
		"bible_reading": "Numbers 14:1-15:16 \n Mark 14:53-72 \n Psalm 53:1-6 \n Proverbs 11:4",
		"image_url": "Empty at the moment",
		"today_command": "Salute all them that have the rule over you, and all the saints. Hebrews 13:24"
	},
	{
		"devotion_id":10, 
		"devotion_title":"Title 1",
		"devotion": "The apostle Paul says, “And without controversy great is the mystery of godliness: God was manifest in the flesh”. (1 Tim 3:16). When Jesus was here upon the earth, He was a great mystery. What was the mystery? The mystery concerned Jesus, the man, moving in the flesh, subject to passions of man, and yet He was the ‘heir of all things’. Do you see the enigma of it all? While He was here, upon the earth, in the human body, He was appointed to be the ‘heir of all the universe’ by the Father. This was the mystery that puzzled every man. The Heir, the eternal Inheritor stood before man and yet man was not able to see Him. Praise be to the name of the Lord! The truth must go beyond the mental knowledge and intellect of man and be registered in the spirit of man. Today, this Jesus is still a mystery and a hidden truth for many. Though there are many Christians who confess that Jesus is Lord, they are yet to recognise and acknowledge this Jesus.The eternal mystery remains an enigma for them and needs to be unfolded and revealed. Jesus was the manifestation of the Creator in the midst of the creation.",
		"bible_reading": "Numbers 15:17-16:40 \n Mark 15:1-47 \n Psalm 54:1-7 \n Proverbs 11:5-6",
		"image_url": "Empty at the moment",
		"today_command": "Nevertheless, whereto we have already attained, let us walk by the same rule, Philippians 3:16"
	},
	{
		"devotion_id":11, 
		"devotion_title":"Title 1",
		"devotion": "My life was once shattered and broken. It had no meaning. It was empty and barren. Praise the Lord that one-day, He came into my life and put all things in order. I know one thing that He is holding me together. My life will disintegrate the moment He leaves me. The reason why many are miserable, filled with loneliness and pain, is because Jesus is on the outside of their lives, and not on the inside. Jesus holds all things together in our lives and in the lives of our families. The integration in our lives comes from our union with Christ. All around us, there are people who are disillusioned, disappointed, dissatisfied and scattered in their lives. Multitudes have put Jesus outside their lives and neglected the only One who can hold their lives together. Beloved, your family life can be changed; God can do a new work of integration and harmony in your family; you too can experience an elemental constituting within, by the Heir of all things provided He is given His rightful place in your family. Let us hold fast to this Saviour, who holds all things together. Let Him hold everything together in your life.",
		"bible_reading": "Numbers 16:41-18:32 \n Mark 16:1-20 \n Psalm 55:1-23 \n Proverbs 11:7",
		"image_url": "Empty at the moment",
		"today_command": "Suffer little children, and forbid them not, to come unto me: for of such is the kingdom of heaven. Matthew 19:14"
	},
	{
		"devotion_id":12, 
		"devotion_title":"Title 1",
		"devotion": "“The full soul loatheth an honeycomb; but to the hungry soul every bitter thing is sweet” (Proverbs 27:7) This verse is true in the lives of many believers today. The word of God is loathsome to them. Some people ask me, “Why are you repeating the same things.” I often feel sad for them. They do not see the poverty of their spirit! They think that hearing is ‘knowing’. Saints of the Most High, hearing is not knowing! Hence, we must move carefully not just hearing words but weighing them. Beloved, we must weigh each word, because, God always weighs everything. It is the Holy Spirit who has to work in our lives and we must give Him time and space to do so. The Spirit knows what is standing against the name of Jesus in our lives. Sometimes we are tempted to only read familiar portions in the Bible. This is the way we get deceived and fail to understand the truth or catch what the Spirit is saying behind the words. Beloved, we need to weigh every word carefully. We have to weigh them. God always weighs everything. He always looks at them in line with His eternal purposes.",
		"bible_reading": "Numbers 19:1-20:29 \n Luke 1:1-25 \n Psalm 56:1-13 \n Proverbs 11:8",
		"image_url": "Empty at the moment",
		"today_command": "In your patience possess ye your souls. Luke 21:19"
	},
	{
		"devotion_id":13, 
		"devotion_title":"Title 1",
		"devotion": "The Word of God, f rom the beginning to the end, conspicuously declares one important fact, that God always looks for a place of rest for Himself. He has been looking for a place that satisfies His heart from the very beginning. In the book of Genesis, we however read that as soon as God began to rest in His creation, there was someone who didn’t like it! Yes, almost immediately the forces of evil came against and opposed the rest that God had found in His own creation!! Right from that time there has been a battle concerning God’s rightful place of rest in His creation. This eternal issue highlights two things. Firstly, God is ever and always seeking for a place where He can be satisfied and where he could rest. He desires to have a place where His presence would be unchallenged. He desires to have a place where His presence would be accepted without any controversy. Secondly, there is a perpetual conflict raging in the realms of the cosmic. This conflict is directed against all that God wants to establish upon the earth. The Bible is full of accounts of this dispute of God’s right to have a place of rest here. God has always wanted to have a place where the name and the glory of His Son would be manifested, and where He would be able to rule and reign as the undisputed King.",
		"bible_reading": "Numbers 21:1-22:20 \n Luke 1:26-56 \n Psalm 57:1-11 \n Proverbs 11:9-11",
		"image_url": "Empty at the moment",
		"today_command": "Let us walk honestly, as in the day; not in rioting and drunkenness, Romans 13:13"
	},
	{
		"devotion_id":14, 
		"devotion_title":"Title 1",
		"devotion": "The whole Bible is filled with accounts of people that heard the call. Some heard and responded, and went on with God. Some heard the call and made a response but turned aside from that call later on. Nevertheless, God did not stop, but moved on. Then again, others heard the call of God, but hesitated to make any decision. They began to reason and weigh things. They found it was a costly decision, and therefore, they refused to go on. Nevertheless, God went on. These three categories of people are clearly distinguishable throughout the Bible. The Old Testament history is full of these categories of people. Many people in the past have missed this call and many continue to miss the call, but God has been gradually collecting a people through the ages. He is slowly but steadily gathering and collected a people. He is forming a people of His call. He is still collecting a people in the earth. He is calling a people into fellowship in His Son. Glory to God! He is not calling people into some man-made association. At different places people are being called unto the Son. We are being called to align our lives with the eternal purposes of God, in His Son, Christ Jesus.",
		"bible_reading": "Numbers 22:21-23:30 \n Luke 1:57-80 \n Psalm 58:1-11 \n Proverbs 11:12-13",
		"image_url": "Empty at the moment",
		"today_command": "Know ye not that they which run in a race run all, but one receiveth the prize? So run, that ye may obtain. 1 Corinthians 9:24"
	},
	{
		"devotion_id":15, 
		"devotion_title":"Title 1",
		"devotion": "The God of glory appeared unto Abraham. The call of God gripped Abraham from that very moment, in the Ur of the Chaldees, where Abraham worshipped idols. Abraham met the Living God right there. This Eternal God met him. Abraham could distinguish the eternal God from among all other gods whom he worshipped. He distinguished a voice, a person, that settled the whole matter of relationship with all other god’s that he was accustomed to worship. He was drawn to one focus, to the God of glory, not just a god who is in glory but who is the God of Glory. God of glory is one thing and a god who is in glory, is another thing. The God of Glory talks of God who is glorious in His very being and who has glory at the end as His object! God brings those whom He has called ultimately into that very glory. When Abraham heard this call he responded to it without delay. I do not know how this call was conveyed; may be it was done in some strange and inexplicable way. I am convinced that Abraham, somehow, came to know that this call was related to God’s Son. In John 8:56 we read, “Your father Abraham rejoiced to see my day: and he saw, and was glad.”",
		"bible_reading": "Numbers 24:1-25:18 \n Luke 2:1-35 \n Psalm 59:1-17 \n Proverbs 11:14",
		"image_url": "Empty at the moment",
		"today_command": "Watch ye, stand fast in the faith, quit you like men, be strong. 1Corrinthians 16:13"
	},
	{
		"devotion_id":16, 
		"devotion_title":"Title 1",
		"devotion": "Acts 13:27 tells us that for hundreds of years, on every Sabbath day the words of the prophets were read in the midst of God’s people. The statement made therein is a very astonishing and arresting one and in itself becomes a message and a warning from the prophets. It says in very precise terms that the ‘prophets’ were read in the temple at Jerusalem; they were read in various synagogues; and they were read far and wide for the hearing of God’s people. And all the while, the Scriptures were heard through the mouths of priests and synagogue leaders! The Scriptures were read out with one intention—that through the mouths of those who read out the Scriptures, the people would in fact hear what the prophets spoke. But what happened was that the rulers and the people missed the ‘voices of the prophets’ through what was being read. The words, the Scriptures, and the sounds, were heard, times without number, whenever the people assembled together; but the 'voices of the prophets' went unheard, undiscerned and undetected. What a tragedy! The vital message of the prophets went unheard and was of no avail. The whole purpose of their coming together, to detect and discern His voice through the prophets was nullified.",
		"bible_reading": "Numbers 26:1-51 \n Luke 2:36-52 \n Psalm 60:1-12 \n Proverbs 11:15",
		"image_url": "Empty at the moment",
		"today_command": "Fear not therefore: ye are of more value than many sparrows. Luke 12:7"
	},
	{
		"devotion_id":17, 
		"devotion_title":"Title 1",
		"devotion": "I am sure that many of God’s people are guilty of not hearing the voice of the Lord, though they have heard a message or a teaching. Beloved, it is not a matter of our intelligence; for our spiritual life does not depend on our intellectual ability. Our intellect can not save us, nor can it help us to further our spiritual lives. It is not a matter of our education, our intelligence or our mental capacities. Spiritual life is one of conception. You are a Christian, a child of God by conception and not by education or by instruction. Your spiritual life has been initiated by God; we are born from above as children of God; it is a work of the Spirit and not of the intellect or of the ability of man. “ But as many as received Him, to them He gave the right to become children of God, to those who believe in His name: who were born, not of blood, nor of the will of the flesh, nor of the will of man, but of God.” ( John 1:12-13) Therefore, our growth and progression must also come through His Spirit and His Word. None of us can ever educate someone to become a Christian! Our birthing, our growth and subsequent progression is a work of the Spirit and the Word. The Holy Spirit uses the Word to produce this life in us initially, and subsequently as well.",
		"bible_reading": "Numbers 26:52-28:15 \n Luke 3:1-22 \n Psalm 61:1-8 \n Proverbs 11:16-17",
		"image_url": "Empty at the moment",
		"today_command": "Children, obey [your] parents in all things: for this is well pleasing unto the Lord. Colossians 3:20"
	},
	{
		"devotion_id":18, 
		"devotion_title":"Title 1",
		"devotion": "Everything hangs upon one thing—the place and measure given to Christ. That is what is important in the eyes of the Lord. There are many issues before us—problems of various kinds, weaknesses, and infirmities. There are a multitude of things in us which are not in consonance with the perfect will of God and with God’sWord, yet the most important issue is the place and the measure that Christ has in our lives. That is the most important issue in the eyes of the Father. The eternal God can forgive all sins however bad or terrible they may be. Every sin under the sun can be forgiven by God. However, there is one sin which the Father can never forgive, and for which there is no provision in God’s economy: that is the rejection of the Son. So, the place and the measure of the Son is what the Father looks for in everything. Everything is going to be judged by this measure. We read in the book of Acts “Because he hath appointed a day, in the which he will judge the world in righteousness by that man whom he hath ordained; whereof he hath given assurance unto all men, in that he hath raised him from the dead” (Acts 17:31).",
		"bible_reading": "Numbers 28:16-29:40 \n Luke 3:23-38 \n Psalm 62:1-12 \n Proverbs 11:18-19",
		"image_url": "Empty at the moment",
		"today_command": "Examine yourselves, whether ye be in the faith; prove your own selves. 2Corrinthians 13:5"
	},
	{
		"devotion_id":19, 
		"devotion_title":"Title 1",
		"devotion": "There comes a time when the more we hear, the more we are unable to really hear the Lord and His Spirit! As Apostle Paul says “Ever learning, and never able to come to the knowledge of the truth” (2 Tim. 3:7) Let us note that the failure and its consequences referred to in Acts 13 were not because the prophets were not faithful, but because their teachers and leaders were unfaithful and sought after personal gains! God had His true prophets speaking His voice in the midst of those prophets who went after their own gain. Let me illustrate this with the example of a child at school. If a child is not doing well in studies, one cannot always put the blame on the teacher! It could be that some teachers were not good enough or not dedicated enough. Failure could also be attributable to a lazy, indolent, careless and rebellious child. Though there would always be some teachers who would be sincere and committed, the fact is that the best and most hardworking teacher could also be prone to failures and limitations. The blame rested squarely upon the hearers!",
		"bible_reading": "Numbers 30:1-31:54 \n Luke 4:1-30 \n Psalm 63:1-11 \n Proverbs 11:20-21",
		"image_url": "Empty at the moment",
		"today_command": "This I say then, Walk in the Spirit, and ye shall not fulfill the lust of the flesh. Galatians 5:16"
	},
	{
		"devotion_id":20, 
		"devotion_title":"Title 1",
		"devotion": "In Jeremiah, we find a man, a servant of the Lord, who shared the sorrow and the pain of the Lord! Here was a man who was drawn to the Lord and came so near to Him that he could have close fellowship with the Lord. He went the unpopular way and stands as an example to encourage every man who would care to embrace the ostracized way; for he was one who ploughed alone, away from everyone else. In these days, not many people choose to plough the lonely field or go into that which is known as unpopular. But praise God there are some - not many, but some - who refuse to be a part of that which others find good and pleasant.There are but a few who are willing to plough alone and keep themselves away from the fields of popular Christianity. They feel called to stand against the strong currents of the evangelical and charismatic world, and therefore - they choose to go it alone, though it would mean much suffering and rejection. People do not want to stand and bear an unwelcome testimony in this hour. They are more concerned about their personal testimony and their ministry, than the testimony of the Lord Jesus Christ.",
		"bible_reading": "Numbers 32:1-33:39 \n Luke 4:31-5:11 \n Psalm 64:1-10 \n Proverbs 11:22",
		"image_url": "Empty at the moment",
		"today_command": "Let your moderation be known unto all men. The Lord [is] at hand. Philippians 4:5"
	},
	{
		"devotion_id":21, 
		"devotion_title":"Title 1",
		"devotion": "Today the church persuades and challenges God’s people to labor and work hard for the Lord. The emphasis in churches all around is on service and upon doing some work for the Lord, whereas the Lord is more concerned about His testimony. The seven churches in Revelation were judged in the light of His testimony. These churches were brought into existence to bear the light of His testimony. They were constituted to this end. But when they failed to bear His testimony, when there was no moral and spiritual ground for their continuation, the verdict of the Lord then came upon them! Has God changed the standard of His judgments for us today? No, He has not! The people of God today have lost the purpose of their salvation. Churches have become a platform for social work and a stage for political and other activities which seem good and favourable in the eyes of man. Looking around, we see that the Church is least concerned about the testimony of Jesus Christ: they are concerned more about their own ministry, their own name, and their own kingdoms!",
		"bible_reading": "Numbers 33:40-35:34 \n Luke 5:12-28 \n Psalm 65:1-13 \n Proverbs 11:23",
		"image_url": "Empty at the moment",
		"today_command": "Fight the good fight of faith, lay hold on eternal life, whereunto thou art also called, 1 Timothy 6:12"
	},
	{
		"devotion_id":22, 
		"devotion_title":"Title 1",
		"devotion": "The cost we have paid in the past is no guarantee that we shall not become compromisers or withdraw under pressure. The cost, the pain, the sorrow, the losses we have incurred will not help us to stand as un-compromisers, in this hour. Many men of God who made great sacrifices in the past are now living in compromise. The sacrifices they made in the past could not guarantee them a safe and secure life; the good feelings they had after they had made sacrifices unto the Lord could not help them stand before God without guilt and blame. Consider the lives of Saul, Jonathan and many others who had obeyed the Lord at one time but later they compromised and fell away from their commitments.Their enemies pinned their bodies on the walls of Bethshan (1 Sam. 31:12)! They fought against God’s enemies at one time; but they died in disgrace and the Lord was not with them. Many times we think that because we are on God’s side fighting His enemies, we will not compromise or withdraw from this calling and purpose later. This attitude is totaly wrong. History has repeatedly shown this to us. The obedience, the sacrifices, the good deeds, and the devoted works we may have had in the past are no guarantee for today. The sacrifices of yesterday are no excuse for compromising today.",
		"bible_reading": "Numbers 36:1-Deuteronomy 1:46 \n Luke 5:29-6:11 \n Psalm 66:1-20 \n Proverbs 11:24-26",
		"image_url": "Empty at the moment",
		"today_command": "But speak thou the things which become sound doctrine Titus 2:1"
	},
	{
		"devotion_id":23, 
		"devotion_title":"Title 1",
		"devotion": "I would like to specially warn young brothers and sisters of the second generation, whose parents know the Lord and who have heard this truth and are walking in it. If these young ones want to walk in the ways of their parents, they need to be prepared to pay a price. If they were privileged to hear the counsel of God and the 'voices of the prophets' during their childhood and in their teens, they need to now demonstrate it through their lives. Their lives must not stand in contradiction to whatever they have heard in the House of God. And here is the sorrow of His love! Countless children have not had the privilege they have had. Therefore, they need to go out of their way to establish and prove this by the kind of lives they live and the testimony they hold. They need to realize the demands of this call upon their lives. They could have wasted their lives elsewhere, but God in His mercy had something better for them. When Jeremiah was yet in his youth, he opened his life to the Lord; the same goes for Samuel the prophet. This call would place you in a path that is unpopular; it will bring you no fame or riches; it is not a path where you will get a great name; and few will be your companions, but it is a path that will please the Lord. So there is a need for each one of you to be open to the voice of God in this crucial time.",
		"bible_reading": "Deuteronomy 2:1-3:29 \n Luke 6:12-38 \n Psalm 67:1-7 \n Proverbs 11:27",
		"image_url": "Empty at the moment",
		"today_command": "And let ours also learn to maintain good works for necessary uses, that they be not unfruitful. Titus 3:14"
	},
	{
		"devotion_id":24, 
		"devotion_title":"Title 1",
		"devotion": "Jeremiah knew that his ministry would be intensely painful. He was called to root out, to pull down, to destroy and to throw down—but also to build and to plant. Today, everybody expects his ministry to take off smoothly, without a hitch. They want to enlarge their ministry in a short span of six months. They could begin with a small group of twenty people, but within six months they would like to show that their ministry has expanded to a thousand! In other words, every ministry is eager to build and to plant, but nobody wants to first root out, pull down and to destroy. Remember, something worthwhile can only be built after there has been a tearing down. But who is willing to accept such a ministry? To root out, to pull down and to destroy is an unpopular way! It is only after things have been pulled down and rootedout that something after the mind of God can be built! It is easy to build a ministry on the lines of man’s designs for it will not attract any opposition, reproach or rejection. Saints, many things are happening in Christendom, but God is looking for a body in the earth, a people who will be a prophetic voice in this age.",
		"bible_reading": "Deuteronomy 4:1-49 \n Luke 6:39-7:10 \n Psalm 68:1-18 \n Proverbs 11:28",
		"image_url": "Empty at the moment",
		"today_command": "Cast not away therefore your confidence, which hath great recompence of reward. Hebrews 10:35"
	}, 	
	{
		"devotion_id":25, 
		"devotion_title":"Title 1",
		"devotion": "Outward worship was rampant in the days of Jeremiah. People came to the house of the Lord and said, “This is the temple of the Lord; this is the temple of the Lord.” The more they said this, the more spiritual they felt. The vital application of the word and its inner conviction were lost. They thought they had become more spiritual because they gave themselves to ritualistic forms of worship. But the Lord said that He would burn down the house of God because His people were worshipping God with hearts that were insensitive and deceptive. Unfortunately, by and large, worship is no different these days. People of God have become so ‘religious’ that the vital application of spiritual things to their lives has been totally lost. This is a very dangerous state to be in! So we see that in Jeremiah’s days, religion went into one pocket and the vital application to life went through a hole in the other! The Lord said: “They have forsaken me, the fountain of living water, and have hewn them out cisterns, broken cisterns, which can hold no water.” Human substitutes for the Lord and His principles; are in plenty today, but they are broken and cannot hold water for long!",
		"bible_reading": "Deuteronomy 5:1-6:25 \n Luke 7:11-35 \n Psalm 68:19-35 \n Proverbs 11:29-31",
		"image_url": "Empty at the moment",
		"today_command": "My brethren, have not the faith of our Lord Jesus Christ, [the Lord] of glory, with respect of persons. James 2:1"
	},
	{
		"devotion_id":26, 
		"devotion_title":"Title 1",
		"devotion": "Let me caution you to be careful not to embrace the principles of this world in the matter of marriage. Keep your heart open to the Lord and His word. Paul’s counsel to Timothy and to those who have entered the ministry is to flee from youthful lusts. But the unfortunate thing is that many young people are looking for job opportunities in the very places from where they need to flee! Saints, the choices open to believers are few and far between in this world. Many who are living in compromise have fallen over the cliff of immorality. Where is the preacher of righteousness such as Noah of old? We need such men today. When young people come with fond ideas of having jobs in places that are circumspect and seek the prayers of elders, we need men who can counsel them to flee from such places. But instead, we have leaders to bless them and pray for their success! What a compromise! Where is the leader who will openly deny them prayer support, correct them and tell them to give up any thought of working in places where they could easily lose their moral character and values? It is sad that many leaders and even parents are numb towards these crucial moral issues. Bigger pay packets and perks have blinded the eyes and hardened the lives of many believers!",
		"bible_reading": "Deuteronomy 7:1-8:20 \n Luke 7:36-8:3 \n Psalm 69:1-18 \n Proverbs 12:1",
		"image_url": "Empty at the moment",
		"today_command": "I beseech you as strangers and pilgrims, abstain from fleshly lusts, which war against the soul; 1 Peter 2:11-12"
	},
	{
		"devotion_id":27, 
		"devotion_title":"Title 1",
		"devotion": "Success has become a dominating feature of ministry; profitmaking and commercial gain has taken the front bench. Religious channels in TV provide ample evidence of the commercial obsession that is binding God’s people. Their programmes reflect a satanic twist and distortion that many are unable to discern. Many preachers and leaders talk about prosperity, materialism, and wealth to the exclusion of other important spiritual matters. It is no more Christ-likeness and His nature that makes this sinsick world turn to the living God! On TV, I heard a preacher sermonize, “If you are not rich, God will not be glorified; you would not glorify your God!” Such people insist that material prosperity and material advancement are a sign of God’s blessing upon our lives. Satan has convinced them that prosperity and success are a token of God’s approval of our lives. Therefore, their successes and gains have turned people away from the call to follow the living Lord. Apostle Paul warns the New Testament believers about this very thing. That which they call success has turned them away from desiring to be near the Lord. In their love for material success, many preachers have lost their anointing. The overriding need for success has sapped the spiritual growth of many people.",
		"bible_reading": "Deuteronomy 9:1-10:22 \n Luke 8:4-21 \n Psalm 69:19-36 \n Proverbs 12:2-3",
		"image_url": "Empty at the moment",
		"today_command": "Let all bitterness, and wrath, and anger, and clamour, and evil speaking, be put away from you, with all malice: Ephesians 4:31"
	},
	{
		"devotion_id":28, 
		"devotion_title":"Title 1",
		"devotion": "We see the seeming failure of the Lord’s earthly life and labour. To many people as far as the Lord’s labour was concerned, it seemed that His life was a failure. He was “crucified through weakness.” (2 Cor. 13:4); He was deserted by the people; He was forsaken by one and all. His disciples ran for their lives. When we see His life from this angle, it seems that His earthly life and labour resulted in nothing but failure. But the Father in Heaven raised Him up and gave Him a name and a place on the throne. The Father vindicated His life and His labour. What looked like failure and loss has been vindicated over and through many centuries. The Father gave Him a name and a throne vindicating all the work of His hands. And through the centuries we see that His name has been upheld and magnified, though it was rejected and discarded in His time. And it will go on and on unto all eternity! However, the reality is that He did not see the fruit of His labour during His days upon the earth! He did it all for a time to come. As the Hebrew writer says, “who for the joy that was set before him endured the cross, despising the shame, and is set down at the right hand of the throne of God.” (Heb. 12:2).",
		"bible_reading": "Deuteronomy 11:1-12:32 \n Luke 8:22-39 \n Psalm 70:1-5 \n Proverbs 12:4",
		"image_url": "Empty at the moment",
		"today_command": "So speak ye, and so do, as they that shall be judged by the law of liberty. James 2:12"
	},
	{
		"devotion_id":29, 
		"devotion_title":"Title 1",
		"devotion": "We see in Apostle Paul’s life and ministry the desertion, the forsaking, the discrediting and the discounting that marked the closing days of his earthly course! Towards the end of his ministry, we read, “all they which are in Asia be turned away from me” (2 Tim. 1:15). People discredited his ministry; he faced rejections and reproach. His closing days were marked by these incidents of desertion and discarding. Many people forsook him; and the churches began to depart from the reality to which they were brought in by the apostle. The churches were on the decline, and many people abandoned them. When we read the Scriptures and also the history of God’s people, we see a galaxy of lonely heroes of faith who compose the noble army of “despised and rejected men”. Whether their lives were a failure or a success did not matter; their burden was to do God’s will, and to bear a testimony of the Lord Jesus Christ in their generation. Such is the army of the eternal God. They were men who were rejected and despised by the world. Their ministry and labour involved a lot of sacrifice, suffering and personal loss. The verdict of men in their lifetime was, “This man served no purpose; this man was of no use; he served in no profitable way.”",
		"bible_reading": "Deuteronomy 13:1-15:23 \n Luke 8:40-9:6 \n Psalm 71:1-24 \n Proverbs 12:5-7",
		"image_url": "Empty at the moment",
		"today_command": "Purge out therefore the old leaven, that ye may be a new lump, as ye are unleavened. 1Corrinthians 5:7"
	},
	{
		"devotion_id":30, 
		"devotion_title":"Title 1",
		"devotion": "I am truly burdened to bring a certain word that the Lord is prompting me to speak. As long as we walk in the way of the Lord, in this narrow path and in this call of God where we are called to be a testimony of the Lord, then no one need to question our lives. As long as we are in step with the mind of God, hearing God’s word and the 'voices of the prophets', and walking in it as well, no one needs to come and tell us anything. Nobody needs to tell one anything. But the necessity arises only when we side step, when our priorities are jumbled up, when our lives are not in line with our calling, when our lives are contrary to the very purpose of God, then one needs to hear a voice to tell us how to return to the paths of the Lord. Whether we are involved in ministry or some work of the Lord, or as members of a local church, we need help at such times. That is why God has a divine arrangement over our lives, and places us in a living body of believers. The voice comes to us from God to show us how to align our lives with the call of God upon our lives. Let us not be offended at hearing these things. It is not a good sign if one is offended by the word of correction. A heart of offence shows that there is a hardness that has set in. Hardness sets in when we are offended by the word of correction in the house of God.",
		"bible_reading": "Deuteronomy 16:1-17:20 \n Luke 9:7-27 \n Psalm 72:1-20 \n Proverbs 12:8-9",
		"image_url": "Empty at the moment",
		"today_command": "Be not children in understanding: howbeit in malice be ye children, but in understanding be men. 1 Corinthians 14:20"
	}
	
]