[
	{
		"devotion_id":0, 
		"devotion_title":"Title 0",
		"devotion": "God gave Ezekiel a burden concerning the glory of God.  He gave him a vision about a temple of God that was in some ways representative of the ultimate place of man in the purposes of God.  Ezekiel was able to see, albeit in a symbolic and allegorical manner, that the temple of God would finally be a corporate body of men wherein would dwell the fullness of God.  The whole concept of the glory of God dwelling in a temple not made by human hands was far beyond the understanding of any man in the Old Testament.  But there was one whom God called ‘son of man’ whom He chose, commissioned, clothed and enlarged to even receive visions of the corporate new man in all his glory.  When the prophet says the throne of God he also says ‘the likeness of the appearance of man above upon it’ (Ezekiel 1:26).  Apostle John, Ezekiel’s New Testament counterpart, also saw a similar vision; “… in the midst of the seven candlesticks one like unto the Son of man…” (Revelation 1:13) \n\t There is little mentioned about him as a person in the Bible.  There is nothing strange in this.  God’s purpose is that we see not the ‘self’ of the prophet but rather that our attention be drawn to Him who possesses the prophet.  Ezekiel was a true ‘vessel of honor’",
		"bible_reading": "Isaiah 62:6-65:25 \n Philippians 2:19-3:3 \n Psalm 73:1-28 \n Proverbs 24:13-14",
		"image_url": "Empty at the moment",
		"today_command": "knock and the door will be opened to you. – Matthew 7:7"
	},
	{
		"devotion_id":1, 
		"devotion_title":"Title 1",
		"devotion": "Are some of His people still looking for discounts?  No discounts are available in this search for the burden of the Spirit.  We will miss many opportunities and waste a lot of time if we seek for shortcuts and discounts!  God is a rewarder of them that seek Him diligently.  In seeking Him we shall also behold what is upon His heart.  We will be drawn to Him by something that will hold us inwardly, saints of God. God draws us, not so that we may be able to preach a message or make a name for ourselves, but He draws us to Him day and night so that we may know and share what is upon His heart.  If something is holding you inwardly in suspense as it were these days, the reason is that you may discover and know what is upon the heart of God.  Many people remain unchanged because they are still loitering around the bargaining table, reasoning and justifying for all they are worth.  There are so many good spiritual things that you can always acquire, but to know what is upon the heart of God requires a deep searching, waiting and travail.  Remember what Jesus said in John 12:8, “For the poor always ye have with you; but me ye have not always.”  He was talking about the commonplace vis-à-vis the real treasure.  God is gathering a people who will go after the real treasure, the heart of God.",
		"bible_reading": "Isaiah 66:1-24 \n Philippians 3:4-21 \n Psalm 74:1-23 \n Proverbs 24:15-16",
		"image_url": "Empty at the moment",
		"today_command": "    Be on your guard against the yeast of the Pharisees and Sadducees. – Matthew 16:5"
	}, 	
	{
		"devotion_id":2, 
		"devotion_title":"Title 2",
		"devotion": "“And the anger of the LORD was kindled against Uzza, and he smote him, because he put his hand to the ark: and there he died before God.  And David was displeased, because the LORD had made a breach upon Uzza: wherefore that place is called Perezuzza to this day. And David was afraid of God that day, saying, How shall I bring the ark of God home to me?” (1 Chron13:10-12).  David was greatly displeased.  David was angered and offended because of what God had done to Uzza for he died on the spot.  Most of us are well aware that when God deals with us in our situations, we often get offended with God.  God’s dealings with us often bring about a controversy between us and the Lord.  And until we deal with that blockage, that attitude in us in that situation, nothing further happens – any onward move is difficult and gets held up.  That is what happened here.  The whole move of God was suspended until the controversy between David and the Lord had not been settled.  As a result, David could not bring the Ark back to Jerusalem.  Instead, he had it kept in the house of Obededum, the Gittite.  How often God’s people are found to be careless in this area!  Most of the time we are insensitive to God’s need!",
		"bible_reading": "Jeremiah 1:1-2:30 \n Philippians 4:1-23 \n Psalm 75:1-10 \n  Proverbs 24:17-20 ",
		"image_url": "Empty at the moment",
		"today_command": " Bear ye one another's burdens, and so fulfil the law of Christ. Galatians 6:2"
	},
	{
		"devotion_id":3, 
		"devotion_title":"Title 0",
		"devotion": "John was “carried away in the Spirit” to a great and high mountain.  Spiritually all this means is that he was alive in the Spirit.  I would like to underline that phrase – alive in the Spirit.  When the Holy Spirit took him to a great and high mountain, he was alive in the Spirit.  In spiritual terms it simply means that at that time John was fully alive to the Spirit.  Physically, John was on the island of Patmos, but in the spirit he was on a high mountain.  He was not physically lifted to a high mountain, nor did he escape his captivity in Patmos. Had it been so, the Roman Empire would have spared no effort to search him out. John did not go anywhere physically. No never. To be alive in the Spirit is a spiritual expression that talks of an experience that John had in the spirit.  It might be that John had a vision, but this much is certain that it was not something natural or physical.  John had a true, genuine spiritual experience! In the natural this is akin to having a dream.  Physically one does not go anywhere in a dream, yet one has a feeling of going somewhere.  This is truer in the spiritual realm where one may not go anywhere physically, and yet the Spirit can take one into divine realms to show heavenly things which are absolutely real, true and eternal!",
		"bible_reading": "Jeremiah 2:31-4:18 \n Colossians 1:1-17 \n  Psalm 76:1-12 \n Proverbs 24:21-22",
		"image_url": "Empty at the moment",
		"today_command": " Wherefore he saith, Awake thou that sleepest, and arise from the dead, and Christ shall give thee light.  Ephesians 5:14"
	},
	{
		"devotion_id":4, 
		"devotion_title":"Title 0",
		"devotion": "“And the LORD said unto him, Go through the midst of the city, through the midst of Jerusalem, and set a mark upon the foreheads of the men that sigh and that cry for all the abominations that be done in the midst thereof.” (Ezekiel 9: 4). This is the picture of the One who stands amidst His churches and marks the faithful upon their foreheads (Revelation 20:4). In one hand he carries a marking device or an implement (writer’s inkhorn). And he identifies the remnant, the godly fragments, who sigh and cry when they see the great wickedness that persists amongst God’s people. God always has a faithful remnant unto Himself. He spares them and protects them amidst all the unrighteousness. And to them He grants honor to eventually fulfill the purposes upon His heart. There were a few faithful Jews, even in those days, who washed their robes, and made them white in the ‘blood of the Lamb’ (Revelation 7:14).  The Spirit of God is brooding and roaming through the churches of today for there are still godly men and women who lament, weep and sigh over the abominations amongst God’s people. God is separating such ones who deplore and mourn with sorrow over the sinfulness of half-hearted Christians; those who have become immune to the workings and promptings of the Holy Spirit.",
		"bible_reading": "Jeremiah 4:19-6:15 \n Colossians 1:18-2:7 \n Psalm 77:1-20 \n Proverbs 24:23-25 ",
		"image_url": "Empty at the moment",
		"today_command": " We then, as workers together with him, beseech you also that ye receive not the grace of God in vain.  2 Corinthians 6:1"
	},
	{
		"devotion_id":5, 
		"devotion_title":"Title 0",
		"devotion": "“Who in the days of his flesh, when he had offered up prayers and supplications with strong crying and tears unto him that was able to save him from death, and was heard in that he feared; (Hebrews 5:7).   The Lord had a reverential fear of the Father for the fulfillment of the purposes of God.  That is how the Son of Man lived upon the earth.  In His heart He feared any kind of separation from the Father.  The Spirit of the fear of the Lord was upon Him, restraining Him from doing anything that would lead to defilement and separation from the Father.  He walked every day in total submission to the Father’s will.  He humbled Himself, suffered, and obeyed the Father because He had a reverential fear in His heart in the love of the Father.  Jesus had the Spirit of the fear of the Lord in unlimited measure.  In Romans 8: 35 to 37, Paul talks about the love of God.  He says that no one can separate God’s people from the love of God in Christ Jesus.  He says that we are more than conquerors through Him who loves us.  It is in and through this love that we can become conquerors! Where there is such a love of God there will also be a true reverential fear of God.  You will indeed be a conqueror!",
		"bible_reading": "Jeremiah 6:16-8:7 \n Colossians 2:8-23 \n Psalm 78:1-31 \n Proverbs 24:26",
		"image_url": "Empty at the moment",
		"today_command": "For if God spared not the natural branches, take heed lest he also spare not thee.  Romans 11:21"
	},
	{
		"devotion_id":6, 
		"devotion_title":"Title 0",
		"devotion": "Many people desire to know God’s will, but they cannot know it because their spirit is not alive to the Spirit of God.  If your spirit is alive to the Holy Spirit in your daily life, God will reveal His mind and His will to you.  It is a great tragedy that the majority of believers are not alive in their spirit to the Holy Spirit when the Spirit wants to do something in their lives.  May the Lord help us to lay this principle as a foundation in our lives so that as God’s remnant we would be always actively alive in our spirit to the Holy Spirit! The lives of great men of God, who walked in step with God in their generation, seem great and wonderful to us today because they were people who lived in God’s presence, aligned and tuned to the mind of the Spirit.  Often we desire to be like them and even pray that our lives may follow the pattern of their lives, but we fail to align our lives to that which is of the Spirit as they did.  Is there a spiritual principle that will help us to come into their level of a higher life with God?  What should we do to enter into that higher realm and place in God? Remember that anything can turn out to be dead if your spirit is not aligned to the Spirit of God at that given time.",
		"bible_reading": "Jeremiah 8:8-9:26 \n Colossians 3:1-17 \n Psalm 78:32-55 \n Proverbs 24:27 ",
		"image_url": "Empty at the moment",
		"today_command": " Neither let us tempt Christ, as some of them also tempted, and were destroyed of serpents. 1Corrinthians 10:9"
	},
	{
		"devotion_id":7, 
		"devotion_title":"Title 0",
		"devotion": "“And he carried me away in the spirit to a great and high mountain”.  (Rev 21:10).  There is a spiritual principle here that is very vital for us today.  Many times we have a desire to reach out to the heights in God, but find that our sincere desires are not enough to meet our needs.  What the Lord reveals to you depends on how high you have climbed the mountain.  The higher you climb the more God is able to reveal to your heart.  This is an important principle.  What we are reckoning here is a spiritual mountain and not a literal one.  What is this mountain that we are called to ascend to the maximum height? It just means getting away from the world.  When you ascend the mount you leave the world behind.  This talks of separating ourselves from the present world.  The height we gain is related to the distance we would have moved away from this present world.   We see this principle actively demonstrated in the life of the Lord.  He totally separated Himself from this world and its pressures and demands (Matthew 5:1, 14:23, and 15:29).  The Spirit called John to a great and high mountain, to a place separated from the world and its influences.    Often we are not able to keep ourselves away from the present world and ascending the mountain remains a wishful desire.  However, it is equally true that we can never see heavenly and the spiritual things until we have been separated from the world.",
		"bible_reading": "Jeremiah 10:1-11:23 \n Colossians 3:18-4:18 \n Psalm 78:56-72 \n Proverbs 24:28-29",
		"image_url": "Empty at the moment",
		"today_command": " As many as I love, I rebuke and chasten: be zealous therefore, and repent.  Revelation3:19"
	},
	{
		"devotion_id":8, 
		"devotion_title":"Title 0",
		"devotion": "This world lies under a terrible curse. The Lord has pronounced a curse upon this world where Satan is the prince.  What is the explanation of this curse?  The law of frustration works or operates in this world which is cursed.   Though man has done many things and made many attempts to break the sound barrier of frustration, yet they have not been able to do so.  Man with all his knowledge of science, development, technology, and psychological research, has not been able to make a break through; man has not been able to cross the sound barrier of frustration.  Nor will man ever be able to do so.  The wisdom of man will fail.  The law of frustration will continue to work in this world and every effort to have peace will continue to fail for there can be no peace in the world without the Prince of Peace.    This is God’s word to us.  As this world is under a curse and the law of frustration is at work, immorality will increase and eventually mature.  This is what we see all around us.  What should God’s children do in this hour?   Every child of God who is sensitive to the Holy Spirit will know that something is wrong when they touch this world.   If you touch something of this world, you will sense and know that you are touching an accursed thing.  You will get the smell of death there.",
		"bible_reading": "Jeremiah 12:1-14:10 \n 1 Thessalonians 1:1-2:8 \n Psalm 79:1-13 \n Proverbs 24:30-34",
		"image_url": "Empty at the moment",
		"today_command": "But thou, O man of God, flee these things; and follow after righteousness, godliness, faith, love, patience, meekness. 1 Timothy 6:11"
	},
	{
		"devotion_id":9, 
		"devotion_title":"Title 0",
		"devotion": "One of the most important statements in the entire Bible concerning the anti-Christ states,  “It prospered in everything it did.”  (Daniel 8:12).  God allowed the evil one to prosper in all he did.  The little horn, the anti-Christ will prosper in everything in the last days.  The implications of this unpleasant reality are sobering.   Daniel declares that the anti-Christ will succeed in whatever it does in these days!  There is ample evidence to suggest that the anti-Christ is setting himself against the Lord in the very life of His people.  He seems to be succeeding in his attempt to overcome the host of saints.    He will succeed in setting himself up as the Prince of God’s people, he will succeed in attempting to remove the daily sacrifice, he will succeed in casting down the place of the Prince’s sanctuary, and he will succeed in his attempt to overcome the host of saints!  And thus he will succeed in his attempt to cast the truth down to the ground. It grieves one to see that the Lord will allow the anti-Christ to succeed.  Why does the Lord allow him to wreck, smash and destroy His people?   Beloved, there are several reasons for this, but the main reason why the Lord allows the anti-Christ to do these things is because of the rebellion of the sanctuary (believers) and the priests who minister in it! There is a rebellion in the very sanctuary of God’s people.",
		"bible_reading": "Jeremiah 14:11-16:15 \n 1 Thessalonians 2:9-3:13 \n Psalm 80:1-19 \n Proverbs 25:1-5",
		"image_url": "Empty at the moment",
		"today_command": "Let every one that nameth the name of Christ depart from iniquity. 2 Timothy 2:19"
	},
	{
		"devotion_id":10, 
		"devotion_title":"Title 0",
		"devotion": "“And they sang a new song before the throne (of God) and before the four living creatures and before the elders (of the heavenly Sanhedrin).  No one could learn (to sing) that song except the 144,000 who had been ransomed (purchased, redeemed) from the earth.” (Rev 14:3 ).  Those who are singing this ‘new song’ are not trying to catch up with the words or the tune, but they are allowing the Spirit to do a new work in their lives.  This talks of a working of God in the lives of some people, so that now they may sing a new song unto the Lord. They are able to sing a new song because they are open to the Holy Spirit for a fresh work of the Spirit in their lives.  It is a new song that is sung out of the life they possess, and it’s new because it comes out of a fresh working of the Spirit! \n\t No man can learn this song.  This song has to be learnt from the way God is working in our lives.  We cannot catch up at the last minute.  God is working in the midst of a people in these days, a people who are utterly sensitive and available to the Holy Spirit.  May God find you and me to be a part of this remnant church that sings a new song because there are fresh workings of God in their lives. ",
		"bible_reading": "Jeremiah 16:16-18:23 \n 1 Thessalonians 4:1-5:3 \n Psalm 81:1-16 \n Proverbs 25:6-8 ",
		"image_url": "Empty at the moment",
		"today_command": "He that shall endure unto the end, the same shall be saved.  Mark 13:13"
	},
	{
		"devotion_id":11, 
		"devotion_title":"Title 0",
		"devotion": " What is a spiritual digestive system?  It is our life of obedience to the Lord.  Our attitude and heart to obey the Lord is our spiritual digestive system.   We may not know all the ways in which spiritual things work out in our lives, such as how we were born-again, but as long as we have a healthy digestive system, a heart of obedience, everything else is taken care of.  Saints, if we have a heart of obedience unto the Lord, to walk in His ways and follow after Him, everything will be well with us.  The most important thing in our lives, spiritually, is our obedience to God.  If we have a heart that is fully obedient to the Lord, then we can say that we have a healthy digestive system.  First the natural and then the spiritual!  Knowledge without obedience is akin to undigested food.  Let us accept this serious counsel wholeheartedly.  If you do not have a heart to obey the Word which God has ministered to you then undigested food lies inactively in your inner spiritual recesses. If you fail to obey the Word you have been convicted of when you heard it or fail to change thereupon then you are like one who has failed to digest his food.  As a result there will be a heap of undigested food in your system.  When that happens, naturally speaking, a person is sure to get sick.  Indigested food can result in grievous danger, even threatening one’s life.",
		"bible_reading": "Jeremiah 19:1-21:14 \n 1 Thessalonians 5:4-28 \n Psalm 82:1-8 \n Proverbs 25:9-10",
		"image_url": "Empty at the moment",
		"today_command": "And what I say unto you I say unto all, Watch. Mark 13:37"
	},
	{
		"devotion_id":12, 
		"devotion_title":"Title 0",
		"devotion": "The enemy in the form of the woman who had a spirit of divination did not hesitate to declare Apostle Paul to be the servant of the Most High God (Acts 16: 16­-18). She advertised and praised Paul’s ministry. In a subtle way the enemy was trying to snatch away Paul’s anointing by exalting the man and his ministry. Somehow men are so prone to hear their own praise from the lips of others - and in nine cases out of ten, this is nothing but an attempt from the pit to sidetrack the once - sincere servant of God. Why? Paul was becoming a threat to the kingdom of darkness! A man is no threat to the kingdom of darkness merely because he heals or preaches or teaches about the kingdom of God. But Satan’s kingdom is threatened when a company of people walk in the way of the cross, in union with the Lord. Today, we live in an hour when it seems right to exalt the self. People are looking for a man who can deliver the goods, a man who can bring revival, a man who can fill the churches. And such ones are ‘worshiped’! But all such method and means used to exalt is an abomination before God.  The majority is invariably at a tangent to God’s purposes. So let us be those who are content to be a remnant and who cry out for righteousness among a wicked generation. The Lord promises to keep the remnant.",
		"bible_reading": "Jeremiah 22:1-23:20 \n 2 Thessalonians 1:1-12 \n Psalm 83:1-18 \n Proverbs 25:11-14 ",
		"image_url": "Empty at the moment",
		"today_command": " Look not every man on his own things, but every man also on the things of others.  Philippians 2:4"
	},
	{
		"devotion_id":13, 
		"devotion_title":"Title 0",
		"devotion": "“Who shall separate us from the love of Christ? shall tribulation, or distress, or persecution, or famine, or nakedness, or peril, or sword?”  (Rom 8:35).  Reflecting on the greatness of God’s love the Apostle says that the love of God is taller than the tallest of one’s tribulation or suffering.  However, in the lives of many believers today, their local situations assume greater proportions and seem to be taller than God’s love!  Such people need to come to know the true ground of God’s love in Christ.  Beloved, our eyes need to be opened to see that our problems, that always appear to be so large to us, are smaller than the love of God.  The Apostle Paul was able to see that nothing — no persecution nor trial, no distress nor difficulties, could ever measure to the immensity of God’s love.  Christians today are easily separated from the love of Christ!  Sometimes, it seems that anything and everything separates some believers from the love of Christ.  The least amount of trouble, the slightest difficulty, and the smallest trial causes some believers to walk away from the love of Christ.  This clearly shows that some believers do not really come into a true apprehension of the love of God. They talk glibly about the love of God and yet in the face of minuscule situations, the first thing they question is God’s love for them. ",
		"bible_reading": "Jeremiah 23:21-25:38 \n 2 Thessalonians 2:1-17 \n Psalm 84:1-12 \n Proverbs 25:15",
		"image_url": "Empty at the moment",
		"today_command": " And the servant of the Lord must not strive; but be gentle unto all [men], apt to teach, patient,  2Timothy 2:24"
	},
	{
		"devotion_id":14, 
		"devotion_title":"Title 0",
		"devotion": "“For I am persuaded, that neither death, nor life, nor angels, nor principalities, ...shall be able to separate us from the love of God, which is in Christ Jesus our Lord.” (Romans 8 :38,39). For many people, death is the end force, the largest, the greatest and the tallest thing, but the Bible says that even death cannot separate us from the love of God.  Death has no power to separate us from the love of God in Christ Jesus!  Can you truly believe this?  Are you of the view that death is so powerful, so tall and high, and so immense that it overshadows Christ?  The Apostle Paul says that this is not so; the love of God is more.  Neither death nor life can separate us from His love.  Many people love their lives; they love life; all they want to do is to live.  Their whole life is spent living unto themselves, unto their own interests and unto the extension of their own life.  But the Bible says that the love of God is far greater than our own lives.  Many believers have been separated from the love of God and this great call of God in their lives, because they have loved their own self life more.  They despise and reject anything and everything that comes in the way or that challenges the self life.  Love of the self has separated them from this holy calling.  Saints, we cannot be part of New Jerusalem, the Heavenly City, if we love our own lives, if we love the self life and if we want our present lives to continue, unchallenged and unquestioned!",
		"bible_reading": "Jeremiah 26:1-27:22 \n 2 Thessalonians 3:1-18 \n Psalm 85:1-13 \n Proverbs 25:16 ",
		"image_url": "Empty at the moment",
		"today_command": " Follow peace with all men, and holiness, without which no man shall see the Lord: Hebrews 12:14"
	},
	{
		"devotion_id":15, 
		"devotion_title":"Title 0",
		"devotion": "We read about Demas in verse10 of 2 Tim 4, “For Demas hath forsaken me, having loved this present world.”  To many believers the “things present” are more important and more significant than the love of God.  They see the things of God as something of the distant future, but what appear to be taller and more pertinent to them are the things which are present, visible, tangible and sensual.  They are drawn away from God and drawn towards “things present”.  Though the Apostle Paul found that the ‘things present’ could not separate him from the love of God, his co-laborer and friend Demas, who was a blessing to the ministry of Paul at one time, loved the present world, with all its attractions and temptations, rather than the love of God. The Living Bible says “…for Demas has left me. He loved the good things of this life and went to Thessalonica.”  He was a great help to Paul at one time (Col 4:14, Philemon 24).   ‘Things present’ make many people to move away from God’s call upon their lives.  Saints, be open to the Holy Spirit to help you.  Let us stay away from the present world of materialism to which many are bowing today.  Let us be persuaded in our hearts that the love of God is higher than good living and the good things of this world.",
		"bible_reading": "Jeremiah 28:1-29:32 \n 1 Timothy 1:1-20 \n Psalm 86:1-17 \n Proverbs 25:17",
		"image_url": "Empty at the moment",
		"today_command": " What I tell you in darkness, [that] speak ye in light: and what ye hear in the ear, [that] preach ye upon the housetops. Matthew 10:27"
	},
	{
		"devotion_id":16, 
		"devotion_title":"Title 0",
		"devotion": "True obedience is a hidden matter.  It is before the Lord and not before men.  When the Lord told Abraham to offer his son Isaac as a sacrifice unto the Lord, no one heard what God had said to him.  Abraham could have easily overlooked God’s word to him; none would have known about it save the Lord.  Abraham’s obedience to the Lord’s word was altogether a hidden matter; it was something between the Lord and himself.  Our obedience to the Lord is essentially a hidden matter and no one really knows whether we have obeyed the specific word of the Lord to us or not.  \n\t Beloved, we hear the word of the Lord corporately as a Body when we gather in His House.  Yet in all that we hear as a Body, there are specific ministrations that apply to our individual lives and situations.  No one else knows what exactly the Lord is speaking to us in the depths of our heart.  The preacher does not know what the Lord is calling you to obey and neither do you know what the Lord is speaking to anyone else.  This is a hidden and personal matter but the Lord knows all things about us. What and where the Lord puts his finger upon our lives is not known to anyone but the Lord and us.",
		"bible_reading": "Jeremiah 30:1-31:26 \n 1 Timothy 2:1-15 \n Psalm 87:1-7 \n Proverbs 25:18-19 ",
		"image_url": "Empty at the moment",
		"today_command": "Walk in wisdom toward them that are without, redeeming the time.  Colossians 4:5"
	},
	{
		"devotion_id":17, 
		"devotion_title":"Title 0",
		"devotion": "The Lord had warned me about three evils that are common among preachers and pastors today.  One is name, fame and position; the other is wealth and riches; and the third is the sin of adultery.  On these three accounts many men have lost their calling and anointing in Christ.  And I am only grateful to God for preparing me from my early days.  Though there were many occasions when the flesh was tempted, but God gave me grace to overcome.  When God opened the doors of ministry to me, men were able to recognize His anointing upon the ministry without my having to use any kind of human ingenuity!  I am aware that to turn away from these temptations that befall the best of men requires great grace from God.  And therefore I would like to encourage all those who are called upon to serve the Lord in ministry to remain in their calling with gratefulness, trust and humility.  Jesus made these things very clear to His disciples.  A person who seeks some kind of reward and recognition in the church, who wants others to respect him for what he is not, harbours uncommitted ambitions within.  This is lust of the flesh working in subtle ways in them. Let us remember that the lust of the flesh is not only in terms of moral degradation.   It could be in terms of recognition and name.  The love to have a name, a position or a title is also a symptom of the lust of the flesh.",
		"bible_reading": "Jeremiah 31:27-32:44 \n 1 Timothy 3:1-16 \n Psalm 88:1-18 \n Proverbs 25:20-22",
		"image_url": "Empty at the moment",
		"today_command": "He that is greatest among you, let him be as the younger; and he that is chief, as he that doth serve. Luke 22:26"
	},
	{
		"devotion_id":18, 
		"devotion_title":"Title 0",
		"devotion": "“Now the Spirit speaketh expressly, that in the latter times some shall depart from the faith, giving heed to seducing spirits, and doctrines of devils;  Speaking lies in hypocrisy; having their conscience seared with a hot iron;”   (1 Tim 4: 1-2).  Think of a person who had a living relationship with God, a sincere love for Jesus, who had been baptized in water and also in the Holy Spirit, and who had experienced some of the precious spiritual gifts; a dedicated person who even had a ministry of some kind, being seduced by evil spirits resulting in the searing of his conscience towards the truth!  Would it be easy to tell such a person that he or she is being seduced by evil spirits?   The people of whom the apostle Paul talks of are not people who intentionally leave the faith as we understand it in the ordinary sense.  They did not intentionally turn their backs on God.  How and why do they leave the faith?  How does this happen to believers?  It begins by listening to the seducing spirits!  It all begins with a listening.  They give their ear to the voice of seducing spirits and the doctrine of devils!  And then they are drawn away from true faith into a counterfeit faith, without ever realizing what is happening.  How careful we need to be to hear the right voice! ",
		"bible_reading": "Jeremiah 33:1-34:22 \n 1 Timothy 4:1-16 \n  Psalm 89:1-13 \n Proverbs 25:23-24  ",
		"image_url": "Empty at the moment",
		"today_command": "Pray ...that the word of the Lord may have [free] course, and be glorified,  2Thessalonians 3:1"
	},
	{
		"devotion_id":19, 
		"devotion_title":"Title 0",
		"devotion": "“Slay outright the elderly, the young man and the virgin, the infant and the women; but do not touch or go near anyone on whom is the mark. Begin at My sanctuary. So they began with the old men who were in the front of the temple (Who did not have the Lord’s mark on their foreheads).  (Ezekiel 9:6Amplified)” The Lord God commanded six executioners to slaughter all the people except the precious remnant, the ones who bore the mark of the Lord, the overcomers company who follow the Lamb wherever He goes. The executioners came with the destroying weapon in their hand and first laid hold of the priests and elders of the temple. It is an eternal principle of God that judgment begins in the house of God.   In the house of God there the godly minority but the majority are those who have been exposed to the Word of God over a length of time but  have not yet received what God has been wanting to impart.  In the presence of God they do all the right things, they sing whole-heartedly, they actively participate in every new venture opened by the Spirit, they share and testify that the Lord has touched them on different occasions but in reality their lives are just the same!  Why? Because they have a semblance of outward acceptance, submission and obedience but inwardly they have closed and locked up their conscience. Is there a hardness that has set into our lives? ",
		"bible_reading": "Jeremiah 35:1-36:32 \n 1 Timothy 5:1-25 \n  Psalm 89:14-37 \n Proverbs 25:25-27",
		"image_url": "Empty at the moment",
		"today_command": "One that ruleth well his own house, having his children in subjection with all gravity. 1Timothy 3:4"
	},
	{
		"devotion_id":20, 
		"devotion_title":"Title 0",
		"devotion": "Preachers today talk glibly about an any moment rapture of the church.  They say that Jesus will come suddenly like a thief and rapture His church before the great tribulation would arise.  In ecclesiastical circles this is called ‘the imminent return of Christ’ and this is what the majority of Christians believe.  But till the middle of the nineteenth century, around 1830 AD, this was not the teaching in the church.   At that time Christians were living in prosperity and comfort in most Christian countries.  They were not facing any tribulation, conflict, resistance or opposition for their faith.  The prevailing sense of ease and comfort brought about a feeling that Christ would ‘rapture’ His people and preserve them from the tribulation and suffering caused by the Antichrist.   It was at such a time the preachers began saying that Christ is coming to rapture the church before the tribulation will come upon the earth.  That doctrine was taken up by many people and began to be preached in the majority of denominations.  This wrong teaching has corrupted the church more than any other teaching.  It has eroded the very foundation of the church and weakened it.  This has inculcated and encouraged believers to live an easy-going life, attempting to escape from every kind of suffering and adversity. ",
		"bible_reading": "Jeremiah 37:1-38:28 \n 1 Timothy 6:1-21 \n Psalm 89:38-52 \n Proverbs 25:28  ",
		"image_url": "Empty at the moment",
		"today_command": " Rebuke not an elder, but entreat him as a father; and the younger men as brethren; 1 Timothy 5:1"
	},
	{
		"devotion_id":21, 
		"devotion_title":"Title 0",
		"devotion": "“These things I have spoken unto you, that in me ye might have peace. In the world ye shall have tribulation: but be of good cheer; I have overcome the world.” (John 16:33).\n \t Jesus did not say that we would not have any tribulation and that all will be well.  He said very positively that we shall have tribulation.  This is God’s word.  He said very clearly, that in the world we would have trials, tribulations and frustration but we are to be of good cheer FOR HE HAS OVERCOME THE WORLD.  He could not be more explicit and direct! \n\t Jesus has conquered the world for us.  He has overcome the world.  This is the cause of our confidence and assurance.  He never promised us that He would help us to escape from suffering and tribulation, whether they be small or big.  He said we will overcome even as He has overcome.  So let us not look for the door!  Let us not try to find some escape route from the suffering that comes our way.  He said it so clearly.  Our peace is in Him and not in our situations.  He is our peace! That is a great secret.",
		"bible_reading": "Jeremiah 39:1-41:18 \n 2 Timothy 1:1-18 \n Psalm 90:1-91:16 \n Proverbs 26:1-2",
		"image_url": "Empty at the moment",
		"today_command": " If any man speak, let him speak as the oracles of God; if any man minister, let him do it as of the ability which God giveth: 1 Peter 4:11"
	},
	{
		"devotion_id":22, 
		"devotion_title":"Title 0",
		"devotion": "The Bible clearly tells us that all of creation is waiting for the revealing of the sons of God. If everything is to be released from the curse and bondage, it will happen through His people—a people in whom God has worked His purpose! This people, called the 'sons of God', are those conformed to the image of His Son.\n\n We must grasp the goal toward which God is working through His Holy Spirit in this hour. God is not doing two different things on the earth; He is doing one. Evangelism brings people to the Lord and adds them to the church, which is essential. But the Holy Spirit longs to work in these new believers, aligning them with the counsel of His will, so that they might be transformed and conformed to the image and likeness of Christ. \n\n Salvation, though by God's grace, is only the beginning. A deeper, crucial work of the Spirit follows—the shaping of believers into the likeness of the Son. Sadly, much of Christendom focuses solely on leading people to salvation. But God is not limited by this. He is advancing His purpose, bringing forth a people for His glory.",
		"bible_reading":"Jeremiah 42:1-44:23 \n 2 Timothy 2:1-21 \n Psalm 92:1-93:5 \n Proverbs 26:3-5 ",
		"image_url": "Empty at the moment",
		"today_command": "Keep yourselves in the love of God, looking for the mercy of our Lord Jesus Christ unto eternal life. Jude 1:21"
	},
	{
		"devotion_id":23, 
		"devotion_title":"Title 0",
		"devotion": "The throne talks of the judgment of God.  The Bible tells us that the world and everything else will be judged. He will judge all things by Divine government.  He is going to judge everything in the light of the jasper stone. This talks of the Divine nature of the One who sits upon the throne.  The One who sits upon the throne is pure and clear as Jasper.  His throne is also clear as Jasper.  The seven churches were judged in the light of the One who is upon the throne and who is as clear as Jasper.  And the world will also be judged in the same light.  The judgments will be absolutely true.  He that sits upon the throne is like the precious stone of Jasper that is as clear and transparent.  The One upon the throne is absolutely transparent.  There is no darkness found in Him and there is no shadow in Him.  He is perfectly transparent.  You can see through!To be transparent signifies that there is nothing false, hidden or shadowy within.  God is totally transparent.  He is the absolute Truth.  In Him there is nothing that is not real!  Some believers harbor doubts about God, they have misgivings and misunderstandings about the Lord.  And they also doubt and do not believe His Word.  But, on that Day, when they see Him who is like Jasper, their doubts will flee away. There is no mixture of two contrary things in the Divine nature of God. ",
		"bible_reading": "Jeremiah 44:24-47:7 \n 2 Timothy 2:22-3:17 \n  Psalm 94:1-23 \n  Proverbs 26:6-8",
		"image_url": "Empty at the moment",
		"today_command": "But this I say, brethren, the time is short: it remaineth,..they that buy, as though they possessed not;  1 Corinthians 7:29,30"
	},
	{
		"devotion_id":24, 
		"devotion_title":"Title 0",
		"devotion": "How did the lie enter into the world?  Lies have a very long and terrible history that can be traced to the Garden of Eden.  The Lord Jesus said, “When he speaks a lie, he speaks from his own resources, for he is a liar and the father of it” (John 8:44). The Lord was relating to what happened right back at the beginning when Satan told a lie about God that Adam readily accepted.  The story of the terrible tragedy of this world began with a lie—it came from that lie.  There is a lie right at the heart of this universe; there is no truth in this universe outside of God.  The history of this fallen creation is the history of a lie.  Jesus said of Satan, “….. and abode not in the truth” (John 8:44).  There is a hint of a suggestion here that Satan must have been in the truth at some point of time.  But he departed from the truth and the terrible judgment of God fell upon him and those who shared the lie with him.   Then Satan came to man, God’s creation to impart to it his own lie.   John, the Apostle says, “The whole world lieth in the evil one” (1 John 5:19). The ‘lie’ has a very long and terrible history, but it is coming to its climax now.  The ‘lie’ is one of the most powerful influences in the world; a liar is one who does not believe there is truth!  Beloved, we live in a deceived world; the world is steeped in deception; and this is increasingly having a direct impact and an adverse effect upon God’s people.",
		"bible_reading": "Jeremiah 48:1-49:22 \n 2 Timothy 4:1-22 \n Psalm 95:1-96:13 \n Proverbs 26:9-12 ",
		"image_url": "Empty at the moment",
		"today_command": "Nevertheless let every one of you in particular so love his wife even as himself; and the wife [see] that she reverence [her] husband.  Ephesians 5:33"
	},
	{
		"devotion_id":25, 
		"devotion_title":"Title 0",
		"devotion": "The heathen and ungodly philosophize that if we suffer in life it is either because we are bad people or because God has forsaken us.  Let me draw upon an illustration from the life of Paul.  He was caught in a terrible storm, the ship was wrecked and the crew, as well as all others in the ship, was thrown on the shore (Acts 28).  We read about what happened to him on that Island.  As Paul sat by the fire, a snake fastened itself upon his hand.  The people around condemned him, but he faced the situation calmly; he shook off the snake and continued with what he was called to do. The world will condemn us for that is the way of the world.  It is not surprising!   The way of the world is to ignominiously judge even the greatest saint who walked in their midst.  Let us not be perturbed by people who condemn us when we face trials and difficulties and tell us that we are going through difficulties because of God’s judgment upon our actions and reactions.  The word of God for us, in the midst of trials and situations, is to be of good courage, and of good cheer; to be confident, undaunted, and strong.  If your life is free from problems and difficulties, if your life is without any trial and suffering, then all I can say is that it will not be long before you will find yourself walking away from this calling to be His remnant in these perilous days.",
		"bible_reading": "Jeremiah 49:23-50:46 \n Titus 1:1-16 \n Psalm 97:1-98:9 \n Proverbs 26:13-16",
		"image_url": "Empty at the moment",
		"today_command": "Let the brother of low degree rejoice in that he is exalted:  James 1:9"
	},
	{
		"devotion_id":26, 
		"devotion_title":"Title 0",
		"devotion": "“Come now, and let us reason together, saith the LORD: though your sins be as scarlet, they shall be as white as snow; though they be red like crimson, they shall be as wool.” (Isa 1:18).  Is there anything whiter than snow?  Only the handiwork of God can produce something that is whiter than snow.  Only God can remove our weaknesses and produce godliness in our lives. This message comes to us by the one who says, “Thou hast a few names even in Sardis which have not defiled their garments; and they shall walk with me in white: for they are worthy” (Rev 3:4). What the Lord is emphasizing is that this work of transformation of our nature and character is something that only God can do.  Have our lives been influenced by the lies of the world!  May we be open and honest before the Spirit of Truth!  The spirit-of-the-world is a deceiving spirit, actively working throughout the world today.  Therefore, it is difficult to believe that we shall become pure gold like a transparent glass.  But the Spirit of Truth will do this.  Let us believe the Word.  The unbelief of many will not make any difference.  “To this end have I come” says the Spirit of Truth.  This is the reason that Jesus sent us the Holy Spirit.  And when He is come He is going to lead us into the truth and every lie will be exposed. ",
		"bible_reading": "Jeremiah 51:1-53 \n Titus 2:1-15 \n Psalm 99:1-9 \n Proverbs 26:17 ",
		"image_url": "Empty at the moment",
		"today_command": "Let the word of Christ dwell in you richly in all wisdom;  Colossians 3:16 "
	},
	{
		"devotion_id":27, 
		"devotion_title":"Title 0",
		"devotion": "We read in history that all the early apostles died a cruel and violent death.  Later the Emperor of Rome hunted down Christians and burned them at the stake.  In the third century, Christians were thrown to the lions; they were forced to fight one another to the death as gladiators in amphitheatres to entertain the public.  Have you wondered why the Lord did not save them from suffering, humiliation and death?  The God who could shut the mouths of the lions in the days of Daniel, the same God let the lions tear the disciples of Jesus to pieces.  The same God who saved the young men from the fiery furnace in the days of Daniel did not perform such miracles when His holy servants were being burnt at the stakes in the Roman Empire.  Sometimes one wonders why the Lord stayed His hand.  It is very difficult for the natural man to understand this, but the Spirit of God would reveal the wisdom of God to the spiritual man.  In the light of Jesus’ prayer to His Father it is possible to understand why the Lord did not save His disciples from dying as martyrs.  Jesus in His high priestly prayer to the Father (John 17) prayed that the Father would not take the disciples out of the world, but that He would keep them from evil. The Lord never wanted them to be taken or ‘raptured’ out of the world at that time just because of the suffering they would experience, but He wanted them to be  kept from every kind of evil.",
		"bible_reading": "Jeremiah 51:54-52:34 \n Titus 3:1-15 \n Psalm 100:1-5 \n Proverbs 26:18-19",
		"image_url": "Empty at the moment",
		"today_command": " Let this mind be in you, which was also in Christ Jesus:  Philippians 2:5"
	},
	{
		"devotion_id":28, 
		"devotion_title":"Title 0",
		"devotion": "“If I must needs glory, I will glory of the things which concern mine infirmities.”(2 Corinthians 11:30 ) How readily the Apostle Paul admits his weaknesses and infirmities!  Apostle Paul said that he could boast of one thing alone — his dependence upon the Lord.  He accepted his weaknesses and depended upon the Lord to strengthen him.  It is as if he would say, in words of utter humility, “Lord, I am permanently, incurably, intensely and desperately God-challenged!  I acknowledge that I am weak, I cannot live, I cannot function, and I cannot do anything, apart from Your help!  I am humanly handicapped; my soul is crippled!”  Saints, this is the place where God would like us to come to – a place of absolute dependence upon the Lord.  The Lord desires His Church to be absolutely dependent upon Him in these days.  I thank God that some people are being drawn to the God who dwells in the midst of His people.  They will experience a greater dependency upon the Lord and not upon any person or any thing.  Some saints in our midst and in other places are experiencing this reality in some measure.  Their heart-cry is the same as that of the Apostle.  They cry out, “Lord, I am hopelessly weak without You.  I cannot live without You any more; I cannot function apart from You in my life; I need You above all else. Lord, help me!” ",
		"bible_reading": "Lamentations 1:1-2:22 \n Philemon 1:1-25 \n Psalm 101:1-8 \n Proverbs 26:20 ",
		"image_url": "Empty at the moment",
		"today_command": " Fathers, provoke not your children [to anger], lest they be discouraged. Colossians 3:21"
	},
	{
		"devotion_id":29, 
		"devotion_title":"Title 0",
		"devotion": "“After this I will return, and will build again the tabernacle of David, which is fallen down; and I will build again the ruins thereof, and I will set it up: That the residue of men might seek after the Lord, and all the Gentiles, upon whom my name is called, saith the Lord, who doeth all these things.(Acts 15:16,17).  The Lord chose to rebuild the Tabernacle of David but not the Temple of Solomon!  Glory to God!  And by this, He chose to confound the wise and confuse the religious.  He will restore again the tent of David.  His words make it very clear that His chief interest lay in the hunger, passion and desperation of His people for His person.  The Tabernacle of David eulogizes, exemplifies and represents the hunger, passion, and desperation of David and the people of his time, for the Living God.  Seeing David’s longing and yearning for the living God, He did not allow King David to rebuild the Tabernacle of Moses, but He gave him grace to place the Ark of His Presence in a small tent where he and others could worship Him round the clock.  Here, in the Tabernacle of David, there was no veil to separate God from the worshippers.  The Lord was close at hand at all times.  God met David’s passion and hunger for His presence by appearing between the Cherubim at all times.  God’s desire to restore the Tabernacle of David in this day.",
		"bible_reading": "Lamentations 3:1-66 \n Hebrews 1:1-14 \n Psalm 102:1-28 \n Proverbs 26:21-22",
		"image_url": "Empty at the moment",
		"today_command": " But the end of all things is at hand: be ye therefore sober, and watch unto prayer  1 Pet. 4:7"
	},
	{
		"devotion_id":30, 
		"devotion_title":"Title 0",
		"devotion": " People say that the most important thing is to love Jesus.  Beware of the love-trap that we see in Christendom today where people proclaim that the love of Jesus overrides everything else.  They say, “We love Jesus.  We love the Lord.  Let us not talk about doctrines when we gather together.  We have one common ground and that is the love of Jesus.”  Saints beware of this love-trap where the love of Jesus is made the common ground of fellowship.  Be careful, is all I say.  They think that we do not display any love because we talk more concerning the truth and the life.  When we talk of the truth, the cross, the way, and obedience, they are quick to walk away and disregard our opinions.  The Lord said, “If you love me, you will obey my commandments.”  They set this dictum aside and say, “Let us love one another, brother”, as if loving one another is more important than obedience unto the Lord!  We cannot walk together if we do not agree with one another.   Amos 3:3 says, “Can two walk together, except they be agreed?”  So it is not a matter of loving one another but of a love that will bring us to obey the truth wholeheartedly.   John the Apostle says in his epistle “But if we walk in the light as He is in the light, we have fellowship with one another, and the blood of Jesus Christ His Son cleanses us from all sin (1 John 1:7).",
		"bible_reading": "Lamentations 4:1-5:22 \n Hebrews 2:1-18 \n Psalm 103:1-22 \n Proverbs 26:23",
		"image_url": "Empty at the moment",
		"today_command": " Humble yourselves in the sight of the Lord, and he shall lift you up. James 4:10"
	}
]