[
	{
		"devotion_id":0, 
		"devotion_title":"Title 0",
		"devotion": "“Woe to her that is filthy and polluted, to the oppressing city! She obeyed not the voice; she received not correction; she trusted not in the LORD; she drew not near to her God.” (Zephaniah 3: 1,2). To be a part of the true remnant of God, we have to make sure that, first of all, we do not have an attitude that is similar to the leaders of Zephaniah’s time. We must be those who take heed to His voice, accept correction from the Lord, receive correction into our lives, and lean not upon ourselves, but upon the Lord. Many times we think we can be a part of the godly remnant of God by agreeing ideologically with what God says. But we cannot be a part of the remnant of God unless and until we experience a working of the Spirit in our hearts. The Lord meaningfully says that He will have a remnant who will not idle away their time in church when the Church is being invaded by false prophets and teachers! They will not ignore what is happening to the Church as a result of their activities. They will not ignore the false prophets and teachers who are coming into the Church of Jesus Christ and destroying it by their workings. God will gather people who yearn for His presence these days; He will gather people who will not just come to church for the sake of some form and order, but who will be aware of their responsibilities unto the Lord.",
		"bible_reading": "Job 40:1-42:17 \n 2 Corinthians 5:11-21 \n Psalm 45:1-17 \n Proverbs 22:14",
		"image_url": "Empty at the moment",
		"today_command": "Be on your guard against men – Matthew 10:17"
	},
	{
		"devotion_id":1, 
		"devotion_title":"Title 0",
		"devotion": "For several people, physical and moral convenience is the paramount factor in coming together. People seek for greater convenience in all spheres of activity. This is a common sickness among God’s people that God wants to deal with in these days. Oh, it may sound inconsiderate and harsh, but it is the mind of God. God is sounding an alarm in His holy Church and those who can hear it must give themselves to the calling, unmindful of their inconvenience and bother. Beloved, to gather as a remnant is far from a matter of a bargain. Sadly, many of us are still found sitting around the bargaining table. For many, gathering to worship the Lord and fellowshipping with His people is a matter that calls for the display of their bargaining skills!They can attend one meeting but not the prayer meeting! However, if our eyes have beheld the Lord and if we are able to see the right from the wrong in His light, we will cast aside the bargaining spirit. Sometimes, people behave like spoilt and pampered children. They cannot withstand any inconvenience, however minor and insignificant. Let none be deceived! If anyone wants to be part of God’s remnant, it is the burden of the Spirit that must govern one’s decisions and not one’s convenience or handiness. May God help us to correct our mistaken attitudes!",
		"bible_reading": "Ecclesiastes 1:1-3:22 \n 2 Corinthians 6:1-13 \n Psalm 46:1-11 \n Proverbs 22:15",
		"image_url": "Empty at the moment",
		"today_command": "Do not store up for yourselves treasures on earth – Matthew 6:19"
	},
	{
		"devotion_id":2, 
		"devotion_title":"Title 0",
		"devotion": "Sometimes, people talk about the great blessings they have received from God, but their hearts are closed. Has your heart in some way become enslaved to the blessings you have received? Concerning Israel, the Word of God says, “And he gave them their request; but sent leanness into their soul”. (Ps 106:15). Many are happy to get what they want from the Lord but it could render their hearts blind! We need to fix our eyes upon the Lord and His purpose so that the eyes of our heart can see what is happening all around. Then we will experience a grief within and there will be no question of being drawn or being tempted by the surrounding apostasy. Let God’s remnant cry out, “Lord help me to see that which is upon your heart.” It is a matter of beholding Him. Let your heart stay upon the Lord. Over the years, I have been repeatedly telling my brethren to fix their eyes and hearts upon the Lord, and some have given themselves to that counsel, but at the same time there are some who heeded not and they are no more in our midst. The tragedy is that those very persons, who were so much a part of our vision at one time, being opposed to the pomp, hype and superficiality of so called Christian groups, are now propagating the very things they were opposed to when they were a part of the vision that God had given us!",
		"bible_reading": "Ecclesiastes 4:1-6:12 \n 2 Corinthians 6:14-7:7 \n Psalm 47:1-9 \n Proverbs 22:16",
		"image_url": "Empty at the moment",
		"today_command": "Go and show him his fault, just between the two of you. If he listens to you (if your brother sins against you) – Matthew 18:15"
	},
	{
		"devotion_id":3, 
		"devotion_title":"Title 0",
		"devotion": "Daniel was a man who had set his face to seek the Lord. When the order came to kill all those who could not give an interpretation of the king’s dream, Daniel simply asked for some time to consider this! He and his Hebrew brethren sought the face of the Lord. Let this challenge each one of us. They were men of prayer, men who sought the Lord’s face at every turn. Right through the Book of Daniel we see them to be praying men. The first commitment they made was to live a separated life. Saints, that commitment had to be backed up by a second commitment—to seek the face of the Lord in prayer. It is impossible to live a separated and holy life without spending much time on our knees seeking God for power and authority to lead such a life! With most of us it ends with the commitment we make unto the Lord! It is no wonder that after a week we are back to square one. Saints, if you have decided to separate yourself unto the Lord and be a part of His purpose, you have made a good decision. However, this decision must be backed up by a second commitment to seek the face of the Lord. Let me reiterate that it is nigh impossible to live as Jesus lived without seeking the Lord’s mind and being with the Lord in prayer. This principle, of backing up all things by prayer, can be applied to every commitment we make unto the Lord.",
		"bible_reading": "Ecclesiastes 7:1-9:18 \n 2 Corinthians 7:8-16 \n Psalm 48:1-14 \n Proverbs 22:17-19",
		"image_url": "Empty at the moment",
		"today_command": "Go now and leave your life of sin. – John 8:11"
	},
	{
		"devotion_id":4, 
		"devotion_title":"Title 0",
		"devotion": "The final battle between light and darkness is drawing near. Everything is moving towards the climax when the kingdoms of this world will become the kingdom of God and Christ. At this crucial juncture in the history of the Church, many believers are being singled out by the enemy. They are picked off one by one by the prince of this world. The adversary seems to have no difficulty in doing so in these last days. But if our hearts are set towards the Lord and His purpose, and to be a part of his remnant in the earth, a part of His pure Body in the earth. In the midst of the chaos and delusion, there will be a remnant of believers, called the “elect” of God, who will ever remain faithful to the Lord. They will be those who have beheld the Lord. They will say, “How can I be disobedient to my heavenly calling? How can I forget what the Lord has enabled me to hear and see?” They will bear the testimony of the Lord. Verse 14 of Matthew 24 shows us that the elect will bear the testimony before the nations. The nations will hate them for bearing His testimony. Though the nations will hate them, they will still bear the testimony of the Lord - “And this gospel of the kingdom shall be preached in all the world for a witness unto all nations; and then shall the end come”. Then shall the end come.",
		"bible_reading": "Ecclesiastes 10:1-12:14 \n 2 Corinthians 8:1-15 \n Psalm 49:1-20 \n Proverbs 22:20-21",
		"image_url": "Empty at the moment",
		"today_command": "Do not worry about tomorrow, for tomorrow will worry about itself. – Matthew 6:34"
	},
	{
		"devotion_id":5, 
		"devotion_title":"Title 0",
		"devotion": "The Lord has told us that great spiritual darkness will engulf the whole world. Darkness signifies religious deception, both in the world and in the Church. Thus darkness will be the hallmark of the last days or the days in which we live. The Lord said that false christs and false prophets will arise. Darkness will intensify and God’s people will continue to be deceived. Deception among God’s people will be widespread, beloved. Iniquity will increase as believers enter into greater measures of deception. As a result, the love of many shall wax cold. These are the signs of the last days. Who can deny that these things are already taking place today in some measure? The Lord further told us that God’s true people shall be hated by all nations. Do not take this lightly. I don’t think we have come to this yet, but the Scriptures say that the enemy is going to get more and more powerful, though the Lord shall be with His own people. God’s people will be hated and some will even be betrayed by fellow believers. Some in God’s remnant church may even be put to death. Some of us will be called to suffer and go through terrible persecution, having been betrayed by our brothers and sisters in the Lord. Such shall be the signs of the last days! These are happening in some measure in the midst of God’s people.",
		"bible_reading": "Song of Solomon 1:1-4:16 \n 2 Corinthians 8:16-24 \n Psalm 50:1-23 \n Proverbs 22:22-23",
		"image_url": "Empty at the moment",
		"today_command": "And this is love, that we walk after his commandments. 2John 1:6"
	},
	{
		"devotion_id":6, 
		"devotion_title":"Title 0",
		"devotion": "It is our right to ask for the rain. We see this in Zechariah 10:1 “Ask of the Lord rain in the time of the latter or spring rain. It is the Lord who makes lightning’s which usher in the rain and give men showers of it, to everyone grass in the field.” It is your birth-right to ask for the latter rain in your life. People ask for good wives, for visas, for titles, for husbands and houses and all carnal things. But the Word of God says we are to ask for more rain. It is time to fall upon our faces and ask the Lord for the latter rain. Let it be the desire of our hearts to pray and ask for the latter rain that the seed may grow into maturity and fullness. The seed sown in our hearts has been sown by the Lord. This is a crucial time. Let us awaken out of our sleep and put on the whole armour of light. Let us discard that which is of the flesh and of darkness. Let us recognize God’s authority, receive God’s authority, release God’s authority and rest on God’s authority. The seed of God’s Word has been sown deep down in your heart. What you need is the rain. Pray for the rain. Let us pray to the Lord for a rain of abundance.",
		"bible_reading": "Song of Solomon 5:1-8:14 \n 2 Corinthians 9:1-15 \n Psalm 51:1-19 \n Proverbs 22:24-25",
		"image_url": "Empty at the moment",
		"today_command": "Not forsaking the assembling of ourselves together, as the manner of some [is]; but exhorting [one another]:... as ye see the day approaching. Hebrews 10:25"
	},
	{
		"devotion_id":7, 
		"devotion_title":"Title 0",
		"devotion": "The word mansion is used only twice in the Bible in John 14:2 and in John 14:23. The Greek word for ‘mansion’ is ‘mane’ which talks about a fixed abode and not a mansion. While translating the word ‘mane’ into English the people mistranslated it into ‘mansion’ instead of an abode or dwelling place. Vine’s Expository Dictionary says that there is nothing in the word to indicate separate compartments in heaven, neither does it suggest a temporary resting place on the road. The Amplified Bible also makes it clear that Jesus says, “We will come and make our abode”. John, the apostle, saw the new heavens and the new earth. He saw the new Jerusalem and he said, “Behold the tabernacle of God is with men, and they shall be His people and He shall be their God”. (Revelation 21:3). Is man going to heaven or is God coming down to man to dwell in and amongst him? Jesus said, “We will come”. Who is the Father’s House? The Bible says, “Ye are the temple of the living God. And the Spirit of God dwelleth in you” Let us not doubt that we are the house of God and we are the Father’s house.",
		"bible_reading": "Isaiah 1:1-2:22 \n 2 Corinthians 10:1-18 \n Psalm 52:1-9 \n Proverbs 22:26-27",
		"image_url": "Empty at the moment",
		"today_command": "But refuse profane and old wives' fables, and exercise thyself rather unto godliness.1 Timothy 4:7"
	},
	{
		"devotion_id":8, 
		"devotion_title":"Title 0",
		"devotion": "What happened in the days of Noah? The people were very busy eating and drinking, giving in marriage and taking in marriage. We know this is true because Jesus Himself said so. The people of Noah’s time were caught up with the issues of life. Eating, drinking, and marrying are common issues of life. The people gave themselves to these common, everyday things, with no thought for the will of God, until the flood came and took them all away. So shall also the coming of the Son of Man be! How prophetic! “And spared not the old world, but saved Noah the eighth person, a preacher of righteousness, bringing in the flood upon the world of the ungodly;” (2 Peter 2:5). The Scripture says that Noah was a preacher of righteousness. Noah was a witness and the testimony of the Lord in his time. Noah was a witness both to and against his generation. He bore a testimony in righteousness before the people and the nations for 120 years! But the Scripture tells us that no one listened to him. Can you believe this? For 120 years he bore a testimony before the people! No one listened to him – no one repented, no one heard what Noah had to say! They just continued to live as they normally did.",
		"bible_reading": "Isaiah 3:1-5:30 \n 2 Corinthians 11:1-15 \n Psalm 53:1-6 \n Proverbs 22:28-29",
		"image_url": "Empty at the moment",
		"today_command": "Enter through the narrow gate. – Matthew 7:13"
	},
	{
		"devotion_id":9, 
		"devotion_title":"Title 0",
		"devotion": "It seems that Noah had an unsuccessful ministry for 120 years! No one was saved through his ministry. He seems to have been defeated at every point! In the eyes of today’s evangelists, therefore, Noah was a most unsuccessful man, for none but his family was saved through his ministry. Noah’s obedient and righteous life did not result in anyone being saved apart from his immediate family! Today however, success and achievements are the main issues, the key points, and the crux for many leaders. They try to achieve success at any cost because they stand blinded to the reality by the adversary. .The present trend in the church world is that anything that is successful is the Lord and anything that works and brings good results is the Holy Spirit.They choose not to be guided by the Holy Spirit and instead turn to philosophy and reason as their guiding star. They forsake the Spirit and depend on their own soul to do God’s work and bring good results. And all the while they believe that they are being led of the Spirit of God! Thus they compromise theWord of God in many ways. What a terrible deception? We can know what is true and what is false only when our minds are enlightened and renewed! Here was a faithful witness, a man of righteousness, who preached day and night for 120 years, but no one other than his own household listened to him!",
		"bible_reading": "Isaiah 6:1-7:25 \n 2 Corinthians 11:16-33 \n Psalm 54:1-7 \n Proverbs 23:1-3",
		"image_url": "Empty at the moment",
		"today_command": "Let man not separate. (What God has brought together in marriage) – Matthew 19:6"
	},
	{
		"devotion_id":10, 
		"devotion_title":"Title 0",
		"devotion": "Men will appreciate you one day and throw you out the next day. Men will change, their opinions will change, and their evaluations will change, but the God in whom you put your trust will never change. So it is very important, wherever you may be and whatever may be your responsibility, to remain true to the One who has called you and placed you in His kingdom. As spiritual people we ought to be concerned with only one thing— what the Lord has to say about our life. Today many believers are living their spiritual lives before other people! That sort of life will never reach beyond the temporal. It will never re-appear in eternity. It is futile to live before men. The most important challenge today is to live before the Lord.The church in Sardis had a name. it was alive but the people were dead! The Lord’s opinion of them was just opposite to that of the saints in the church at Sardis. Most people evaluate a preacher according to the display of spiritual gifts and an ability to articulate the word of God. The opinion of the majority of believers could be a hundred percent wrong! In the same way, a church could be alive unto the Lord and to His testimony, but in the opinion of the majority of Christendom that church could be considered no better than dead! But the Lord is not impressed by any of these things.",
		"bible_reading": "Isaiah 8:1-9:21 \n 2 Corinthians 12:1-10 \n Psalm 55:1-23 \n Proverbs 23:4-5",
		"image_url": "Empty at the moment",
		"today_command": "For he that will love life, and see good days, let him refrain his tongue from evil, and his lips that they speak no guile: 1 Peter 3:10"
	},
	{
		"devotion_id":11, 
		"devotion_title":"Title 0",
		"devotion": "A child of God who takes life seriously will invariably be found seeking God for something that will explain the spiritual experiences he faces. He will look to God for that which will explain his experience. This is the mark of the true child of God who is progressing on in the things of God. There are many believers in whose lives situations come and go without affecting or touching them in any way. When they are faced with situations, they go through experiences of one kind to another, but the situations end without bringing about any real spiritual progress in their lives. But true children of God’s heart will always look for an explanation for everything in life. They continue to look unto God and none other for every explanation and answer. That is how they get to know the Lord and His ways. However, the reality is that there are very few believers who walk this way. Only those who are serious about this calling in their lives really seek to know the meaning of every situation they face. Today, many believers are crisis-managing people. Somehow they manage to move from one crisis to another in their lives. But the true child of God seeks the face of the Lord to know the correct explanation of things that are happening in his life.",
		"bible_reading": "Isaiah 10:1-11:16 \n 2 Corinthians 12:11-21 \n Psalm 56:1-13 \n Proverbs 23:6-8",
		"image_url": "Empty at the moment",
		"today_command": "For that ye ought to say, If the Lord will, we shall live, and do this, or that. Jam 4:15"
	},
	{
		"devotion_id":12, 
		"devotion_title":"Title 0",
		"devotion": "In Romans 8:22, we read of another groaning. “We know that the whole creation groaneth and travaileth in pain together until now.” Paul talks about a groaning creation. If you put your ear to the groaning creation you will probably hear them say, “What it is all about?” They do not know all the details but they are groaning. And then the Apostle Paul goes on to say in verse 23: “And not only they, but ourselves also, which have the firstfruits of the Spirit, even we ourselves groan within ourselves, waiting for the adoption, to wit, the redemption of our body.” We have deep questions in our hearts. We are facing such difficulties, trials and sufferings both within and without. They say, “Lord, what does it lead to? Lord, I have your promises, yet there are these difficulties, trials and sufferings”. The Apostle Paul went though similar things in his life; he set himself to seek the Lord and the explanation came from the Lord. “For this thing I besought the Lord thrice that it might depart from me. And he said unto me, “My grace is sufficient for thee: for my strength is made perfect in weakness.” (II Corinthians 12:8-9). We face many types of situations in our lives. The Lord will help us to seek Him in these days if we are those who are ‘groaning within ourselves’ for the answers. He will help us to change our ideas, our thoughts, and our ways.",
		"bible_reading": "Isaiah 12:1-14:32 \n 2 Corinthians 13:1-14 \n Psalm 57:1-11 \n Proverbs 23:9-11",
		"image_url": "Empty at the moment",
		"today_command": "And he took the cup, and gave thanks, and said, Take this, and divide it among yourselves: Luke 22:17"
	},
	{
		"devotion_id":13, 
		"devotion_title":"Title 0",
		"devotion": "A bond servant is is at liberty to leave in the 7th year (Deut 15:12-17). But if he chooses to be a bond servant of his master, by his own free volition, he would say, “I don’t want to be free and go away with all your blessings because I love you and your house, my master. Though all things are lawful and I can leave this house, yet I know that all things do not edify. I would rather serve you, my master, than be on my own.” On hearing such a willing submission, the master would then proceed to bring him to the judges. The master would tell the judges that this servant man willingly chose to stay and serve him. Then the master would take him to the nearest doorpost and pierce his ear. Thus the servant would serve the master for all the days of his life. It is clear that a bond servant is one who by his own free volition chooses to be a perpetual slave unto his master. This is very precious, saints. What makes all the difference between a normal servant and a bond servant is the choice that the servant makes before his master. A servant works for wages, but a bond servant serves the master for love and surrenders his personal rights unto the master. He is free to leave carrying all the master’s blessings with him, but chooses instead to stay with the master and work as his bond-slave. Thereafter, the master’s home becomes his home for he has no where else to go!",
		"bible_reading": "Isaiah 15:1-18:7 \n Galatians 1:1-24 \n Psalm 58:1-11 \n Proverbs 23:12",
		"image_url": "Empty at the moment",
		"today_command": "Watch out for false prophets. – Matthew 7:15"
	},
	{
		"devotion_id":14, 
		"devotion_title":"Title 0",
		"devotion": "“Let the bridegroom go forth of his chamber, and the bride out of her closet.” ( Joel 2:16). It is time for feeding-mothers and children to be found in the gathering of God’s people! Gathering with the saints is not a matter of our convenience. Though we may be living in cities where the life is fast, leaving one no spare time, we need to change and be delivered of our mentalities. If and when we are delivered of our natural mindsets and our attitudes, our feet will move, our pockets will not hold us back, and we will find the time to spend at His feet with saints who gather with this burden! There are so many churches today that consider they are the end-time church and they call themselves end-time people, but the people have no time to spend at His feet. They are only able to meet during the week-end! They only do whatever is convenient; as people of convenience they do not really have a true burden of the Lord. All that matters to them is the doctrine. They are ‘week-enders’! They are, therefore, a weakened people! May such ones come out of their deceptions in this hour! To be delivered of our mentalities, our eyes need to be opened to the things that the Lord is speaking. Otherwise, nothing will happen in our lives, and we shall remain a people blinded by the false glimmer of this world. This is the calling of God that is resting upon us.",
		"bible_reading": "Isaiah 19:1-21:17 \n Galatians 2:1-16 \n Psalm 59:1-17 \n Proverbs 23:13-14",
		"image_url": "Empty at the moment",
		"today_command": "Neither murmur ye, as some of them also murmured, and were destroyed of the destroyer. 1Corrinthians 10:10"
	},
	{
		"devotion_id":15, 
		"devotion_title":"Title 0",
		"devotion": "In Gen 11:3-9 of the Scriptures we read about a city that men began to build ‘unto God’. Beloved, we are living in times not very different from those ancient times. Many cities and towers are being built in the power and strength of man. “Let us make,” is what people are declaring all around us in these days. Even in the spiritual world, there are many towers coming up today; many cities are being constructed where men are boldly going all out to exalt their own name and make a name for themselves. In Babel, God brought confusion among men for He said, “Let us go down and confound them”. TheWord shows us that when sinful man built a city to make a name for himself, the Lord intervened and scattered them. In Genesis 12, the chapter following the Babel Chapter, we see how God called out one man out of the Ur of the Chaldees, a man who never knew the true God in his life. God’s hand came upon a man; and God’s mind was revealed to a family. There are many precious things in these chapters of Genesis, but through them what we see is that Abraham had a heart for God. He had a seeking heart, for he looked for a city whose maker and builder is God.",
		"bible_reading": "Isaiah 22:1-24:23 \n Galatians 2:17-3:9 \n Psalm 60:1-12 \n Proverbs 23:15-16",
		"image_url": "Empty at the moment",
		"today_command": "Follow me, and let the dead bury their own dead. – Matthew 8:22"
	},
	{
		"devotion_id":16, 
		"devotion_title":"Title 0",
		"devotion": "“For he (Abraham) looked for a city which hath foundations, whose builder and maker is God.” (Hebrews 11:10). In his quest for this city of God, Abraham went up and down the land of promise. As he moved from place to place he saw many cities. And when he saw a great city called Sodom he said to himself, “This is not the city that has been built by the hand of God.” He moved on and saw another city called Gomorrah and said, “No this city can never be the one that has been built by God”. So we see Abraham sojourning from city to city, but he saw that none of the cities could ever have been built by God. He was able to discern that in those cities everything was contrary to what God was showing him. So Abraham continued to sojourn in the land of promise with the concept that eventually he will find that city whose maker and builder is God. Though he moved from place to place, his divine conception never materialized. All the remaining years of his life he continued to seek for that particular city but he never found it. Over hundred years passed before he died, but Abraham never realized the fruit of his search! “These all died in faith, not having received the promises, but having seen them afar off, and were persuaded of them, and embraced them, and confessed that they were strangers and pilgrims on the earth. For they that say such things declare plainly that they seek a country. (Heb 11: 13,14)",
		"bible_reading": "Isaiah 25:1-28:13 \n Galatians 3:10-22 \n Psalm 61:1-8 \n Proverbs 23:17-18",
		"image_url": "Empty at the moment",
		"today_command": "Therefore, my beloved brethren, be ye steadfast, unmovable, always abounding in the work of the Lord, 1 Corinthians 15:58"
	},
	{
		"devotion_id":17, 
		"devotion_title":"Title 0",
		"devotion": "You have your liberty, your freedom, your opinions, your judgments on all matters, however, where will it take you? Are you willing to say, “Lord, I have the liberty but I surrender my liberty to You”. Are you willing to walk to the doorpost and say, “Lord I am willing? Leave a mark upon my ear that all can see for I am Your servant forever. I am sold out to you Lord. I am a servant for ever and not just for a few days but for all the days of my life.” Beloved, that is the challenge before us! Are you willing to undertake it? At a time when there is visible deterioration in the church at large, when the church has become a kind of ‘laughing stock’ before the world, and a platform for every kind of social activity, are you willing to go His way? That is a serious matter. The Lord is looking for an answer. The church is not called to start schools and orphanages for the social uplift of society. That is not the calling of the church. Today the church has become other than what she is called to be in God’s eternal plan. At what cost is the church indulging in all the social activities and sacrifices today? It is at the cost of her ‘High calling’! The Scriptures tell us clearly what the calling of the church is in the economy of God. So much is done at the cost of her primary call. God will surely judge His house ever so stringently!",
		"bible_reading": "Isaiah 28:14-30:11 \n Galatians 3:23-4:31 \n Psalm 62:1-12 \n Proverbs 23:19-21",
		"image_url": "Empty at the moment",
		"today_command": "Grow in grace, and in the knowledge of our Lord and Savior Jesus Christ. To him be glory both now and forever. 2 Peter 3:18"
	},
	{
		"devotion_id":18, 
		"devotion_title":"Title 0",
		"devotion": "I am convinced in my spirit that the last witness of this age is the testimony of the Lord and the coming wrath of God. It is not a world wide revival! The testimony and witness of the Lord shall be borne by a holy remnant that has been purged and purified in the fires of God’s disciplinary hand. We need to be a part of this precious, holy, remnant – a remnant that has beheld the Lord – a remnant that knows what is upon the heart of God – a remnant that has gone through the fires of His discipline. They will be those who know of His sorrow and experience His longings and desires. They will become partakers of His travail. They will be ones who have been worked upon by the hand of the Lord so that they may bear His testimony and be His witnesses. And as in Noah’s life, the Lord will bring forth a company that is purified in the fires of His workings, the nations and the church at large will reject them. They will totally reject their testimony and witness. They will not look for spiritual success and achievements in the manner of the world but accept the ways of the Lord in all the afflictions that may come their way. Be a part of this holy remnant by yielding yourselves to the workings of God. He will take you to the ultimate purpose He has for His people. What a tremendous calling rests upon each you!",
		"bible_reading": "Isaiah 30:12-33:9 \n Galatians 5:1-12 \n Psalm 63:1-11 \n Proverbs 23:22",
		"image_url": "Empty at the moment",
		"today_command": "For none of us liveth to himself, and no man dieth to himself. Romans 14:7"
	},
	{
		"devotion_id":19, 
		"devotion_title":"Title 0",
		"devotion": "“If any man desires to do His will (God’s pleasure), he will know (have the needed illumination to recognize, and can tell for himself ) whether the teaching is from God or whether I am speaking from Myself {and} of My own accord {and} on My own authority.” If any one desires to do God’s will and God’s good pleasure, then the Lord is willing to give the illumination or understanding needed to recognize what is of the Lord and what is of man. How precious this word is! Obedience will help us to know the truth. This is very important. Several people ask me, “Brother, how do I know this word is from the Lord?” This is a very common question. May be this question has also been upon your mind. The key lies in having a heart to obey what the Lord will speak or reveal from His word. Then when the Word of the Lord is read or heard, the Lord will give you the illumination to recognize His voice and know the will of God. I can humbly testify to this truth. Many are not able to accept the truth today because they do not have a heart to obey it. Are you living a life of obedience to His word and His voice or are you holding on to your own opinions, your own carnal thoughts, and your criticism of the ways of the Lord? If so, you will continue to miss the truth of the word. It is only when you are obedient to God’s word that you will know the truth.",
		"bible_reading": "Isaiah 33:10-36:22 \n Galatians 5:13-26 \n Psalm 64:1-10 \n Proverbs 23:23",
		"image_url": "Empty at the moment",
		"today_command": "Let us hold fast the profession of [our] faith without wavering; (for he [is] faithful that promised;) Hebrews 10:23"
	},
	{
		"devotion_id":20, 
		"devotion_title":"Title 0",
		"devotion": "We know that we have a lot of rough corners and edges in our lives. But the Spirit tells us not to worry about it. He will knock off those sharp corners and edges. All He asks is to give Him place in our lives. Our spiritual experiences in these days must be one of knocking off those spiritual edges and corners in our lives. God wants to do this work in us. Remember this city is a present reality. We have come to the city whose builder and maker is God. This is a work of God inside us. We have many rough edges and corners. If we are open to the Lord to admit this, our spiritual experience would consist of the removal of our irregular, sharp edges and corners by the Spirit of God. You know what these ‘corners’ are! You know what the ‘rough edges’ are! Some may think they do not have any corners; some may say that they do not have any rough edges! Often we do not see our rough edges, but we experience the rough edges that others have. God wants to work upon our lives. In the economy of God there is a present working and a preparation. Though we are bits of humanity in the hands of the Maker, nothing but poor pieces of raw material, yet the One who has picked us up says, “I will make you. My intention is to shape you, to mould you and make you a partaker of My nature. I have something upon My heart and I will perform it in your life. That is why I have brought you here.”",
		"bible_reading": "Isaiah 37:1-38:22 \n Galatians 6:1-18 \n Psalm 65:1-13 \n Proverbs 23:24",
		"image_url": "Empty at the moment",
		"today_command": "Know ye not that the unrighteous shall not inherit the kingdom of God? Be not deceived: 1Corrinthians 6:9"
	},
	{
		"devotion_id":21, 
		"devotion_title":"Title 0",
		"devotion": "“Jerusalem is builded as a city that is compact together:” (Ps 122:3 ). The city of God is compacted together. Peter said that you are God’s glory – lively stones put together as spiritual stones. God is building His city today. All awkward corners are being knocked off, compressed, compacted, and brought together in the Body. They are not loose stones but compacted stones brought together. They are fitting into God’s divine plan. As rough stones, (far removed from the polished, smooth stones that will be used to build the House), the Holy Spirit will subject us to separations and situations to deal with us. Most of the time, we want to have an easy and painless experience. We don’t like to be smoothened, yet we want to have a smooth time! What a tragedy that is! How can the love of God permit us to go our way when there is such a call upon our lives? If we would let Him have His way, it will be so different. God uses his divine ways to smoothen us. We will never have a smooth time until we have gone through the smoothening work of the Holy Spirit subjecting us to situations! He uses human sand paper to smoothen us out! What makes us smooth lively stones? It is the grace of God in sufferings and difficulties. That alone can smoothen us. We will never have a smooth time until we are made smooth!",
		"bible_reading": "Isaiah 39:1-41:16 \n Ephesians 1:1-23 \n Psalm 66:1-20 \n Proverbs 23:25-28",
		"image_url": "Empty at the moment",
		"today_command": "Prove all things; hold fast that which is good. 1Thessalonians 5:21"
	},
	{
		"devotion_id":22, 
		"devotion_title":"Title 0",
		"devotion": "“Nevertheless when the Son of man cometh, shall he find faith on the earth?” (Luke 18:8) This question would sober His disciples even today. This question would challenge each of us. There are depths to this question that surface as we meditate on it. Thousands of years have passed since the Lord came and died for us and yet the matter of faith is still in question. Shall He find faith on the earth today is a serious and solemn question? Will there be some people who will have true faith when He comes again? The question implies that true faith will be rare in our days. Beloved, this is not a loose statement of some itinerant preacher, but the word of the Lord Jesus Christ to His disciples. Shall He find faith on the earth when He returns? It is good to pause and think about His question in all seriousness. One can say in all sincerity that in no age has the teaching on faith been more than it is today. The largest gatherings today are the ones where faith is the main focus of attention. On the face of it there appears to be a great dependence on faith, but at the root of the lives of believers there is little evidence of true faith. In the midst of such an amount of faith preaching in these last days the Lord asks, “Will there be faith?” Was he wrong? Or was He true in what He said?",
		"bible_reading": "Isaiah 41:17-43:13 \n Ephesians 2:1-22 \n Psalm 67:1-7 \n Proverbs 23:29-35",
		"image_url": "Empty at the moment",
		"today_command": "Little children, let no man deceive you: he that doeth righteousness is righteous, even as he is righteous. 1John 3:7"
	},
	{
		"devotion_id":23, 
		"devotion_title":"Title 0",
		"devotion": "“And I fell at his feet to worship him. And he said unto me, See thou do it not: I am thy fellow servant, and of thy brethren that have the testimony of Jesus: worship God: for the testimony of Jesus is the spirit of prophecy.” (Rev 19:10). This is an oft misunderstood passage of the Scripture. The testimony of Jesus is the spirit of prophesy. True prophesy will always point to the Lord, not to some futuristic events. In some churches, the prophesies that are heard mostly concern up and coming events; but few of them point to Christ. These could be prophesies of coming events, events that God would like His people to know about, but in essence prophesy must point to the Lord and to His plan and purpose. A true understanding of prophesy will humble us before the Lord; it will never make us proud of our imagined knowledge of coming events. A true understanding of prophesy will really humble us more than bring excitement. True knowledge of prophesy will never make us proud. If God in His mercy allows us to have some understanding of what is going to happen or take place in these last days, to see how wrong things are today and how they ought to be, then we must be humble. The testimony of Jesus Christ is the Spirit of prophesy. The testimony of Jesus Christ is the spirit behind every ministration.",
		"bible_reading": "Isaiah 43:14-45:10 \n Ephesians 3:1-21 \n Psalm 68:1-18 \n Proverbs 24:1-2",
		"image_url": "Empty at the moment",
		"today_command": "Let us put on the armor of light. Romans 13:12"
	},
	{
		"devotion_id":24, 
		"devotion_title":"Title 0",
		"devotion": "What is the glory of God? The writings of the apostle John tell us that the glory of God was His Son. That is what we read as we go through the writings of John and the gospel of John. John says, “We beheld His glory, the glory of the only begotten of the Father, full of Grace and Truth”. The glory of God was in His Son. May this be a foundation for our inward lives. In all that we heard there are certain precious truths that need to be laid as a foundation in our lives. In the forthcoming days the Scriptures will open unto us in fresh ways if we closely hold on to this truth. Paul says in Eph 3:21, “Unto him be glory in the church by Christ Jesus throughout all ages, world without end. Amen.” Paul says the church has to be a vessel for the glory of Jesus Christ. Though there are many statements from God’s Word that tell us about the glory of God, they do not really define and explain what the glory of God is. However, we do find one verse in the Bible that actually defines the glory of God. John 1:14 tells us, “And the Word was made flesh, and dwelt among us, (and we beheld his glory, the glory as of the only begotten of the Father,) full of grace and truth.” Beloved, the glory of God is the absolute satisfaction of His Divine nature.When God is able to see something that identifies with His own nature and all that is His then that something has the glory of God.",
		"bible_reading": "Isaiah 45:11-48:11 \n Ephesians 4:1-16 \n Psalm 68:19-35 \n Proverbs 24:3-4",
		"image_url": "Empty at the moment",
		"today_command": "Ye are bought with a price; be not ye the servants of men. 1Corrinthians 7:23"
	},
	{
		"devotion_id":25, 
		"devotion_title":"Title 0",
		"devotion": "We may not know the correct sequence of end time events because the Lord has not revealed all things to us, but if we are not mistaken in our knowledge of the Lord, His purpose and His will, then we would not be wrong and would have done well. Many preachers and teachers are totally caught up with the sequence of events that are to come about in the end times but they neglect practical, day to day realities. What is most important is to have a correct knowledge of the Lord, His purpose and His will for our present lives. This would enable us to stand before Him on better ground. This is what the majority of Christians are missing today! Saints, never be troubled about the events and how they are to unfold. We need to hold on to Him and His testimony in our lives. When we are caught up with His testimony on the earth then other things will be taken care of. Let us remain focused on Him, for the spirit of prophesy is the testimony of Jesus Christ. There are events that would come to pass and the Lord unfolds them to us. But that unveiling is not to give us a detailed knowledge of some future events. The revelation and knowledge of those events are given to us to show that the Lord Jesus is the centre of those future events.",
		"bible_reading": "Isaiah 48:12-50:11 \n Ephesians 4:17-32 \n Psalm 69:1-18 \n Proverbs 24:5-6",
		"image_url": "Empty at the moment",
		"today_command": "Do ye look on things after the outward appearance? 2Corrinthians 10:7"
	},
	{
		"devotion_id":26, 
		"devotion_title":"Title 0",
		"devotion": "Ezekiel’s name means, ‘to whom God will strengthen’. He was born the son of a priest and without doubt he was a priest himself (Ezekiel 1:3). But he was in captivity and there was no priestly duty there. So the Lord brought a change in him and in his ministry! Beloved, God is more interested in men than in doctrines. It is because of this that Jesus poured out His life for men - for you and me, and not for a doctrine. The Lord therefore, changed and commissioned Ezekiel into a prophet. Many do not like such changes today. Often people prefer to do what they have been doing for ages. They are not willing for a change. In Christian circles one can see sons succeeding their fathers in the ministry and taking up the same message, style and organization. But it was not so with Ezekiel. He did not say, “My father was a priest and I shall be a priest and die as a priest”! He was changed by the Lord. We have an example of this in the life of John the Baptist. He too was the son of a priest named Zechariah; he too could have found a good career in the same order. But while his father was ministering as a priest in the temple at Jerusalem, he was ministering in the wilderness as God’s prophet! God is surely looking today for men that He could use, to stand before people on behalf of God.",
		"bible_reading": "Isaiah 51:1-53:12 \n Ephesians 5:1-33 \n Psalm 69:19-36 \n Proverbs 24:7",
		"image_url": "Empty at the moment",
		"today_command": "Finally, my brethren, be strong in the Lord, and in the power of his might. Ephesians 6:10"
	},
	{
		"devotion_id":27, 
		"devotion_title":"Title 0",
		"devotion": "Men can do wonders to impress another soul. They can make their faces and their words appealing to others people. In contemporary Christianity, many leaders do that. They publish their pictures airbrushed with the help of computers and graphics to appeal to the natural desires of other people. Saints, this glory of God lies far beyond any kind of human manipulation. The glory that God looks to relates to God’s own nature. God will not delight and be satisfied by anything of man. His satisfaction rests in that which bears the mark of His Son and His Spirit. Many people deceive themselves as well as others in these last days by doing things only meet the satisfaction and delight of other men. But God cannot be fooled by any man. So let us come to the grips with this word. Let us be concerned with Divine satisfaction. Let that be the place of our dwelling and walk. Let us say, “Lord, You have brought me to a new ground, You have released my spirit, and I want to hold on to that ‘glory’ and move in the pathway of Your glory all my life. I do not want a clouding of this glory in my life. I don’t want anything to come between me and my God. I only want a Divine satisfaction.” Sometimes it becomes so visible that others ask, “what happened to him?” Let that glory of divine satisfaction be a foundation.",
		"bible_reading": "Isaiah 54:1-57:14 \n Ephesians 6:1-24 \n Psalm 70:1-5 \n Proverbs 24:8",
		"image_url": "Empty at the moment",
		"today_command": "If ye then be risen with Christ, seek those things which are above, Colossians 3:1"
	},
	{
		"devotion_id":28, 
		"devotion_title":"Title 0",
		"devotion": "We live in a world that teaches us to boast about ourselves and promote ourselves People are taught to inflate and exaggerate their bio-data and resumes to show how good and capable they are. It is become common to lie about themselves, their achievements and their accomplishments when seeking for a job! I know of cases where young brethren working in the field of information technology were told to embroider and overstate things in order to get lucrative job assignments. However, it is to their credit that they denied to do so and chose to wait for the Lord’s will to be done. Nevertheless it is true that the competitive nature of the secular world compels people to boast about themselves. People even have to brag of things they cannot do! That is where the world is! It is vicious out there! The world teaches us to be selfconfident and superior. That is the way of life of the world. We have to live in the same world and cannot run away. We are not called to isolate ourselves as a hermit and remain far from living realities. The Lord says we are to be in the world but not of the world. Our life is governed by a greater purpose and that is what should govern our daily life. Though we have a world system around us, we must be mindful of who and what we are in the Lord, for this world shall be judged by One Man in righteousness.",
		"bible_reading": "Isaiah 57:15-59:21 \n Philippians 1:1-26 \n Psalm 71:1-24 \n Proverbs 24:9-10",
		"image_url": "Empty at the moment",
		"today_command": "Let no man despise thy youth; but be thou an example of the believers 1Timothy 4:12"
	},
	{
		"devotion_id":29, 
		"devotion_title":"Title 0",
		"devotion": "One of the characteristics of the NewTestamentWord is that it is ‘new’. In Christ Jesus there is a ‘new’ creation. We read about the ‘new’ man in Christ Jesus. We read about a ‘new’ life, a ‘new’ way and life, a ‘new’ man etc. Finally as we come to the book of Revelation, we come to the ‘new’ heaven and the ‘new’ earth and New Jerusalem. In the New Covenant all is new – a new life, a new creation, a new man, a new way of life and so on and so forth. Remember, that the word ‘new’ implies that there is or was something old. It is a word that conveys a comparison and a contrast. So there was an old Jerusalem, there was an old creation, and there was an old man. But the old has gone and the new has come. The old Jerusalem has been brought under God’s judgment. And when the old was put away the new was brought in. May God help us to see that! If we have to see what is new in God we have to be under the government of the Holy Spirit. We have yet to see the meaning of this City more clearly, but for the moment we take a look at this word ‘new’ again. If something is new, it means that it is completely fresh. It is new and fresh. When we consider OldTestament history what a tragic story we read concerning the ‘old’ Jerusalem. It is a story of tragedy because of the sin of God’s people. But the New Jerusalem — the new people that God is bringing forth — is just opposite to that which is old.",
		"bible_reading": "Isaiah 60:1-62:5 \n Philippians 1:27-2:18 \n Psalm 72:1-20 \n Proverbs 24:11-12",
		"image_url": "Empty at the moment",
		"today_command": "Let love be without dissimulation. Abhor that which is evil; cleave to that which is good. Romans 12:9"
	}
]