[
	{
		"about":"We are a fellowship of brethren in ministry, drawn from different parts of India. We are joined together by the Spirit into a relationship with the Son, the Lord Jesus Christ, for fulfilling His eternal purpose. The vision that holds us together is the vision of God's Eternal Son and His glorious Bride, the Church. Our burden is the fullness of Christ. It is not about the establishment or extension of a movement, the propagation of a particular teaching, nor the constituting of a new “Fellowship”—but CHRIST! We have no tradition to maintain and nothing on this earth that we wish to preserve. We believe that we have, however little, something of God's thoughts and intentions for His Son.",
        "vision":"We are so grateful to our Lord, for He has convicted us that He has called some to be overcomers who will qualify to rule and reign with God. The burden the Lord has laid upon our hearts is this vision. We believe this is important and should affect all our evangelical efforts.",
        "individual": "We consider every soul saved as a candidate for sonship, heirship, and throneship. The kingdom of God is concerned with quality, character, holiness, righteousness, and maturity, which are revealed in Christ. But “as long as the inheritor (heir) is a child and underage, he does not differ from a slave although he is the master of all the estate” (Galatians 4:1, Amplified Bible). The child is temporarily under an order of discipline and submission. He is accountable to tutors and governors. “He is under guardians and administrators or trustees UNTIL the date fixed by the father” (Galatians 4:2, Amplified Bible). However, when the child grows into adult sonship, he acquires a new place of authority in the household. He receives authority from the Father and is to wield that rod of authority. Our vision for the individual is that God has a definite program for mature sons in His divine economy. A true local church is the family where these sons are developed and brought into maturity, ready for adoption. Such local churches ought to be under the divine governmental pattern of five-fold ministries, the tutors, and governors.",
        "corporate": "While growing into sonship is an individual and personal matter, spiritual adoption is a corporate matter. Our heavenly Father will not adopt us as individuals. An individual cannot come into his inheritance as an heir all by himself. It is only in a related way that an individual can enter into his inheritance. \n Joshua and Caleb were ready to go into the Promised Land to claim their inheritance, but they could not enter in as individuals. God wanted to bring a whole nation into Canaan, not just two individuals. God is building such a company, even the true Body of Christ, a company that shall be brought into all the ‘glory of Christ’. Here and now, in this realm of time, a people shall manifest and reveal Christ. \nThere shall come a time when God has a vessel, a corporate vessel, in and through whom His glory will shine forth in this universe. We see this as the New Jerusalem, the glorious Bride coming down from heaven, having the glory of God. The end which God has in view for a people is to be, in a spiritual sense to His universe of spiritual intelligence, what the sun is to this universe; that every nation may walk in the light thereof; that there be no need of the sun or the moon, for there is no night. This is to say that God wills to have a people full of light—the light of the knowledge of the glory of God.",
        "dispensation": "The quality and specialty of this dispensation is that it is the dispensation of the fullness of time. All previous dispensations were partial, incomplete, and unsatisfactory. They all arrived up to a point and could go no further. They waited for another phase of God’s workings. However, it is in this dispensation that the eternal God will gather up all things in Christ, in completion to His work (Ephesians 1:10). The times are made full in this dispensation. All that did not arrive at its fullness, finality, and completion in all the other ages will be made full and complete in this dispensation. \n\t This dispensation refers back to all the past dispensations and also refers to the future dispensations. From this dispensation, the future dispensations will take their character and nature. The past and the future dispensations converge in this dispensation. \n\t This dispensation is governed by the full meaning of Christ, while all the others were in fragments and parts (Hebrews 1:1). This dispensation will gather up in one all things in heaven and all things on the earth under one Head, the Lord Jesus Christ. \n\t This dispensation is the dispensation of the Holy Spirit. He is the custodian of God’s eternal purpose. Whenever God has moved to realize any part of His comprehensive purpose, He has always done so by the agency of the Holy Spirit. The Spirit of God has been the wisdom, power, energy, initiator, sustainer, and consummator of that which God has at any time taken in hand to bring about. We see this in the creation of the literal universe: the Spirit of God is the agent seen initiating, pervading, conducting, and always in evidence in relation to the bringing of this cosmic order into being. So it shall be in the bringing of the new spiritual cosmos into being. \n\t Man is totally incapable of realizing any part or fragment of the great purpose of God for this dispensation without the Spirit of God. No part of it will be realized by man. The advent of the Holy Spirit at the beginning of this dispensation is the divine declaration that God must do His work Himself, or it will never be done!",
        "belief": "\n<ul><li> The Holy Scripture is the inspired Word of God. It is divinely inbreathed, infallible, inerrant, and authoritative. It is the all-sufficient rule of faith and practice, necessary for our growth and development to full stature as mature sons of God.</li> <li> We believe in the unity of the one true and living God revealed in the Father, Son, and Holy Spirit.</li><li> The Lord Jesus Christ was born of a virgin. We believe in His eternal deity, His sinless humanity and perfect life, the eternal all-sufficiency of His atoning death, His bodily resurrection, His ascension to the Father’s right hand, and the literal, bodily, and personal return of the Lord Jesus Christ to the earth in power and glory.</li><li> All men are lost apart from the saving grace of God.</li><li> Sin is cleansed only through personal repentance and faith in the precious blood of Jesus Christ.</li><li> Water baptism of believers is for the remission of sin after repentance (Acts 2:38, Mark 16:16). </li><li> All born-again believers have a command to be filled with the Holy Spirit according to the experience of the early church found in the book of Acts (chapters 2, 8, 10, 19, etc.). </li><li> The restoration of the gifts of the Holy Spirit and the five-fold ministries in Ephesians 4:11 in the Church today to bring her to perfection. </li><li> It is the privilege and duty of every Christian, with a holy life, to be ‘occupied’ in doing His will, as they watch and should always be ready for the Lord’s appearing (1 John 3:1-3). </li><li> We believe in the soon and personal return of the Lord Jesus Christ to this earth and in the resurrection of the saints.</li></ul>",
        "covenant": "<ol> <li> I confess that the Lord has placed me in this fellowship/church for His purpose to be fulfilled in me, acknowledging that this church will grow up to be a part of that glorious Church of which Jesus said He would build (Matthew 16:18). </li><li> I hereby covenant to commit myself to the Pastor/Elders, Cell Group Leaders, and other members in a relationship of love, honesty, loyalty, trust, respect, acceptance, mutual submission, and correction so that we may grow together as a local expression of the Body of Christ (1 Thessalonians 5:12-13, Hebrews 13:17, Ephesians 5:21). </li><li> I promise to give priority to worship meetings, Bible study gatherings, and other occasions for studying God’s Word and for prayer (Hebrews 10:24-25, Acts 2:42). </li><li> I covenant that I shall deny myself and take up the cross as a true disciple and shall live under the Lordship of Christ so that every area of my life—personally, financially, and materially, including my behavior—gives honor to the Lord Jesus Christ (2 Peter 1:4-11, Galatians 5:18-26, Ephesians 5:3-5, 2 Corinthians 7:1, Ephesians 6:1-2, Colossians 3:21, Ephesians 5:23-25, 1 Thessalonians 4:11-12). </li><li> I promise that I will constantly strive for the unity of the Spirit, being prepared at all times to reconsider my individual interpretations of the Scriptures to ensure the unity of the Spirit in love, being ready to flow with the direction and guidance through the Brothers in leadership in the church. At the same time, I commit myself to allow the Spirit to lead us into all truth, being ready to submit myself to the Word of God at all times (Matthew 12:25, Ephesians 4:13, 2 Peter 1:20, 1 Timothy 1:3-4). </li><li> I promise to seek to be constantly filled with the Holy Spirit and seek to be led by the Spirit, being ready at all times to allow the Spirit to operate His gifts through me as He wishes. I will be open to corrections from the Leaders/Elders (Acts 2:4, Romans 8:14, Ephesians 5:18-19, 1 Corinthians 12:6-7, 11, 18; 1 Corinthians 14:29). </li><li> I covenant that I will lay aside my individual interests by allowing the cross to work in my life for the building up of the Body of Christ, and I will submit to the Lord at every stage so that God may be glorified (Ephesians 2:13-16). </li><li> I covenant that I shall not gossip or slander or have any destructive criticism about other members or church leaders, but will stand with one another to safeguard against any slander coming from outside. (James 4:11, 1 Pet 2:1, Gal 5:15, Rom 16:17, 2 Tim 2:16-17, Eph 5:4-8, Eph 4:25-32, 1 Thess 5:11, Rom 14:19). </li><li> I promise to give myself supremely to My Lord and to labor together in prayer and in work till I see the Lord build His Church in this city.</li></ol>"
    }
]