[
	{
		"devotion_id":0, 
		"devotion_title":"Title 0",
		"devotion": "The convicting work of the Spirit is the first step.  That will be followed by a conforming work of the Spirit.  That is where we have to be open to the Holy Spirit to reconsider many things in our lives.  We may have made many promises or plans, or taken many decisions in our lives; but if we are open to the Spirit, we will be ready to change them and pay the cost involved.  When we are able to reconsider those decisions and promises in the light of the Spirit, then we know that we are open to the conforming work of the Spirit; and it will eventually result in a deeper work of the life of Christ within. \n\t We are often quick to keep the promises we may make to men; but in matters of the Lord, we hesitate and often justify ourselves and do not fulfill our promises to the Lord.  We prefer not to sacrifice the desires of our flesh at the altar of the Lord.  I do believe that there are many readers who need this counsel, for as much as their growth in the Lord is in danger of becoming stagnant.  Be prepared to undo your decisions, to walk away from the promises you may have made, and to reconsider your plans if you are open to the convicting work of the Spirit.  Then you will experience a greater measure of the life of Christ.   ",
		"bible_reading": "Deuteronomy 18:1-20:20 \n Luke 9:28-50 \n Psalm 73:1-28 \n Proverbs 12:10 ",
		"image_url": "Empty at the moment",
		"today_command": "If any man love not the Lord Jesus Christ, let him be Anathema Maranatha. 1 Corinthians 16:22 "
	},
	{
		"devotion_id":1, 
		"devotion_title":"Title 1",
		"devotion": "From the very beginning, there has been an incorrigible propensity in man to lay his hands upon the divine things of God.  This has been man’s tendency—to put his hand possessively and firmly upon the things which are of divine nature, to bring it under his control.  This was Lucifer’s sin which led to his fall. He also put this spirit in man.  God therefore calls it an evil.  It is evil when God is removed from His place.  If God is taken out of His place, it is evil.  In other words, it is the evil of dividing God’s place, of insinuating man’s independence and implying man’s ability.   This is seen at the heart of humanism, of autocracy – the flesh!   It is the principle of an uncrucified heart.  Man’s ability and independence, the flesh of man and the uncrucified heart always want to impinge upon what is of divine nature.  It is like the uncircumcised Philistines who always wanted to come against that which is of God.  This is full of significance.  Until David came fully and pre-eminently to the throne, the Philistines were not completely rooted out of Mount Zion.  That signifies that they always wanted to impinge upon the throne and the rule.  Let us bear in mind that there is a hand against the throne.  Not until Christ is absolutely Lord will this tendency to self-assertion be overruled completely!",
		"bible_reading": "Deuteronomy 21:1-22:30 \n Luke 9:51-10:12 \n Psalm 74:1-23 \n Proverbs 12:11",
		"image_url": "Empty at the moment",
		"today_command": " If a man be overtaken in a fault, ye which are spiritual, restore such an one in the spirit of meekness; Galatians 6:1 "
	}, 	
	{
		"devotion_id":2, 
		"devotion_title":"Title 2",
		"devotion": " The Lord gave a great commission to His disciples to go into all the world, but he also said,  “And, being assembled together with them, commanded them that they should not depart from Jerusalem,.” (Acts 1:4).  Five hundred people heard these words that He spoke just before He ascended to the heavens.  But 380 people left the gathering day after day till, only 120 were finally left.  With a fresh command and commission from the Lord to go and preach, accompanied by the promise of His presence, and the whole world before them (Matt. 28:19-20), they were told to wait till they received the baptism of the Holy Spirit.   The command was to ‘go’, but also ‘not to go’.  They were so given to the Holy Spirit after they were filled with the Spirit, that they did not move out of Jerusalem for almost 15 years, though they were full of the power of the Holy Spirit and His might.  They waited for the  word ‘go’.  Today the scene is so different.   People quote the great commission and command in Matthew 28 and verses 19 and 20, and they go where they want to go.   All that people hear is “GO”.  They never hear a word ‘not to go’.  If the Holy Spirit told them ‘not to go’, they would not hear His voice because they are so full of their own voices.  The Lord commanded them to go, and yet also not to go, but to wait!  It is God.  It is go, but don’t go—that is difficult!  ",
		"bible_reading": "Deuteronomy 23:1-25:19 \n Luke 10:13-37 \n Psalm 75:1-10 \n Proverbs 12:12-14 ",
		"image_url": "Empty at the moment",
		"today_command": "Comfort the feebleminded, support the weak, be patient toward all [men]. 1Thessalonians 5:14"
	},
	{
		"devotion_id":3, 
		"devotion_title":"Title 3",
		"devotion": "Beloved, the calling of God demands a separation from much that is going on in contemporary Christian world.  How can you live in a place where man’s system is being promoted?  How can you sit there and appreciate those things?  You can never do so if your eyes have been opened  to see the reality in the Son.  Some people take the example of Apostle Paul preaching in synagogues, as a reason to explain their own attitude and behavior regarding their visits to organized gatherings or denominational meetings functioning in the systems of men.   However, they fail to understand that firstly, Paul was living in a time of transition between the end of the old order and the coming in of the new order, which is the church age; and secondly, he was always thrown out of the synagogues after he had delivered the first or second word and message of truth!  Today, however, we are not living in the time of a transition.  Saints, we cannot promote all that is happening in the majority of Christian gatherings, for much of it is contrary to the word of God.  We must maintain this separation.  We need to be discrete and also discriminate.  ",
		"bible_reading": "Deuteronomy 26:1-27:26 \n Luke 10:38-11:13 \n Psalm 76:1-12 \n Proverbs 12:15-17",
		"image_url": "Empty at the moment",
		"today_command": "Ye withdraw yourselves from every brother that walketh disorderly.  2 Thessalonians 3:6 "
	},
	{
		"devotion_id":4, 
		"devotion_title":"Title 4",
		"devotion": "Writing his last letter to his spiritual son, Apostle Paul says these words: “Preach the word; be instant in season, out of season; reprove, rebuke, exhort with all longsuffering and doctrine. For the time will come when they will not endure sound doctrine; but after their own lusts shall they heap to themselves teachers, having itching ears;  And they shall turn away their ears from the truth, and shall be turned unto fables.”  (2 Ti. 4:2-4) The Amplified Version says, “Herald and preach the Word! Keep your sense of urgency [stand by, be at hand and ready], whether the opportunity seems to be favorable or unfavorable. [Whether it is convenient or inconvenient, whether it is welcome or unwelcome, you as preacher of the Word are to show people in what way their lives are wrong.] And convince them, rebuking and correcting, warning and urging and encouraging them, being unflagging and inexhaustible in patience and teaching. For the time is coming when [people] will not tolerate (endure) sound and wholesome instruction, but, having ears itching [for something pleasing and gratifying], they will gather to themselves one teacher after another to a considerable number, chosen to satisfy their own liking and to foster the errors they hold, And will turn aside from hearing the truth and wander off into myths and man-made fictions.” (2 Ti. 4:2-4)  ",
		"bible_reading": "Deuteronomy 28:1-68 \n Luke 11:14-36 \n Psalm 77:1-20 \n Proverbs 12:18 ",
		"image_url": "Empty at the moment",
		"today_command": "Them that sin rebuke before all, that others also may fear.  1 Timothy 5:20 "
	},
	{
		"devotion_id":5, 
		"devotion_title":"Title 5",
		"devotion": " These are not the days to make provisions for our desires and ways or for our own ambitions and our plans.   God’s remnant needs to sense the urgency of the times in their hearts.  These are not the days to be offended in our hearts or to make provisions for our own desires.  A sense of urgency must rule God’s people in these days.  The very issues and things for which some parents paid a great price at one time,  are being lost by the younger generation.  We are living in times when the spiritual things we once acquired by paying a great price, are now being lost by our children.  Let us, therefore, nurture a sense of urgency in our spirit in this hour to bring forth correction.  Let us parents not become weak before our children because we love them and lose the ground that we so far have gained by our obedience.  That is where we need to honor God more than our children.  I am reminded of a Scripture which says, “For Moses had said, Consecrate yourselves today to the LORD, even every man upon his son, and upon his brother; that he may bestow upon you a blessing this day (Exod. 32:29).  It was a tremendous call and these people did it.  They consecrated themselves upon their own children and kith and kin.  The blessing they received was that they were chosen to be priests unto the Lord! ",
		"bible_reading": "Deuteronomy 29:1-30:20 \n Luke 11:37-12:7 \n Psalm 78:1-31 \n Proverbs 12:19-20",
		"image_url": "Empty at the moment",
		"today_command": "Remember them which have the rule over you, who have spoken unto you the word of God.   Hebrews 13:7 "
	},
	{
		"devotion_id":6, 
		"devotion_title":"Title 6",
		"devotion": "In our lives we stand in a great danger if we have the language, the phraseology, the terms, the tones and the terminologies.  It can all be an outward thing in our lives, mere appearance and pretense.  The other great danger is that there can be an association with all that is right and true in God’s word outwardly. God is not raising organizations and associations, He is building His Body.   Therefore, wherever we may be, God wants us to be true to His higher calling.  I know in my heart that we are joined together in the eternal purpose of God in His Son.  That is what brought us together, and also keeps us together.  People who are living an outward kind of life, without experiencing the inner reality are nothing but 'chaff', for inside they are empty.  How many live like that?  It is good to examine our lives to see what really moves, motivates and propels us to be a part of the body of Christ.  Let the prayer of the psalmist be the prayer of our heart, “Lord search me, and know my heart today, and see if there is any way in me that is not in line with Your own heart,” \n\t If we feed on 'chaff' we will end up as 'chaff'.  We will become whatever we feed upon!",
		"bible_reading": "Deuteronomy 31:1-32:27 \n Luke 12:8-34 \n Psalm 78:32-55 \n Proverbs 12:21-23 ",
		"image_url": "Empty at the moment",
		"today_command": " Grudge not one against another, brethren, lest ye be condemned: behold, the judge standeth before the door. Jam 5:9 "
	},
	{
		"devotion_id":7, 
		"devotion_title":"Title 7",
		"devotion": "Nehemiah was called to restore the testimony of the Lord; he was called to restore the walls of Jerusalem, which is the picture of the testimony of the Lord.  He had heard the call clearly, but the conditions of God’s people, of the Temple and of the city of Jerusalem which is ‘the beauty of the whole earth’, were in ruins.  Nehemiah sat and wept over the condition of God’s people and the agony of the Lord.  He was broken and disquieted, but he never knew that he was entering into the fellowship of His suffering.  Beloved, the Spirit of God desires to bring His remnant into a place of brokenness where they shall also enter the threshold of experiencing the fellowship of His suffering in this hour.  As a result of God’s workings in our lives, we shall surely experience brokenness within as we move on and travail with the burden of the Lord.  People may view our sorrow as mere emotional outbursts, but God knows what lies in their hearts and what He is doing in our lives.  Nehemiah was a man who entered into the fellowship of His suffering; he touched the heart, the pain, the suffering, and the testimony of God.  And he went on alone in the anointing and the power of the Holy Spirit upon his life.  He was just a simple, common man but God was with him.  He was a man in fellowship with God’s suffering. ",
		"bible_reading": "Deuteronomy 32:28-52 \n Luke 12:35-59 \n Psalm 78:56-64 \n Proverbs 12:24",
		"image_url": "Empty at the moment",
		"today_command": " A man that is an heretick after the first and second admonition reject; Titus 3:10 "
	},
	{
		"devotion_id":8, 
		"devotion_title":"Title 8",
		"devotion": "The opposition did not delay in hounding Nehemiah.  Allegations, accusations and contentious arguments blaming Nehemiah for wanting to make a name for himself and that he wanted to rule over the lives of others, were aired freely by the enemies of God’s purpose.  However, these made no dent upon Nehemiah’s spirit, he knew what he had to do and what he was into.  He did not attempt to justify himself.  He went on with what God had called him to do.  If you are a man or a woman who has heard the voice of God, you will not be concerned with what people say.  What is important is hearing God and walking in obedience to His will.  Let us be in a place of hearing the Lord, seeking to do His will and meet His need in this hour.  Jeremiah, the prophet of God, was a suffering servant acquainted with sorrow and grief.  All that mattered to him was to fulfill the calling of God.  And God vindicated this man.  The opinion of men, the prevailing situations and circumstances, and the reproaches of the people did not discourage him.  He was not troubled about his future; he had no fears; he left it all in the hands of the Lord.  ",
		"bible_reading": "Deuteronomy 33:1-29 \n Luke 13:1-21 \n Psalm 78:65-72 \n Proverbs 12:25 ",
		"image_url": "Empty at the moment",
		"today_command": "  Repent; or else I will come unto thee quickly, and will fight against them with the sword of my mouth. Revelation 2:16 "
	},
	{
		"devotion_id":9, 
		"devotion_title":"Title 9",
		"devotion": "Some people who lived in Old Testament like David, saw what God desired in their lives.  David  therefore cried out, “Lord, You desire truth in the inward parts.”  David went beyond his times and was able to see what was upon the heart of God.  Reality lies only in a life lived inwardly.  Today, many still live according to outward manifestations and observances which identify them to Old Testament standards.  Although they are living in the New Covenant, they are in reality living under the Old Covenant. Inwardly they are still in bondage and subject to many other things, but outwardly they show something different.  The Lord said that He would put His law within them.  This refers to a change of nature.  God also promises to give us the means to live an inward life.  The ‘means’ is Christ, the Son of God.  “Christ in you the hope of glory” is the reality of the New Covenant, as mentioned in Col. 1:27.  The means to live this Christian life is through Christ living in us by the Holy Spirit.  The law was placed in our hearts by the Lord.  The Bible in 2 Cor. 4:6 says, “For God, who commanded the light to shine out of darkness, hath shined in our hearts, to give the light of the knowledge of the glory of God in the face of Jesus Christ.”  Amen!",
		"bible_reading": "Deut34:1-Joshua 2:24 \n Luke 13:22-14:6 \n Psalm 79:1-13 \n Proverbs 12:26",
		"image_url": "Empty at the moment",
		"today_command": "And said unto them that sold doves, Take these things hence; make not my Father's house a house of merchandise.    John 2:16"
	},
	{
		"devotion_id":10, 
		"devotion_title":"Title 10",
		"devotion": "Today compromise is seen as broadmindedness.  To be tolerant of evil is considered a great virtue in these times, and it is often contrary to the narrow way of the cross.  Many people are against us on account of the path we choose, which is the strait and narrow way, come what may.  Today many broadminded preachers are crowd-pullers because they pull down the narrow gates of the kingdom of God and make them broad!   The prophets suffered to go the narrow way while false prophets gave room to people to take the broad way by compromising the truth.  The reality is that the multitudes will always take the broad way of ease and convenience.  Large numbers attend churches primarily because they follow the broad way.  These mega churches have become a status symbol for the believers of today. They are essentially a company of compromisers.  Many come to church to identify with big congregations and to avail of their social facilities for marriage and burial.  But if anyone wants to be a part of a small company of truth-seekers, they will surely be ex-communicated.  Today, one has to pay a great cost to continuously stand for the truth and walk the narrow way.  Truly, it takes faithfulness to reach the destiny of our calling.    ",
		"bible_reading": "Joshua 3:1-4:24 \n Luke 14:7-35 \n Psalm 80:1-19 \n Proverbs 12:27-28 ",
		"image_url": "Empty at the moment",
		"today_command": "But now ye also put off all these; anger, wrath, malice, blasphemy, filthy communication out of your mouth.    Colossians 3:8 "
	},
	{
		"devotion_id":11, 
		"devotion_title":"Title 11",
		"devotion": "2 Tim. 1:8 “Be not thou therefore ashamed of the testimony of our Lord, nor of me his prisoner: but be thou partaker of the afflictions of the gospel according to the power of God;” \n\t It was very costly to stand for the Lord in the days of the early church.  For anyone to show allegiance to a man like Paul meant ostracism and prison; it touched and affected every area of the soul.   It was a great triumph for a young man to stick loyally with Paul to the very end!  Apostle Paul knew the afflictions which came upon men for preaching and professing the Gospel; for though the Gospel is a gospel of peace, yet, through the corruption and depravity of men, it brings a sword, division, and trouble. Tribulation arises on account of it; and this should be endured patiently and constantly, for the sake of it.  He told Timothy, “Take your share of the sufferings.”  And Timothy did not hesitate to take the counsel of Paul. \n\t It costs us to be faithful, to be loyal, and to be courageous.  It puts our popularity and acceptance at jeopardy.  It is costly to sponsor an unpopular but valuable cause and ministry! ",
		"bible_reading": "Joshua 5:1-7:15 \n Luke 15:1-32 \n Psalm 81:1-16 \n Proverbs 13:1",
		"image_url": "Empty at the moment",
		"today_command": "Let all things be done decently and in order. 1 Corinthians 14:40 "
	},
	{
		"devotion_id":12, 
		"devotion_title":"Title 12",
		"devotion": " God had chosen Israel out of many other nations.  We need to recognize that God chose the Hebrew nation to be a representation in history of His eternal and heavenly thought for mankind and the world.  It must be clearly understood that God’s sovereign thought lay behind Israel’s election and selection.  The workings of God over Israel were based on Divine thought and wisdom.  That explains God’s mighty sovereign acts in that nation, His mighty ways in securing that nation.  It also explains the infinite pain and patience He had taken in bearing with those people.  It also explains God’s grace and love towards a nation that tested Him to an extreme degree.  We see God’s sovereignty working in this nation over a period of many years.  In constituting this nation, as well as in forming this nation, God initiated many precious precepts.  In other words, in constituting and forming the nation of Israel, God brought into play several spiritual features.  It is not like the constitution and formation of other nations in the world.  It is of great importance for God’s people to understand that God brought in the spiritual features of His very Son, in a symbolic way, to form this nation and constitute it.    Their only specialty was that the spiritual features of the Son were constituted in them in a symbolic way.",
		"bible_reading": "Joshua 7:16-9:2 \n Luke 16:1-18 \n Psalm 82:1-8 \n Proverbs 13:2-3 ",
		"image_url": "Empty at the moment",
		"today_command": "Whether therefore ye eat, or drink, or whatsoever ye do, do all to the glory of God.   1Corrinthians 10:31"
	},
	{
		"devotion_id":13, 
		"devotion_title":"Title 13",
		"devotion": "“Thus saith the LORD, Let not the wise man glory in his wisdom, neither let the mighty man glory in his might, let not the rich man glory in his riches:   But let him that glorieth glory in this, that he understandeth and knoweth me, that I am the LORD which exercise lovingkindness, judgment, and righteousness, in the earth: for in these things I delight, saith the LORD.”  Jer. 9:23,24.  The Lord tells of His disapproval of man’s wisdom, man’s might and man’s riches.  At the same time the Lord tells man what He approves—the glory of His Name and His Son. These three things, man’s wisdom, power and riches, are not evil in themselves.  The Lord is not condemning these things. Wisdom in itself is not wrong, bad or evil.  Neither are power and riches things of evil per se.  One of Satan’s cleverest devices is to make good things look bad and bad things look good.  This is one of the effective devices of Satan that is commonly found everywhere in the world.  The enemy turns wisdom, which is not bad in itself, into something bad.  He always does this; he is a deceiver to the very core.  In this threefold “not” the Lord says that man ought not to glory in three things – wisdom, power or might, and riches.  In “not glorying” the Lord will give them the glory of life! 	",
		"bible_reading": "Joshua 9:3-10:43 \n Luke 16:19-17:10 \n Psalm 83:1-18 \n Proverbs 13:4",
		"image_url": "Empty at the moment",
		"today_command": "Meditate upon these things; give thyself wholly to them; that thy profiting may appear to all.   1Timothy 4:15 "
	},
	{
		"devotion_id":14, 
		"devotion_title":"Title 14",
		"devotion": "Israel believed in God’s redemption, they had faith that God would bring them out; but after some time their intellect overtook their faith in God.  “How could God bring them to the Promised Land?”, they asked,  “How can we overcome these giants?”  They could not understand that at one time they had victory over Pharaoh and his chariots, but a time came when their intellect came between them and God.  So they refused to believe that they could overcome the giants in the land of Canaan.  Their thoughts were fixed on their own security; they forgot the mighty miracles that God had done.  Their intellectualism got the better of them.  This is where Christianity has failed again and again.  We think that God could save us through the blood of Christ, but the blood has no power to give us victory over sin, the flesh and the world, here and now!  The reasoning of man has been ruling God’s people, robbing them of the highest in Christ.    The tragedy is that man always wants to possess a knowledge of things because that is the tree from which he was nourished in the Garden at the cost of the Tree of Life.  There is a mental Christianity out there and we need to be very careful about it.  Intellectual Christianity is a counterfeit.  The exaltation of human intellect is the surest way to build Babylon!",
		"bible_reading": "Joshua 11:1-12:24 \n Luke 17:11-37 \n Psalm 84:1-12 \n Proverbs 13:5-6 ",
		"image_url": "Empty at the moment",
		"today_command": "Lay not up for yourselves treasures upon earth, where moth and rust doth corrupt, and where thieves break through and steal:  Matthew 6:19 "
	},
	{
		"devotion_id":15, 
		"devotion_title":"Title 15",
		"devotion": "What is wisdom? Wisdom is the power to judge; it is the power to discriminate; it is the power to determine, and it is the power to decide.  In the natural man, there is a lust in this area, wherein he uses his own wisdom and intelligence to judge, to discriminate, to determine and to decide.  In a spiritual man, God’s wisdom helps him to judge all things.  It provides him the power to judge, to discriminate, to determine and to decide things.  \n\t As God’s people, we can either use the wisdom of God or our own wisdom.   Just because we are God’s people having the indwelling Holy Spirit, there is no guarantee that we will always use the wisdom of God. Nothing is automatic in the spiritual field and we require sensitivity to judge and to discriminate.  Jesus is made unto us wisdom, He has become our wisdom; but we need to be sensitive to draw from His wisdom, and not from the powerful intellect of the natural man.  How many times our natural wisdom robs us of the things that God has given us in His Son, the Lord Jesus?  We must desire to receive the wisdom of God and operate it. ",
		"bible_reading": "Joshua 13:1-14:15 \n Luke 18:1-17 \n Psalm 85:1-13 \n Proverbs 13:7-8",
		"image_url": "Empty at the moment",
		"today_command": "And Jesus answered and said unto them, Take heed that no man deceive you. Matthew 24:4"
	},
	{
		"devotion_id":16, 
		"devotion_title":"Title 16",
		"devotion": "A clear indication that intellectualism is ruling the majority of God’s people today can be obtained by looking at the state of their moral fiber and condition.  The depth of moral decline can be seen from the manner in which churches accommodate divorce and remarriage, though these are clearly contrary to God’s word.   Man has used his intellect to interpret God’s pure word, twisting it to promote his own lustful desires and make room for his perverted mind.  A majority of church leaders have meekly given in and accepted this downward trend of easy divorce and remarriage.  Many have done this to maintain their place and position in the church as well as to keep the churches from totally falling apart.  \n\t The prophets of old did not propagate divorce and remarriage, the Lord Jesus did not, the early apostles did not, and even the early fathers of faith after the apostolic days did not practice divorce and remarriage as is done today.  Then from where did this come?  It was born out of the corrupt mind of man, out of the intellect of man that has willingly twisted and turned the word of God.   Truly we have to be fools in the midst of a church world that is living by its own wisdom!",
		"bible_reading": "Joshua 15:1-63 \n Luke 18:18-43 \n Psalm 86:1-17 \n Proverbs 13:9-10 ",
		"image_url": "Empty at the moment",
		"today_command": "Owe no man any thing, but to love one another: for he that loveth another hath fulfilled the law.  Romans 13:8"
	},
	{
		"devotion_id":17, 
		"devotion_title":"Title 17",
		"devotion": "Many believers talk glibly about the time when man will reign with God upon the earth, having His authority, rule, and power. It will be catastrophic if we have His authority without His wisdom.  In the eyes of God, His authority is where His wisdom is.  Remember that in His kingdom authority is based not only upon one’s position in the kingdom, but also upon one’s wisdom!  God will not give His authority to someone who will not have His wisdom.  In the world people exercise authority without wisdom; but in God’s kingdom, authority will be given to those who have His wisdom.  The Cross is the wisdom of God;  and as we allow the Cross to operate in us, so also will the wisdom of God come upon us.  People want some position of power so that they can have authority, but what brings authority to God’s kingdom is His wisdom. His authority lies in another wisdom, a wisdom “which is not of this world”.  God’s wisdom is wrapped up in the Cross.  His wisdom flows out of us as the Cross works in us.  The Holy Spirit is the Spirit of wisdom and understanding.  Therefore, the Holy Spirit imparts to us the power to discriminate, to discern and to understand;  He helps us to take the right decisions.  This wisdom that the Holy Spirit imparts to us cannot be received by the wise men of the world.",
		"bible_reading": "Joshua 16:1-18:28 \n Luke 19:1-27 \n Psalm 87:1-7 \n Proverbs 13:11",
		"image_url": "Empty at the moment",
		"today_command": "But fornication, and all uncleanness, or covetousness, let it not be once named among you, as becometh saints;  Ephesians 5:3"
	},
	{
		"devotion_id":18, 
		"devotion_title":"Title 18",
		"devotion": "He said, “I cannot go with these; for I have not proved them. And David put them off him”.  David knew very well that Saul had lost his anointing and that the weapons of Saul had no power against the enemy.   No doubt, his weapons were powerful at one time and there was no dearth of weapons and armour in Israel.  But they had lost their power and effectiveness against the enemy.  The Scripture says that God’s Word is the sword in the armour of God (Eph. 6:17).  It is the word or truth that one has obeyed that is powerful and sharp against the enemy.  The Lord used the sharp edge of the sword of the Spirit, which is the Word of God, when He was tempted by the enemy in the desert.  People often quote Scripture without obeying it and therefore that Scripture loses its sharpness and is ineffective against the enemy in the day of battle.  It is the word that is obeyed and lived that gives us victory.   Yes, Saul’s sword was sharp against the enemy and he slaughtered the Philistines at one time.  However, the same sword had lost its sharpness through disobedience and rebellion!  \n\t It was not the lack of swords in Israel that brought defeat.  No never!  There were so many weapons hanging in the tents of Israel;  but they had lost their sharpness!",
		"bible_reading": "Joshua 19:1-20:9 \n Luke 19:28-48 \n Psalm 88:1-18 \n Proverbs 13:12-14 ",
		"image_url": "Empty at the moment",
		"today_command": " Him that is weak in the faith receive ye, but not to doubtful disputations.  Romans 14:1"
	},
	{
		"devotion_id":19, 
		"devotion_title":"Title 19",
		"devotion": "Choose the way of the cross which is the wisdom of God.  God’s wisdom is wrapped up in the Cross.  That is the place where every wise man stumbles.  Have you seen this happening practically?  Have you not seen educated, learned men bowing shamelessly before a mute stone that they have made into an icon?  Wise, scholarly  and learned as they may be, they foolishly bow before something that is totally, ridiculously lifeless and mindless.   Yet, if one were to tell them that God loves them and has made a way of salvation for them through His death, these very intelligent human beings would readily rise up in anger against us.  Tell him that there is One who died for him and took upon Himself all the sin of mankind, died in his place on the cross, and having been buried, rose again and ascended to heaven, and this so-called ‘normal’ man would find it difficult to accept what we have to say!  And all that this intellectual being would be able to say is, “How can I believe this?”  Yet, he will believe that he must bow before a mute stone in faith, believing that the stone is God!  Man in his wisdom can believe everything other than the Cross, even the most foolish of things.  Oh! the stupidity and foolishness of the man who thinks he is such a clever genius!  The Cross becomes utter foolishness to him.   That is the wisdom of our God!",
		"bible_reading": "Joshua 21:1-22:20 \n Luke 20:1-26 \n Psalm 89:1-13 \n Proverbs 13:15-16",
		"image_url": "Empty at the moment",
		"today_command": "Behold, I come quickly: hold that fast which thou hast, that no man take thy crown.  Revelation3:11 "
	},
	{
		"devotion_id":20, 
		"devotion_title":"Title 20",
		"devotion": "The Psalms represent of what remains when a history of outward things as to the general instrumentality has ended in failure.  The Psalms were written against a background of failure on the part of God’s people, when the condition of Israel, God’s people, had gone into total decay and deterioration.  The nation lived in an abject state of deterioration, departure and weakness.  Though their beginnings with God had been great and awesome, they had come to a shameful state.  The history of Israel in its first phase closes with the book of Kings in a shameful way!  Israel, the instrument that God had raised to serve Him, had failed Him.  Weakness, paralysis, decay and reproach characterized God’s people.  However, out of that sordid mess something that represents a permanent spiritual gain and principle is spoken in Psalms, some people represented what was upon the heart of God.    In those difficult times, there were just a handful of people who gained preeminently a personal and an inward spiritual knowledge of the Lord experientially.  God’s vessels in those times, men like David and others experienced a rich life with God, despite the decline that Israel as a nation was going through.   David and all those who contributed to the Book of Psalms spoke of the inward realities of God’s presence that they richly experienced. Psalms, in a very special way, is, therefore, a ministry of experience.",
		"bible_reading": "Joshua 22:21-23:16 \n Luke 20:27-47 \n Psalm 89:14-37 \n Proverbs 13:17-19 ",
		"image_url": "Empty at the moment",
		"today_command": "Let us not be desirous of vain glory, provoking one another, envying one another.  Galatians 5:26 "
	},
	{
		"devotion_id":21, 
		"devotion_title":"Title 21",
		"devotion": "What is a covenant?  Covenant simply means, an entering into what the Lord Jesus has done by and through His shed blood.  It is an appreciation and apprehension of Him in His great work upon the Cross.  However, we need to be reminded of what that involves as a covenant of God into which we enter.   Through the covenant with Abraham (Genesis 15:5-10), God began to make things clear to Abraham.  God showed him the stand that He Himself would take.  God was in effect saying, “Abraham, I’m wholly for you.  And all that I am and all that I have is committed in this covenant with you.  I would keep nothing back from you but would place My very life, My Name, My Glory and My Honor to fulfill this covenant.” Beloved, this was God’s side of the covenant. Later in the life of Abraham, God adequately proved what He said.   In keeping with His covenant, the Lord Jesus Christ came into the world as the Seed of Abraham, as the Savior of the world.  It is amply clear that God stood by His covenant.  He assigned His Name, His Honor and His Glory to the fulfillment of the covenant with Abraham!  Have we realized how much of God is entrusted into this covenant?  God will hold back nothing so far as His side of the covenant is concerned! Hallelujah!",
		"bible_reading": "Joshua 24:1-33 \n Luke 21:1-28 \n Psalm 89:38-52 \n Proverbs 13:20-23",
		"image_url": "Empty at the moment",
		"today_command": "Watch ye, stand fast in the faith, quit you like men, be strong.  1 Corinthians 16:13 "
	},
	{
		"devotion_id":22, 
		"devotion_title":"Title 22",
		"devotion": "When Abraham stood by his part of the covenant, God became the provider of his need.  Sadly, today we have a Christianity that only wants to receive blessings from God at every opportunity, without ever giving, letting go or yielding anything to the Lord.  May the Holy Spirit help us to look, once again, at the true meaning of ‘Jehovah-jireh’ in the light of this word in situations and circumstances that envelope us.  It was after Abraham had virtually offered Isaac to the Lord, that the Lord came in with His oath, saying, “ By myself have I sworn, saith the LORD, for because thou hast done this thing, and hast not withheld thy son, thine only son: That in blessing I will bless thee, and in multiplying I will multiply thy seed as the stars of the heaven, and as the sand which is upon the sea shore; and thy seed shall possess the gate of his enemies; And in thy seed shall all the nations of the earth be blessed; because thou hast obeyed my voice.” (Gen 22:16-18).  The Lord moved towards fulfilling His promise to Abraham and this is very significant. Many a time, believers cry out to God for Him to fulfill His promises in their lives.  However, they are not sensitive to the voice of God wanting them to come to places of sacrifice and obedience.  Which often is a prelude to the fulfillment of God’s promises!  ",
		"bible_reading": "Judges 1:1-2:9 \n Luke 21:29-22:13 \n Psalm 90:1-91:16 \n Proverbs 13:24-25 ",
		"image_url": "Empty at the moment",
		"today_command": "Do all things without murmurings and disputings:  Philippians 2:14"
	},
	{
		"devotion_id":23, 
		"devotion_title":"Title 23",
		"devotion": "There is no doubt that in these days, there needs to be a re-gathering of the saints unto the Lord.  But this gathering unto the Lord is not an organized movement, a sect, a society or a fraternity.  When we speak of a ‘gathering’ we do not even faintly advocate or have in mind an organized system, a form of things or an order.    Beloved, the Church of the New Testament never began as an organized movement.  It was purely spiritual from the very beginning.  It began as a work of the Spirit of God.  There was no thought of having an organized affiliation of believers at various places.  When the Church was birthed, it was something purely spiritual, that sprung up spontaneously at different places because of the infusion of divine life, united only by the Holy Spirit, in mutual love and solicitude.  \n\t If a ‘society’ or an ‘association’ is divided, they still remain a society and an association in character.  Their nature and makeup remains unaffected by any division.  However, one cannot divide a body without destroying it.  So it is with  the Body of Christ, the Church.  If the Body of Christ  is divided, it will lose its basic, essential, quality and character because it  is an organic entity.   Division will rob it of its basic character of oneness.  ",
		"bible_reading": "Judges 2:10-3:31 \n Luke 22:14-34 \n Psalm 92:1-93:5 \n Proverbs 14:1-2",
		"image_url": "Empty at the moment",
		"today_command": " Ask, and it shall be given you; seek, and ye shall find; knock, and it shall be opened unto you:  Matthew 7:7"
	},
	{
		"devotion_id":24, 
		"devotion_title":"Title 24",
		"devotion": "A deep and a travailing concern for re-gathering is one of the marks of the end time move of God.  It will further take a deep turn, that these saints will come into a burden for the remnant in the earth.  In other words, if we have a travailing concern for such a gathering, we will also be brought into a realm of intercession, and we will be able to give ourselves to interceding for the remnant in the earth.  An end-time move of God is often characterized by such ‘prayer-instruments’.  Their concern is not for self-interests, the expansion of their ministry, the enlargement of their territories, or to build their own kingdoms.  Their concern is for ‘all the saints’, for the ‘Church’, and for the purpose of the Lord.  This kind of burden for prayer that God lays upon His people in different parts of the world is His way of uniting .  \n\t Do you realize that you are the beneficiary of prayers made by someone, somewhere in the world? You may not have known your benefactor personally, but the specific prayers of some saint for the remnant of God would undoubtedly have benefited you spiritually.  Beloved, prayer is a unifying factor and it is also a gathering factor!",
		"bible_reading": "Judges 4:1-5:31 \n Luke 22:35-53 \n Psalm 94:1-23 \n Proverbs 14:3-4 ",
		"image_url": "Empty at the moment",
		"today_command": " And said unto them, Why sleep ye? rise and pray, lest ye enter into temptation.  Luke 22:46 "
	},
	{
		"devotion_id":25, 
		"devotion_title":"Title 25",
		"devotion": "In the early church, the Holy Spirit through ministering servants who moved from one place to another ministered Christ to the saints.  Paul and Barnabas preached Christ in Lystra and some were drawn and there was a gathering unto the Lord in Lystra.   Paul and Barnabas then moved on to Iconium, they preached Christ again and there was once again a gathering unto the Lord in Iconium.  Between Lystra and Iconium there was a gathering unto the Lord. In this manner the saints were brought into a fellowship with one another.  They were not brought into fellowship by affiliation but by the ministration of Christ through His word in the Spirit. In other words, it was not first of all through an organized affiliation that Lystra and Iconium were joined.  It was the ministration of Christ through the word in the Spirit that joined the gatherings in different localities.  The ministers were the ‘joints of supply’ (Ephesians 4:16). \n\t Churches today are like pieces of a jigsaw puzzle and efforts to piece them together only result in frustration!  We can have the best of ecumenical movements, but that is not going to join the pieces of the jigsaw puzzle!  The proper joining of people into a Body can only be done through the ministration of Christ, by anointed ministries. ",
		"bible_reading": "Judges 6:1-40 \n Luke 22:54-23:12 \n Psalm 95:1-96:13 \n Proverbs 14:5-6",
		"image_url": "Empty at the moment",
		"today_command": "Lie not one to another, seeing that ye have put off the old man with his deeds;  Colossians 3:9"
	},
	{
		"devotion_id":26, 
		"devotion_title":"Title 26",
		"devotion": "A distinguishing feature of today’s gatherings, is the utter inability of the members to apprehend anything more than the simple elements of salvation.  They have little growth potential.  Their knowledge is limited to personal salvation, in the sense of forgiveness of sins, peace with God, and the rudiments of faith.   Their only dictum is that they have been ‘saved to save’.  They faithfully attend their favourite gatherings for years on end, some even for fifty years, but there is little or no sign of any spiritual growth or maturity.  It is a ‘church’ or a ‘mission’ where people come together to preach and to hear the gospel.  It’s a preaching center, where people go and hear a well known preacher.  The ‘Church’ for such ones is but a place where people gather in a religious way to follow some routines and hear the words of a preacher or a teacher.  Such gatherings are far from the true corporate expression of a Body and the gathering of His saints. \n\t The enemy is not bothered to disturb their complacency, smugness and satisfaction. But let there be a movement in the direction of a real corporate expression of a Holy Spirit constituted testimony to Christ, then the battle is on.  Nothing will be left  untried to break up that, discredit it or in some way nullify that testimony. ",
		"bible_reading": "Judges 7:1-8:17 \n Luke 23:13-43 \n Psalm 97:1-98:9 \n Proverbs 14:7-8 ",
		"image_url": "Empty at the moment",
		"today_command": "Let no corrupt communication proceed out of your mouth, but that which is good to the use of edifying,  Ephesians 4:29 "
	},
	{
		"devotion_id":27, 
		"devotion_title":"Title 27",
		"devotion": "The testimony of our gathering should always be, “I was weary, tired, disheartened and drained physically, mentally and spiritually, when I entered the place of gathering.  However, I came away renewed, refreshed, invigorated, rejuvenated, and recharged.  Yes, I came away lifted up in my spirit.” There is an undeniable ‘livingness’ in a true gathering of saints.  The activity of divine life in the midst of the gathering results in a spiritual re-energizing that gives a person a renewed sense of spiritual well-being.  It is an activity of divine life. What makes a gathering ‘living’ is the presence of divine life in the very centre of the gathering. Impressive forms of worship, well-organized systems of service cannot induce life into a gathering.  In a gathering of the saints, it is not ‘human activity’ but the ‘activity of divine life’ that brings life to a gathering and imbibes it with a quality of ‘livingness’. \n\t Many people succumb to secondary reasons, that keep them away from meeting with saints.  Have you not experienced that headache and fever and those peculiar circumstances that come just before the meetings are to begin?  Beloved, the battle is on!  The enemy will not relinquish his efforts, he will not leave any stone unturned in his attempt to prevent you from assembling with the saints.  ",
		"bible_reading": "Judges 8:18-9:21 \n Luke 23:44-24:12 \n Psalm 99:1-9 \n Proverbs 14:9-10",
		"image_url": "Empty at the moment",
		"today_command": " Servants, [be] subject to [your] masters with all fear; not only to the good and gentle, but also to the froward.  1Peter 2:18"
	},
	{
		"devotion_id":28, 
		"devotion_title":"Title 28",
		"devotion": "There is an illusion or a delusion in much of Christianity and in many churches that activity is essentially spiritual life. Hence you find all sorts of programs, attractions, special numbers, special groups, guest speakers, committes, responsibilities and an endless list of items charted out for the gatherings.  All this to make an impression of life and robustness in the church or to creat and stimulate life.  If it is the divine activity, you can be sure that it will result in a greater measure of the Son in the gathering. \n\t True divine activity can only be measured by one gauge. It will always result in a greater measure of the Son.  There may be a life of works but it may not be works of life. True life will always manifest a work, but every work may not be life-giving.  This was the indictment of the Lord against the Church at Ephesus.  That very thing was what God denounced in the church in Ephesus.  “I know thy works…” (Revelations 2:2). \n\t Divine life is spontaneous and not a result of being ‘worked upon’. The Church does not live by stimulation but by the power of resurrection.  That is the hall-mark of divine life. ",
		"bible_reading": "Judges 9:22-10:18 \n Luke 24:13-53 \n Psalm 100:1-5 \n Proverbs 14:11-12 ",
		"image_url": "Empty at the moment",
		"today_command": "And let us consider one another to provoke unto love and to good works:  Hebrews 10:24 "
	},
	{
		"devotion_id":29, 
		"devotion_title":"Title 29",
		"devotion": "The Lord Jesus before he ascended to heaven, called His disciples and told them to tarry for the Holy Spirit.  Around five hundred disciples saw the Lord ascend to the heavens.  Then they gathered according to the command of the Lord. The Lord did not specify a date or time for the Holy Spirit to come.  He said, “Wait, and He who is to come will come.”  In that gathering of the saints, perhaps many did not really gather unto the Lord.  Finally, we know that only 120 disciples waited with abated breath for the promise of the Father. This remnant continued to gather steadfastly, not forsaking the gathering together of the saints. It was not long after that, the promise of the Father descended upon them.  The Lord appeared to those who were faithful in gathering unto Him.  He came to the true gathering of the saints.   Beloved, the Lord is sifting the gathering of the saints from the phony ones even today.  He is searching for true gatherings of His people, that are unto Him alone.  He will manifest Himself only in their midst.  ‘And the Lord whom ye seek shall suddenly appear in His temple’ and he who has to come will come, but many who were called and who gave in initially will not be there finally!  Beloved saints, there is a true gathering of saints in the earth today. Are you a part of that gathering? ",
		"bible_reading": "Judges 13:1-14:20 \n John 1:29-51 \n Psalm 102:1-28 \n Proverbs 14:15-16 ",
		"image_url": "Empty at the moment",
		"today_command": "Prove all things; hold fast that which is good. 1Thessalonians 5:21"
	}
]
	