[
	{
		"devotion_id":0, 
		"devotion_title":"Title 0",
		"devotion": "“Watchman what of the night? (How far is it spent? How long till morning?)” Isaiah 21:11  Man knows all about his own times, but who knows the times and seasons of God?  Do you hunger to know the times and seasons of God?  To know this you must first consider your own times as unimportant and trivial.  I refer not of the time as seen in a clock, but of the times that man has carved out or built these days.  Man has formulated his own idea of what the times and seasons of God should be.  Men are playing guessing games about the times and seasons of God and have come up with their own ideas, thoughts and philosophies. Beloved, we need to remove these man-made solutions from our minds. \n\t If one does not know the times in which one lives then one will seldom know what needs to be done or what one is to do.  Knowing the times is a very important thing because we know that we are so bound by time.  The Lord rebuked the Pharisees and scribes of old, saying, “When ye see a cloud rise out of the west, straightway ye say, There cometh a shower; and so it is. And when ye see the south wind blow, ye say, there will be heat; and it cometh to pass: but how is it that ye do not discern this time? (Luke 12:54-56). ",
		"bible_reading": "Genesis 1:1-2:25 \n Matthew 1:1-2:12 \n Psalm 1:1-6 \n Proverbs 1:1-6",
		"image_url": "Empty at the moment",
		"today_command": "Watch therefore: for ye know not what hour your Lord doth come.     Matthew 24:42"
	},
	{
		"devotion_id":1, 
		"devotion_title":"Title 1",
		"devotion": "The Word says that in the time of Moses there was a veil upon the hearts of the people.  “But even unto this day, when Moses is read, the vail is upon their heart.” (2 Corinthians 3:15).   It is true that there is a veil upon the hearts of people when they read the Word of God today.  Many are not able to see this simple truth.  The life of Paul, the apostle, also shows us that having a knowledge of the Scriptures is not enough.  We need a revelation by the Holy Spirit to understand the truth of the Gospel.  Paul  was a ‘Hebrews of the Hebrews‘ and  taught of Gamaliel, a famous teacher of the times.  Yet, having all the knowledge of the Scriptures he indulged in persecuting the church. Does it not seem strange and contrary?  He did not persecute the Christians because he had a personality problem, an unknown fear or a superiority complex.  No, he went after the Christians because he thought that that was the right thing according to the Word of God.  Though he was very learned, he did not have any spiritual insight  or revelation of the purposes of God from the Holy Spirit.  When Paul read the Scriptures before he met the Lord on the road to Damascus there was a veil before his eyes and he could not discern the truth.  It was only when the Lord opened his eyes that he was able to perceive the things of the Spirit.",
		"bible_reading": "Genesis 3:1-4:26 \n Matthew 2:13-3:6 \n Psalm 2:1-12 \n Proverbs 1:7-9",
		"image_url": "Empty at the moment",
		"today_command": "Wherefore, my beloved brethren, let every man be swift to hear, slow to speak, slow to wrath:  James 1:19-20 "
	}, 	
	{
		"devotion_id":2, 
		"devotion_title":"Title 1",
		"devotion": "There is an ‘early’ and ‘latter’ rain that this earth receives. We read about this in the prophecy of Hosea. “Then shall we know, if we follow on to know the Lord; his going forth is prepared as the morning; and he shall come unto us as the rain, as the latter and former rain unto the earth” (Hosea 6:3). We read again in the book of Deuteronomy, “That I will give you the rain of your land in his due season, the first rain and the latter rain, that thou mayest gather in thy corn, and thy wine, and thine oil.” (Deuteronomy 11:14). This is what apostle James was referring to  in connection with the coming of our Lord. The prophet Joel also had this in mind when he prophesied saying, “Be glad then, ye children of Zion, and rejoice in the Lord your God: for he hath given you the former rain moderately, and he will cause to come down for you the rain, the former rain, and the !atter rain in the first month. And the floors shall be full of wheat, and the vats shall overflow with wine and oil.” (Joel 2:23-24).  We praise God for the “FORMER RAIN” fallen “MODERATELY” upon the church which refers to Pentecost dispensationally. The apostle Peter could immediately say, ‘This is that...”. But there is a former rain which,  combined with the latter rain, shall bring forth the full harvest in these days.",
		"bible_reading": "Genesis 5:1-7:24 \n Matthew 3:7-4:11 \n Psalm 3:1-8 \n Proverbs 1:10-19 	",
		"image_url": "Empty at the moment",
		"today_command": "Beware lest any man spoil you through philosophy and vain deceit, after the tradition of men, Colossians 2:8"
	}, 	
	{
		"devotion_id":3, 
		"devotion_title":"Title 1",
		"devotion": "“Do two walk together, except they make an appointment and have agreed?” Amos 3:3 \n\t It is impossible for the flesh and the Spirit to walk hand-in-hand.  Therefore, we need to keep away from the things of the flesh and carnal mind these days.  We cannot grow into maturity if we partake of that which is of the flesh.  If we continue to walk after the flesh we can in no way walk in the Spirit for ‘they that are after the flesh do mind the things of the flesh; but they that are after the Spirit the things of the Spirit. (Romans 8:5).  One can either grieve the Spirit of God or walk in the ways of God.  The former leads to darkness and death while the latter gives light and peace to our heart.  If one walks against the will of God, then it usually happens that the consequences are not seen immediately, but manifest much, much later.  The reality is that many people prefer to live in just such a state of spiritual conflict and disharmony.  Jeremiah, the prophet, laments in chapter 5 and verse 31,  “ ... and my people love to have it so: and what will ye do in the end thereof”.",
		"bible_reading": "Genesis 8:1-10:32 \n Matthew 4:12-25 \n Psalm 4:1-8 \n Proverbs 1:20-23",
		"image_url": "Empty at the moment",
		"today_command": " Jesus said unto him, It is written again, Thou shalt not tempt the Lord thy God.  Matthew 4:7"
	}, 	
	{
		"devotion_id":4, 
		"devotion_title":"Title 1",
		"devotion": "When the Lord Jesus Christ came in the flesh, He was sent of God, the Father.  None could prevent His coming, nor was anyone able to prematurely destroy Him though many attempts were made upon His life by the agents of Satan.  All the Pharisees and scribes could not interfere with the plans of the Father.  Nor could the Roman Emperor or Herod do a thing.  None could change what was destined to occur.  In very much the same way we know that nothing can prevent the coming of Jesus in all His glory.  These things have been spoken by the mouths of the prophets from the beginning of time.  And no one will be able to stop that great event. \n\t He is going to come again crowned in all His glory and by the breath of His nostrils He will consume the wicked and He will establish His kingdom and the kingdom will have no end: He will come as the King of Kings in all His glory and majesty.  We read of Him in the Book of Revelation, “Behold He cometh with clouds, and every eye shall see him... “.  ",
		"bible_reading": "Genesis 11:1-13:4 \n Matthew 5:1-26 \n Psalm 5:1-12 \n Proverbs 1:24-28 	",
		"image_url": "Empty at the moment",
		"today_command": "Let your light so shine before men, that they may see your good works, and glorify your Father which is in heaven. Matthew 5:16"
	}, 	
	{
		"devotion_id":5, 
		"devotion_title":"Title 1",
		"devotion": "When we look into the book of Daniel (Daniel 4: 1-25) we see that when the music began to play three Hebrew children were told to bow down to the image of man.  Did they bow down?  No, they were people with a different spirit.  Today, in the Christian realm, men have made many images that consist of their pet doctrines.  We are told to bow down to the teachings of well known preachers; to bow to their personal and individual ministries which highlight their personal achievements and their personal ideas. They are asking Christians to bow to their man made music and images of men.  The music is already ‘on’ and many are already bowing down to the images of men!  But God is calling us to be a people with a different spirit.  God is restoring a proper focus to His church in this day. \n\t There are many a Shadrach, Meshach and Abednego whom God is raising up in this hour.  They refuse to bow down to that which man has erected in the name of God.  And on the other hand, there are many people who say they know the Lord but today they are bowing down before the images of man.  The images of man are the ideas and systems of man",
		"bible_reading": "Genesis 13:5-15:21 \n Matthew 5:27-48 \n Psalm 6:1-10 \n Proverbs 1:29-33",
		"image_url": "Empty at the moment",
		"today_command": "Give to him that asketh thee, and from him that would borrow of thee turn not thou away. Matthew 5:42 "
	}, 	
	{
		"devotion_id":6, 
		"devotion_title":"Title 1",
		"devotion": "“Except, the Lord build the house, they labour in vain that build it: except the Lord keep the city, the watchman waketh but in vain” (Psalm 127:1).  There are many who have a burden for souls and zeal to do the Lord’s work, but they will not be able to stand in these difficult times if they are not built with the right foundations.  Let us hear the voice of the Lord.  This does not mean that we are not to bring people into the house of the Lord.  We are surely to know that every member is to bring new ones to the house of God.  We are to be like healthy mothers that produce offspring in due season. Yes, every healthy sheep produces lambs.  And if we are well fed in the house of God then we will undoubtedly bring forth fruit.  True evangelism is walking and living in the ways of the Lord.  When the true light shines forth in this world then people shall invariably be brought into the house of God. That is what we read in Matthew 24:14, “And this Gospel of the Kingdom shall be preached unto all nations as a witness. Then shall the end come”.",
		"bible_reading": "Genesis 16:1-18:15 \n Matthew 6:1-24 \n Psalm 7:1-17 \n Proverbs 2:1-5 	",
		"image_url": "Empty at the moment",
		"today_command": "Be ye therefore perfect, even as your Father which is in heaven is perfect. Matthew 5:48"
	}, 	
	{
		"devotion_id":7, 
		"devotion_title":"Title 1",
		"devotion": "There are three kinds of people in the Christian world today. The first group consists of people who make things happen.  There is another group of people who see things happen.  The third group of people are those who wonder what is happening.  Which group do you belong to?  There are people who make things happen and people who see things happen.  But the third group consists of those who wonder what is happening.  There are some in Christian circles that say, “I have heard all these things. I have attended many conventions.”  They are those who have always heard sermons but they failed to hear a single message.  They like to hear a preacher but they don’t like to be under a pastor.  Which group do you want to belong to?  The unbelieving will stand far away and wonder what is happening.  But the true people of God in these last days will make things happen.  And Jesus said, “Greater things than this will ye do because I go unto my Father’. \n\t “Therefore leaving the elementary teaching about Christ let us press on to maturity,”     Hebrews 6:1, 2 ",
		"bible_reading": "Genesis 18:16-19:38 \n Matthew 6:25-7:14 \n Psalm 8:1-9 \n Proverbs 2:6-15",
		"image_url": "Empty at the moment",
		"today_command": "Honor thy father and mother: and, He that curseth father or mother, let him die the death. Matthew 15:4 "
	}, 	
	{
		"devotion_id":8, 
		"devotion_title":"Title 1",
		"devotion": "The word mansion is used only twice in the Bible in John 14:2 and in John 14:23.  The Greek word for ‘mansion’ is ‘mane’ which talks about a fixed abode and not a mansion. While translating the word ‘mane’ into English the people mistranslated it into ‘mansion’ instead of an abode or dwelling place.  Vine’s Expository Dictionary says that there is nothing in the word to indicate separate compartments in heaven, neither does it suggest a temporary resting place on the road.  The Amplified Bible also makes it clear that Jesus says, “We will come and make our abode”.  John, the apostle, saw the new heavens and the new earth.  He saw the new Jerusalem and he said, “Behold the tabernacle of God is with men, and they shall be His people and He shall be their God”. (Revelation 21:3).  Is man going to heaven or is God coming down to man to dwell in and amongst him?  Jesus said, “We will come”.  Who is the Father’s House? The Bible says, “Ye are the temple of the living God. And the Spirit of God dwelleth in you” Let us not doubt that we are the house of God and we are the Father’s house.",
		"bible_reading": "Genesis 20:1-22:24 \n Matthew 7:15-29 \n Psalm 9:1-12 \n Proverbs 2:16-22 	",
		"image_url": "Empty at the moment",
		"today_command": "Ye are bought with a price; be not ye the servants of men. 1 Corinthians 7:23"
	}, 	
	{
		"devotion_id":9, 
		"devotion_title":"Title 1",
		"devotion": "It is our right to ask for the rain. We see this in Zechariah 10:1 “Ask of the Lord rain in the time of the latter or spring rain. It is the Lord who makes lightning’s which usher in the rain and give men showers of it, to everyone grass in the field.”  It is your birth-right to ask for the latter rain in your life.  People ask for good wives, for visas, for titles, for husbands and houses and all carnal things.  But the Word of God says we are to ask for more rain.  It is time to fall upon our faces and ask the Lord for the latter rain.  Let it be the desire of our hearts to pray and ask for the latter rain that the seed may grow into maturity and fullness.  The seed sown in our hearts has been sown by the Lord.  This is a crucial time.  Let us awaken out of our sleep and put on the whole armour of light.  Let us discard that which is of the flesh and of darkness.  Let us recognize God’s authority, receive God’s authority, release God’s authority and rest on God’s authority. \n\t The seed of God’s Word has been sown deep down in your heart.  What you need is the rain.  Pray for the rain.  Let us pray to the Lord for a rain of abundance. ",
		"bible_reading": "Genesis 23:1-24:51 \n Matthew 8:1-17 \n Psalm 9:13-20 \n Proverbs 3:1-6",
		"image_url": "Empty at the moment",
		"today_command": " Let all your things be done with charity. 1 Corinthians 16:14 "
	}, 	
	{
		"devotion_id":10, 
		"devotion_title":"Title 1",
		"devotion": "Though generations have come and generations have gone in seemingly similar fashion, yet of one thing we can be sure: that ever since the beginning of time there has been an ever  increasing manifestation of sin in various forms.  From the very fall of man, resulting in the curses of God coming upon the offspring’s of Adam and Eve, there has been a visible display of the increase of sin and death upon this earth. We need to understand and accept this law of the increase of sin and death in the generations of the first Adam to fully understand the purposes of God.  For God did not purpose to let things slide downward continuously.  We know that He sent His Son, the Lord Jesus Christ to avert the tragedy of men living forever in their fallen state.  And just as there has been  an ever increasing manifestation of sin, death and destruction since the first Adam, so also there has been a continuous increase of the manifestation of the life of Jesus Christ  on this earth from the time of the last Adam. Glory to God !!",
		"bible_reading": "Genesis 24:52-26:16 \n Matthew 8:18-34 \n Psalm 10:1-15 \n Proverbs 3:7-8 	",
		"image_url": "Empty at the moment",
		"today_command": "But let every man prove his own work, and then shall he have rejoicing in himself alone, and not in another. Galatians 6:4"
	}, 	
	{
		"devotion_id":11, 
		"devotion_title":"Title 1",
		"devotion": "Beloved, the Lord wants us to know that there is another generation, beside the generation of the first Adam,  that is existing upon this earth in this hour!  This is the generation of the last Adam , the Lord Jesus Christ.  This generation is coexisting with the generation of the natural Adam, but it is in no way going the same way.  There is a vast difference in the two generations. One manifests the nature of the natural Adam in whom the law of sin and death is reigning and ruling; the other exhibits the nature of the last Adam, which is the Lord Jesus Christ.  And we all need to know that just as there has been an increase in the manifestation of the first Adam, so also there is going to be an increase in the manifestation of the generation of the last Adam.  Just as the law of sin and death is ascending to a climax in these last days, so also is the law of the Spirit of life in Christ Jesus proceeding to its own climax, in these last days.  Yes, there is a growing, a developing and an enlarging of this generation of the spiritual minded man, the generation of the last Adam.  They are going to experience fullness of the manifestation of the Lord Jesus Christ.",
		"bible_reading": "Genesis 26:17-27:46 \n Matthew 9:1-17 \n Psalm 10:16-18 \n Proverbs 3:9-10",
		"image_url": "Empty at the moment",
		"today_command": "Submitting yourselves one to another in the fear of God. Ephesians 5:21"
	}, 	
	{
		"devotion_id":12, 
		"devotion_title":"Title 1",
		"devotion": "When the Lord wanted Adam to have a companion He caused Adam to search the whole animal world and to name every animal and bird so that he could search and see if there was anything suitable to be his companion.  Nothing that God had created till that time was suitable for Adam as a companion and help mate. \n\t The Lord has given a beautiful picture of Christ and the church here.  Just as nothing suitable was found in all the creation to provide a help mate for Adam so also in all creation  there was nothing suitable  as an help mate for Christ, the Son of God.  And so God brought the Church into being as He also created Eve when nothing else was found as a  life companion for Adam.  O, glory hallelujah!  Eve was made so that she may be a suitable help for Adam.  The spiritual Eve, which is the church, was also made for  Christ as His help-mate.  The Lord needs a bride as a companion and a life partner.  The bride that God has planned for His Son is not the kind that we see in the natural.  Nor will this ‘bride’ only be concerned with having an eternal life through Christ Jesus.  God has a great purpose for the bride of Christ upon the earth.",
		"bible_reading": "Genesis 30:1-31:16 \n Matthew 10:1-23 \n Psalm 12:1-8 \n Proverbs 3:13-15",
		"image_url": "Empty at the moment",
		"today_command": "Do all things without murmurings and disputings: Philippians 2:14"
	}, 	
	{
		"devotion_id":13, 
		"devotion_title":"Title 1",
		"devotion": "Let it be our prayer to be a people who will judge the affairs of our daily lives till we are found to be acceptable  in the sight of the Lord. \n\t The apostle Paul said, “For I know nothing by myself; yet am I not hereby justified: but he that judgeth me is the Lord.” (1 Corinthians 4:4)   He was not evading or escaping  the responsibility of judging his own life.  He depended upon  the judgment of God.  The judgments of God are very different from our own judgments.  When the children of Israel sinned against God, they were immediately subjected to the divine judgments of God in one form or another.  At the same time the gentiles were living in sin and continued to live in sin but God never judged them.  The reason for this is that God’s judgments  towards His people are always given in love and mercy.  That is why we read, “For if we would judge ourselves, we should not be judged.” (1 Corinthians 11:31).  When we are judged by God we are chastened of the Lord so that we should not be condemned by the world.  Surely God is looking upon His people with mercy so that we may judge our lives and qualify to judge the earth as His bride.",
		"bible_reading": "Genesis 31:17-32:12 \n Matthew 10:24-11:6 \n Psalm 13:1-6 \n Proverbs 3:16-18 	",
		"image_url": "Empty at the moment",
		"today_command": "If any man will come after me, let him deny himself, and take up his cross daily, and follow me.  Luke 9:23"
	}, 	
	{
		"devotion_id":14, 
		"devotion_title":"Title 1",
		"devotion": "There are people who live in ignorance, people who reject God’s Word, and people who say ‘no’ to the Gospel of the kingdom of God; there are people who say, “we don’t want to hear these things for we want to walk in our own ways”. People are living in darkness, nay pitch darkness. But the Word of God says, “Your light is come, Arise and shine, therefore”. Do not be tied down by circumstances, for the light has come upon thee. Rise up, therefore.”  \n\t The Word tells us that there are people who are living in ignorance, people who have taken to their own ways, people who have rejected the truth in their lives.  At the same time the Word tells us, “But you, brethren, are not in darkness that that day should overtake you as a thief” (I Thessalonians 5:4). \n\t Are you in darkness? Are you walking in the light? You are not in darkness because the light of the Gospel of the kingdom of God has come unto you.  Thy light has come. We are not of night or of darkness. Are you desirous to buy truth?",
		"bible_reading": "Genesis 31:17-32:12 \n Matthew 10:24-11:6 \n Psalm 13:1-6 \n Proverbs 3:16-18 	",
		"image_url": "Empty at the moment",
		"today_command": "Obey them that have the rule over you, and submit yourselves: for they watch for your souls,  Hebrews 13:17 "
	}, 	
	{
		"devotion_id":15, 
		"devotion_title":"Title 1",
		"devotion": "If it were possible to put what the Holy Spirit is saying to the churches today in just one word it would be the word PREPARE !    This is surely an hour of preparation for His people.  The Lord is preparing a bride for the Bridegroom upon the earth.  God has saved each  one of us so that we may, individually and corporately as a church, eventually qualify to be the ‘wife’ of the Lamb. He has not saved us so that we may have the freedom to live in the way we like; nor has He saved us only to reach out to others or to enable us to have victory over sin.  The Lord’s ways are very much higher than our ways!   He has saved us with a much higher purpose in mind.  God wants us to be an eternal part  of His divine intentions.  Our salvation  does not lie in going to heaven when we die.  It is not enough to be thankful to God for His word unto the churches.  He would like us to be  completely united to Christ.  Let us therefore keep our heart and our minds open so that the Spirit of God can make inroads into our lives.  The Lord has brought us to a new place in Him so that we may be fully established in His body.  He has given us new life so that we may experience His preparations as a bride in these days.  He is continually cleansing and purging us so that the holy ‘bride’ may be adorned with all that the Father’s heart desires for the bride of His Son, the Lord Jesus Christ.",
		"bible_reading": "Genesis 32:13-34:31 \n Matthew 11:7-30 \n Psalm 14:1-7 \n Proverbs 3:19-20",
		"image_url": "Empty at the moment",
		"today_command": " Pray ye therefore the Lord of the harvest, that he will send forth laborers into his harvest.  Matthew 9:38"
	}, 	
	{
		"devotion_id":16, 
		"devotion_title":"Title 1",
		"devotion": "“Neither pray I for these alone, but for them also which shall believe on me through their word.” John 17: 20 \n\t The Lord said that he prays for all those who believe in Him according to THEIR word.  The word that God will give to his disciples and followers will become ‘their’ word.  God will grant a word to His ministries so that through their word the church will be brought to a place of cleansing even in this time.  Their word is not something that is a figment of their imaginations; it is the word that God gives for His church. \n\t Caleb and Joshua brought a word to the Lord that they were well able to go forth into the land of Canaan.  This was THEIR word.  Yet, when they declared this word unto the people they were not able to believe them for they thought it to be their opinion.  The majority said that it was an impossible word.  The people received a clear word from the Lord but they were not able to believe it.  The Lord said, ‘They have not refused you but they have refused me’.   So the word of Caleb and Joshua was not their opinion but it was a word that originated in the heart of God.",
		"bible_reading": "Genesis 35:1-36:43 \n Matthew 12:1-21 \n Psalm 15:1-5 \n Proverbs 3:21-26 	",
		"image_url": "Empty at the moment",
		"today_command": "Let them alone: they be blind leaders of the blind. And if the blind lead the blind, both shall fall into the ditch. Matthew 15:14 "
	}, 	
	{
		"devotion_id":17, 
		"devotion_title":"Title 1",
		"devotion": "Beloved, in the hearts of the true bride there shall be a longing to undertake the journey.  Let the preparations begin at this very moment in our lives.  There is a longing in the hearts of all those who form a part of the true bride to begin the preparations that would lead them to the bridegroom at the earliest.  A delay of even one day would be unacceptable.  \n\t How many of us realize that Rebekah had never met Isaac or even seen him.  She had never met him but she never doubted all that the servant said about the bridegroom, even this Isaac.  In the heart of the true people of God the only reality will be the Lord Jesus Christ.  As they hear about Him through the word and the ministry of the Holy Spirit their love for Him will grow and their desire for Him will increase. And with this perpetual desire in the inner recesses of her heart she will prepare herself for the travel ahead.  The apostle Peter says,  “ Whom having not seen, ye love; in whom, though now ye see him not, yet believing, ye rejoice with joy unspeakable, full of glory.”      1 Peter 1:8 ",
		"bible_reading": "Genesis 37:1-38:30 \n Matthew 12:22-45 \n Psalm 16:1-11 \n Proverbs 3:27-32",
		"image_url": "Empty at the moment",
		"today_command": "Brethren, let every man, wherein he is called, therein abide with God.  1 Corinthians 7:24"
	}, 	
	{
		"devotion_id":18, 
		"devotion_title":"Title 1",
		"devotion": "Rebekah had to take a long journey.  Throughout her travel she was never alone.  There was someone to continuously encourage her, even the servant of Abraham.  And all through the travel the servant had only one thing to say and that was about the bridegroom.  The bride is never left alone in the long journey.  The Servant is always at hand to remind her of the calling upon her life and to encourage and edify her all along the difficult and narrow way.   Perhaps Rebekah was looking forward to meet the bridegroom at every bend of the road.  There is a tremendous longing and anticipation in the heart of the true bride to meet with the bridegroom.  Every step of the long and difficult camel journey brought Rebekah closer to her goal.  There was a loving hope nurtured within her.  She did not really mind the problems and the difficulties on the way because whatever happened brought her closer and closer to her destination. \n\t The journey of the bride to meet the bridegroom is long and filled with many snares.  It is easy to get lost in the wilderness for the roads are not well defined.  The constant help of the Servant is necessary",
		"bible_reading": "Genesis 39:1-41:16 \n Matthew 12:46-13:23 \n Psalm 17:1-15 \n Proverbs 3:33-35 	",
		"image_url": "Empty at the moment",
		"today_command": "Neither murmur ye, as some of them also murmured, and were destroyed of the destroyer.  1 Corinthians 10:10 "
	}, 	
	{
		"devotion_id":19, 
		"devotion_title":"Title 1",
		"devotion": ", “But I fear, lest by any means.........your minds should be corrupted from the simplicity that is in Christ”. \n\t The word ‘simplicity’ does not imply a simpleness; it talks of a singleness of heart.  Paul was concerned that the evil things may take the believers away from the singleness of their heart into something else.  We should know that the serpent always seeks to corrupt that which God has placed within us.  The serpent will try to change what God has said to us in the depths of our beings.  The serpent will try to adjust and  change what God has said.  He will attempt to make it a little easier and more pleasing to our eyes. In Genesis we read, “And he(serpent) said unto the woman(Eve), yea, hath God said.....?”  Satan always wants to place a doubt in our hearts.  He wants to appeal to our carnal desires for something good and pleasing and easy.  That is why Paul warns the Corinthian believers to watch out for the false Jesus, the bogus Gospel and the unholy Spirit.  The enemy somehow enters into the life of even sincere believers to corrupt them in the name of  common sense, reason, knowledge and human wisdom.  The desire for wisdom and knowledge has corrupted  the minds of several people",
		"bible_reading": "Genesis 41:17-42:17 \n Matthew 13:24-46 \n Psalm 18:1-15 \n Proverbs 4:1-6",
		"image_url": "Empty at the moment",
		"today_command": " And Jesus said unto him, Forbid him not: for he that is not against us is for us.  Luke 9:50"
	}, 	
	{
		"devotion_id":20, 
		"devotion_title":"Title 1",
		"devotion": "Many people have moved out of this singleness of purpose in their lives. Their hearts are set upon the things of this world.  Many love the enemy of their husband, the Lord Jesus.  The enemy of the Lord is the world.  The love of the world is to love the enemy of the bridegroom.  “You (are like)  unfaithful wives having illicit love affairs with the world and breaking your marriage vow to God!  Do you not know that being the world’s friend is being God’s enemy?  So whoever chooses to be a friend of the world takes his stand as an enemy of God.”  I have seen that when we counsel some people they are unable to accept our counsel because they are not ‘warm’ towards the Lord any more.  This  happens because they are not single towards His purposes.  They are unable to accept the truth about their spiritual lives.  The sad thing is that they continue to refuse to accept the condition of their heart.  It is only a matter of time for such ones to fall from the purposes of God.  We are here by divine appointment and we must make sure that we do not waste this precious time in worldly pursuits.",
		"bible_reading": "Genesis 42:18-43:34 \n Matthew 13:47-14:12 \n Psalm 18:16-36 \n Proverbs 4:7-10 	",
		"image_url": "Empty at the moment",
		"today_command": "Then Jesus said unto them, Take heed and beware of the leaven of the Pharisees and of the Sadducees  Matthew 16:6"
	}, 	
	{
		"devotion_id":21, 
		"devotion_title":"Title 1",
		"devotion": "“That Spirit is the guarantee of the inheritance”  Ephesians 1:14.  The Holy Spirit baptism that the Lord has poured upon us is the guarantee, the down payment of the inheritance.  There is a full inheritance that will be ours as we progress on in His purposes these days. What is this inheritance?  It is not the temple in Jerusalem; it is not a corner somewhere in heaven, it is not a strip of land in the Middle East.  There is going to be a gathering of all things in One Man, even Christ and His church, of that which is in heaven and in the earth. \n\t May God help us to see this inheritance in Christ.  There is an inheritance which includes all things in the heavens and in the earth.  Let us realize the promises of God that rest upon the bride.    May God help us to be aware of this so that we live in the consciousness of this high calling that is resting upon the bride.\n\t Let us not be like the Corinthian believers who did not realize the call upon their lives.  They did not walk worthy of the call upon their lives.  And they lost the inheritance in their lives.  For this reason Paul says in Ephesians 4:1 “.....walk worthy of the vocation wherewith ye are called”.",
		"bible_reading": "Genesis 44:1-45:28 \n Matthew 14:13-36 \n Psalm 18:37-50 \n Proverbs 4:11-13",
		"image_url": "Empty at the moment",
		"today_command": "Remember Lot's wife.  Luke 17:32 "
	}, 	
	{
		"devotion_id":22, 
		"devotion_title":"Title 1",
		"devotion": "The church cannot move towards and possess the gates of her enemies until and unless each and everyone of us overcomes the enemies within.  When we begin to seek and follow after the Lord’s mind then one who is rich will come to realize that he is actually a poor man.  He will come to understand that he cannot put his trust in riches.  And he will become poor in the sight of the Lord.   The ones who are poor will begin to know that, contrary to the thinking of the world, they are in fact the ones who are rich in the sight of the Lord.  The wise amongst us will discover that they have no wisdom.  The ones who think that they are unwise will begin to say,  “ The wisdom of God is precious in my life.”  The ones who are mighty and strong will begin to realize that they are weak before the Lord. \n\t Let every pride be taken out of our lives; let there be a deliverance in the area of sin and unrighteousness in our lives.  Because of pride we are deprived of many things in the Lord.  The Lord wants us to move as a bride against the enemy and possess all things.  And not only that, this bride must learn to submit to the Lord in her life.  ",
		"bible_reading": "Genesis 46:1-47:31 \n Matthew 15:1-28 \n Psalm 19:1-14 \n Proverbs 4:14-19 	",
		"image_url": "Empty at the moment",
		"today_command": "Take heed to yourselves: If thy brother trespass against thee, rebuke him; and if he repent, forgive him  Luke 17:3 "
	}, 	
	{
		"devotion_id":23, 
		"devotion_title":"Title 1",
		"devotion": "The Lord wants an army, a people, who will go round the walls of Jericho for seven days.  That was a time of preparation.  What were they overcoming?  In those six days as they went round and round Jericho, they were preparing for the victory that was to come on the seventh day.  While they went around the walls for six days, they remained quiet and overcame their eagerness to say, “Praise the Lord.”  The Lord was teaching  and giving them initial lessons in obedience.  The Lord wanted them to go around the city for seven days and not to speak a word till  He would tell them to “shout”.   ManySpirit filled people do not know how to walk without talking! \n\t  There is no place for the zeal of man in our lives.  That’s a hard thing —— to be a prisoner of the Lord for six days  and to shout on the seventh day is the strategy of the living God for the bride. Many times we are overcome with the thought “how shall we handle the enemy out there?”  The Lord says, “Don’t worry, be silent, keep walking. The seventh days is coming. You must shout only when I  tell you to shout .  Then, the walls of the enemy  will  surely fall, for “vengeance is mine, saith the Lord thy God.”",
		"bible_reading": "Genesis 48:1-49:33 \n\t Matthew 15:29-16:12 \n\t Psalm 20:1-9 \n\t Proverbs 4:20-27",
		"image_url": "Empty at the moment",
		"today_command": " If ye love me, keep my commandments.  John 14:15"
	}, 	
	{
		"devotion_id":24, 
		"devotion_title":"Title 1",
		"devotion": "“And out of His mouth goeth a sharp sword,”.   (Revelation 19:5) The sharp sword is not in His hand but in His mouth.  His battle is not with the natural sword.  The thing with the armies of God is that there is a sword which proceeds from every mouth.  The sword is nothing else but the word of God, the two edged sharp sword that will cut everything else in the world.  Therefore, the armies of heaven are allowing the sword to work within, to destroy every enemy in this hour, cutting asunder, dividing the spirit and the soul.   And they are being  prepared until the time when they follow the Captain of their salvation, the king of kings in their lives, — there will be a word that will go out of their mouths that will smite the nations.  Hallelujah! \n\t During the six days the army went around Jericho, the word was working like a sword within and they were submitting themselves to the Lord.  When the seventh day came they used that sword and when they began to speak the word and shout the name of the Lord, by their mouths, the whole wall of the enemy came crumbling dowzn and the army of God became victors.",
		"bible_reading": "Gen 50:1 - Exod 2:10 \n Matthew 16:13-17:9 \n Psalm 21:1-13 \n Proverbs 5:1-6 	",
		"image_url": "Empty at the moment",
		"today_command": "A new commandment I give unto you, That ye love one another; as I have loved you, that ye also love one another.  John 13:34"
	}, 	
	{
		"devotion_id":25, 
		"devotion_title":"Title 1",
		"devotion": " “Stand therefore, having your loins girt about with truth, and having on the breastplate or righteousness;”  Ephesians 1:14, \n\t The girdle of truth is a part of our armour.  It is our  harness and discipline.  The truth of God’s word will bring a restraint.  The girdle of truth will discipline us in the coming days.  It will help us to stick to the path that the Master has chosen for us.  We are indeed living in a very important time in the calendar of God’s purposes.  May be we are those who wandered off from the path that the Lord led us to in the past.  It could be that the word of truth has apprehended our lives in a new way — if so, we shall be girded with the truth so that we do not wander from the appointed ways of the Lord.   We must not wander into paths which are of little relevance to  the ‘bride’, in these days.  The ‘girdle of truth’ must become our harness  lest we wander away into paths that do not please the Master.   God’s word in our lives will keep us from suddenly bolting off  in the direction of some alien path.",
		"bible_reading": "Exodus 2:11-3:22 \n Matthew 17:10-27 \n Psalm 22:1-18 \n Proverbs 5:7-14",
		"image_url": "Empty at the moment",
		"today_command": "Bless them which persecute you: bless, and curse not.  Romans 12:14"
	}, 	
	{
		"devotion_id":26, 
		"devotion_title":"Title 1",
		"devotion": "Many times when we pray to the Lord we try to twist His arm.  If we are honest with ourselves we will acknowledge that we have experienced this in our lives.  We may have known the clear mind of God on certain matters but when pressures came we said, “We shall pray again and seek His mind.”  Finally we  yield to the pressures of men in our lives.  We may have known the mind of God under the conviction of the Holy Spirit;  the word of God may have come to us under the power of the Holy Spirit or we may have made commitments to honour the word of the Lord.  But when the pressures build up we give up and come to a place of saying, “I will seek the mind of the Lord, again.” As a result of having such an attitude God may allow us to go in our own ways.  Let us humbly acknowledge that this has happened in our lives before. \n\t We need to know that when we are set in our minds to go in a particular way, God will allow us to go in our own way.  Under such circumstances God will permit us to follow the dictates of our heart.",
		"bible_reading": "Exodus 4:1-5:21 \n Matthew 18:1-20 \n Psalm 22:19-31 \n Proverbs 5:15-21 	",
		"image_url": "Empty at the moment",
		"today_command": "Let not your heart be troubled: ye believe in God, believe also in me.  John 14:1"
	}, 	
	{
		"devotion_id":27, 
		"devotion_title":"Title 1",
		"devotion": "The Lord gave Lot a chance to escape to the mountains but he did not do so.  He replied,  “Not so, my Lord.”   Lot began to pray that he may be left to go his own way.  He prayed, “God, give me your grace to go my own way .”  On the one hand he said, “Lord you saved my life” and then in the same breath, he complains, “ You are going to kill me by sending me to that mountain.”  The Israelites had the same heart that Lot had!   The word says that they always erred in their hearts. \n\t Finally, Lot said, “This city is very close by”.  Lot was a man of the cities.  He was used to city life.  He was a city -dweller who had close ties with the people of the cities.  He always preferred to be in the cities rather than to be in the wide, open, meadows and pastures.  So on the one hand he was grateful to God for having saved him from the big city (of Sodom and Gomorrah), but  on the other hand, he continued to insist and say,  “I will go to that small city.”  We need to know that when he went to that city of Zoar, the angels did not hold him back from going on in his own ways.  They let him pursue his own path.  Beloved, God will let you go your own way and pursue your own path if you happen to persist in doing your own thing.",
		"bible_reading": "Exodus 5:22-7:25 \n Matthew 18:21-19:12 \n Psalm 23:1-6 \n Proverbs 5:22-23",
		"image_url": "Empty at the moment",
		"today_command": "But if ye have bitter envying and strife in your hearts, glory not, and lie not against the truth. Jam 3:14"
	}, 	
	{
		"devotion_id":28, 
		"devotion_title":"Title 1",
		"devotion": "The Heavenly Father once told His Son, the Lord Jesus to go to the pool of Bethesda.  He went there and saw several people waiting for the angel to stir the water so that the first one to get in would be healed.  There were many sick and diseased people lying all around the healing waters but Jesus healed only one person.  We know that He had a compassionate nature, for let us not forget, that He was the Saviour who had a heart that agonized to reach out to every human soul.  Yet, He saw the mind and the will of the Father to heal only one man.  The evangelists of today would have gone to the pool and healed everyone.  \n\t Have you experienced this in your life?  Have you had a desire to touch every soul who walked in darkness?  Have you experienced a tremendous anointing at some stage accompanied by a very strong desire to heal and comfort others.  Did you simultaneously experience a pressure upon your spirit to abide in the will of God and do nothing other than what He has expressly said?  But we see Jesus  obeyed the Father to the hilt.  That is the way He pleased the Father.  ",
		"bible_reading": "Exodus 8:1-9:35 \n Matthew 19:13-30 \n Psalm 24:1-10 \n Proverbs 6:1-5 	",
		"image_url": "Empty at the moment",
		"today_command": "Rejoicing in hope; patient in tribulation; continuing instant in prayer;  Romans 12:12"
	}, 	
	{
		"devotion_id":29, 
		"devotion_title":"Title 1",
		"devotion": " The apostle Paul declares prophetically about these last days, “For the time will come when they will not endure sound doctrine; but after their own lusts shall they heed to themselves teachers, having itching ears;” (2 Timothy 4: 3).  \n The Greek word for ‘sound’ is ‘hugiano’.  The English word ‘hygiene’ originates from it.  Hence the verse above would read, “For the time will come when they will not endure hygienic teaching....”  Some people tell me, “Brother, they do speak about the glorious church, though I do not accept all that they are doing out there.”  Let me you an example.  If you go to a restaurant you will surely seek an hygienic environment.  Sometimes the food may be delicious but if that good food is unhygienic, what will be the result?  It will adversely affect your health, for sure.  Instead of building you up it will bring about deterioration and decay. Human soul power has become a deceptive counterfeit of the Holy Spirit power in Christendom today.  Much of Christianity is riddled with soul power masquerading as the power of the Holy Spirit.  To discern between soul and Spirit is the great need of the hour, if one is to escape deception.  He that hat an ear to hear, let him hear!  ",
		"bible_reading": "Exodus 10:1-12:13 \n Matthew 20:1-28 \n Psalm 25:1-15 \n Proverbs 6:6-11",
		"image_url": "Empty at the moment",
		"today_command": "Wherefore let him that thinketh he standeth take heed lest he fall.  1 Corinthians 10:12 "
	}, 	
	{
		"devotion_id":30, 
		"devotion_title":"Title 1",
		"devotion": "“Ye have seen what I did unto the Egyptians, and how I bare you on eagles’ wings, and brought you unto myself.” Exodus 19:4 \n\t The Lord says that in bringing out His people from Egypt He carried them on ‘eagles wings’.   That is the way God took His people out of bondage from the land of afflictions.  The Lord is able to provide us the means and the strength to take us into the way of holiness and full salvation.  ‘Eagles’ wings’ refers to the miraculous way by which God is able to redeem us and bring us out of every bondage.  The Pharaoh (dark  forces and evil powers) did his very best to keep the people in bondage but the more the people were afflicted, the more they multiplied (Exodus 1: 7, 20).  The apostle Paul tells us that though sin and unrighteousness may reign,  God is able to deliver us into freedom by the grace that comes  to us through the righteousness of the Lord Jesus Christ.   We may face many problems and situations; we may be confused and perplexed but the Lord knows the way that we should take in every situation.",
		"bible_reading": "Exodus 12:14-13:16 \n Matthew 20:29-21:22 \n Psalm 25:16-22 \n Proverbs 6:12-15",
		"image_url": "Empty at the moment",
		"today_command": "But take heed lest by any means this liberty of yours become a stumblingblock to them that are weak. 1 Corinthians 8:9  "
	}
]