[
	{
		"devotion_id":0, 
		"devotion_title":"Title 0",
		"devotion": "Samuel was very young when he began to seek the Lord, wait upon Him and minister to Him.  Though he lived in the vicinity of the Ark of God, he failed to find the Lord.  But one day the Lord whispered his name “Samuel” in his ears.  Samuel replied God in the affirmative and then ran to Eli.  Evidently, Samuel had been close to where God was hiding,  but He ran in the wrong direction.   Though Samuel heard the Lord and answered Him, he ran in the wrong direction!  Doesn’t this happen to us very often?  We seek the Lord, we also hear Him, but sometimes we get up and run in the wrong direction.  In our immaturity, we often take the things of the Lord to man.  We take heed to the voice of man, thinking that it is the voice of our God!  That is what happened to Samuel.  He ran to Eli thinking that it was Eli’s voice that he had heard!  But the Lord did not give up on Samuel.  He called him again and yet again. It is imperative that we make ourselves available to the Lord when He nudges us.  Beloved, be careful not to run in the opposite direction,  do not run, here and there, or to this and that, but wait before God and hear what He has to say to you.  Many times we hear God whispering into our ears but, alas, we run in the wrong direction and fail to hear the Lord’s word or message to us.  This is how we may have missed what God had for us in the past.",
		"bible_reading": "Ezekiel 1:1-3:15 \n Hebrews 3:1-19 \n Psalm 104:1-23 \n Proverbs 26:24-26  ",
		"image_url": "Empty at the moment",
		"today_command": "Labor not for the meat which perisheth, but for that meat which endureth unto everlasting life,  John 6:27"
	},
	{
		"devotion_id":1, 
		"devotion_title":"Title 1",
		"devotion": "Haste and hurry are the weapons of the insensitive.  Those who desire to share closeness and intimacy with the Maker, will invariably choose to approach His presence adroitly and cautiously.  Haste always mars the advance of the right kind of atmosphere to meet the Lord.  Lingering and waiting in His presence, on the other hand, promotes a feeling of oneness that is essential to enter into His august and awesome presence.  Tragically, in this hurried and hassled age, there is very little that promotes such intimacy!  God’s people look more like a herd of cattle in a stampede than a flock of God beside green pastures and still waters!  Our forefathers knew, it seems, to commune with the Almighty, but do we?  We must learn anew to think deeply, to linger on, to meditate un-hurriedly and to worship meaningfully!  A man of God named Richard Foster said, “Superficiality is the curse of our age.  The doctrine of instant satisfaction is a primary spiritual problem.  The desperate need today is not for a greater number of intelligent people or gifted people but for a deep people!” Saints, do you want to be profoundly aware of His presence, to be in touch with Him at the deepest possible level, to be thinking His thoughts, gleaning His wisdom and living as close to His heart as is humanly possible, positioning your life in the nucleus of His will?",
		"bible_reading": "Ezekiel 3:16-6:14 \n Hebrews 4:1-16 \n Psalm 104:24-35 \n Proverbs 26:27 ",
		"image_url": "Empty at the moment",
		"today_command": "Rejoice in the Lord always: and again I say, Rejoice.  Philippians 4:4"
	}, 	
	{
		"devotion_id":2, 
		"devotion_title":"Title 2",
		"devotion": "When Abraham left Ur of the Chaldees, his nephew Lot accompanied him.   Seeing Lot’s ways, a time came when Abraham felt that they could not move on together in God’s purposes and plans.  He believed that a separation was inevitable and that it was not possible to disregard or overlook it any longer.  Lot had neither seen nor heard God; nor did he have a desire to know the God of Abraham.  Their hearts were divided because Lot’s desires were to always stay in the plains, while Abraham looked for a city whose maker and builder was God.  Lot chose to stay in the plains of Jordan, where the land was fertile and productive.  His heart was not for the higher places.  He always looked for things that were pleasing to the natural man.  Lot chose to live in the lowly plains of the carnal man and not in heights of spirituality.   Even later, in Genesis 19, when the Lord judged Sodom and Gomorrah and saved Lot and his family, the Lord told them to flee to the mountains.  But Lot tried to go another way; he tried to negotiate with God.  Lot asked, “Lord, can’t I go another way?”  Lot said, “You have saved me, you have preserved me, but I cannot go to the mountain You have shown me!”  There are many believers like that.  They want to negotiate their ways with God.  Some do not want to learn how to climb the mountain",
		"bible_reading": "Ezekiel 7:1-9:11 \n Hebrews 5:1-14 \n Psalm 105:1-15\n Proverbs 26:28  ",
		"image_url": "Empty at the moment",
		"today_command": "Let us therefore come boldly unto the throne of grace, that we may obtain mercy, and find grace to help in time of need.  Hebrews 4:16"
	},
	{
		"devotion_id":3, 
		"devotion_title":"Title 0",
		"devotion":  "The restless remnant can be easily distinguished from the multitude of believers that throng the church.  In this hour, we can see the restless remnant expressing the life of Christ in some clearly distinguishable ways.  The symptoms are un-mistakable! \n\t The restless remnant display a compulsive addiction for God.  Man-made programmes make them nauseous.  They are sick of the manipulations of man.\n\t  They abhor all religious calisthenics; they shun activities that do not exhibit a true hunger for the Lord. \n\t They  are weary and tired of passionless worship.  They are wary of every kind of emotional hype that is designed to excite and stir the soul and the flesh of man.\n \t They are allergic to human agendas and programmes\n \t Their hearts are hopelessly desperate for the manifest presence of God.\n\t   ",
		"bible_reading": "Ezekiel 10:1-11:25 \n Hebrews 6:1-20 \n Psalm 105:16-36 \n Proverbs 27:1-2 ",
		"image_url": "Empty at the moment",
		"today_command": "Confess your faults one to another, and pray one for another, that ye may be healed.  Jam 5:16"
	},
	{
		"devotion_id":4, 
		"devotion_title":"Title 1",
		"devotion": "Recalling a servant of God in the Old Testament, we are reminded that Caleb went to Joshua and said, “Give me this mount.”  He did not ask Joshua to give him his portion in the wonderful plains of Jordan, where there was plenty of water for his cattle, and where he could become rich in a short time.  He said, “Give me that mountain.” In other words Caleb said, ‘Do not remove this mountain, do not get it out of the way; give it to me, give me a chance to master it, to bring it under, to gain ascendancy!’  He asked for that which challenged him.  He asked for that which was difficult to overcome.  He said that he wanted to conquer the mountain and overcome every difficulty that came in his way.  How often we say, “Lord I suffered for you, I paid the cost, I went all the way for the gospel, so give me an easy time now.”  We need to be strengthened in our inner man as regards this calling.  Don’t indulge in self-pity or look for the tears of other people.  Avoid the sympathy of the ones who love you and the temptation of ease at the end of a hard day of work.  Be strong in the Lord.  We are called to suffer for the word and the testimony of the Lord.  This calls for the strengthening of our inner man. Caleb was a man given to ascendancy.  He was a true overcomer.  He was willing to work hard, though he was 85 years old.",
		"bible_reading": "Ezekiel 12:1-14:11 \n Hebrews 7:1-17 \n Psalm 105:37-45 \n Proverbs 27:3 	 ",
		"image_url": "Empty at the moment",
		"today_command": "Let us go forth therefore unto him without the camp, bearing his reproach. Hebrews 13:13"
	}, 	
	{
		"devotion_id":5, 
		"devotion_title":"Title 2",
		"devotion": "Often God’s people look to God to perform a painless work in or upon them!  Can a dentist do a painless work?  If you have a cavity in your tooth, your dentist will have to first use a high speed electric drill to remove every deposit deposited there.  The drill must go deep into the tooth to remove anything that will hamper its restoration.  If you request the dentist to repair the tooth painlessly and quickly, he may not agree to your request because the problem could recur if he used the drill sparingly and you would be compelled to visit him again and again.  A good dentist will not agree to fill the cavity without drilling the tooth; he would not risk losing the tooth to save you the pain.  He knows that any kind of patch work, though it may be painless, will not help you in the long run.  Many believers want the Lord to do a painless work upon their lives.  They want to be part of God’s workings today, but they are not willing to go through a painful structuring work of God upon their inner man! They seek a painless cross.  Many believers do not want a painful word.  So they flock around preachers who give them a painless word!   They prefer a short-term painless work to a deep work of the cross upon their lives.  But God wants to do a lasting, deep work upon each one of us by His Spirit even though it is painful.  Are you looking for a painless word or work? ",
		"bible_reading": "Ezekiel 14:12-16:41 \n Hebrews 7:18-28 \n Psalm 106:1-12 \n Proverbs 27:4-6",
		"image_url": "Empty at the moment",
		"today_command": "My son, despise not thou the chastening of the Lord, nor faint when thou art rebuked of him.  Hebrews 12:5"
	},
	{
		"devotion_id":6, 
		"devotion_title":"Title 0",
		"devotion": "“In the year that king Uzziah died I saw also the Lord sitting upon a throne, high and lifted up, and his train filled the temple.” (Isaiah 6:1.)  One significant feature we see in this verse is that Isaiah experienced two things – death and dependence.  On one side there was a death and on the other side there was a dependence upon the living God.  One king had died and another King took his place.  God cannot be king in our lives until all other kings are done away in our lives.  Many times, we depend upon our natural abilities, strengths, mental understandings and available talents.  This shows that we remain dependent on the king of the fleshly realm rather than upon the spiritual King.  If we depend upon the king of the fleshly realm, then the patterns of God’s presence will never be something realistic and we will not be able to experience His manifest presence in our lives.  Isaiah was a close relative of King Uzziah and in many ways he was intimate with the king.  Uzziah was a popular king, but he sinned against the Lord.  We read of Uzziah’s life in the book of Chronicles.  In the beginning of his reign King Uzziah sought the Lord and God made him to prosper (2 Chronicles 26:5), but subsequently he fell from grace because of his sins.",
		"bible_reading": "Ezekiel 16:42-17:24 \n Hebrews 8:1-13 \n Psalm 106:13-31 \n Proverbs 27:7-9 ",
		"image_url": "Empty at the moment",
		"today_command": " Love not the world, neither the things [that are] in the world. If any man love the world, the love of the Father is not in him.  1John 2:15"
	},
	{
		"devotion_id":7, 
		"devotion_title":"Title 1",
		"devotion": "“But when he was strong, his heart was lifted up to his destruction: for he transgressed against the LORD his God, and went into the temple of the LORD to burn incense upon the altar of incense” (2 Chronicles 26:16).  Uzziah’s main sin  and the subsequent cause of his unclean flesh, was that he mishandled the glory of God in presumption.  He transgressed in his presumptuous approach to God.  He insisted to do things his own way, instead of doing them in God’s way.  In his pride, he chose to do things in his own way thinking that he well knew how to do those things.  Beloved we have to be very careful that we do not handle the things of God in presumption.  A presumptuous approach to God will cause us to transgress His holy ways.  Presumptuousness was the cause of Uzziah’s unclean flesh.  We must never try to do things in our own way when it comes to the handling of God’s things.  We need to be very careful.  It is incumbent upon all of us to ever be sensitive and know that we cannot bring our unclean flesh into the things of God.     The priests confronted Uzziah with the provisions of the law of God but he was not willing to receive their corrections.  Many times we continue to do things in presumption and proud disobedience, contrary to what the Lord has made clear to us.",
		"bible_reading": "Ezekiel 18:1-19:14 \n Hebrews 9:1-10 \n Psalm 106:32-48 \n Proverbs 27:10",
		"image_url": "Empty at the moment",
		"today_command": "Rejoicing in hope; patient in tribulation; continuing instant in prayer;  Romans 12:12"
	}, 	
	{
		"devotion_id":8, 
		"devotion_title":"Title 2",
		"devotion": "“And when they were departed, behold, the angel of the Lord appeareth to Joseph in a dream, saying, Arise, and take the young child and his mother, and flee into Egypt, and be thou there until I bring thee word: for Herod will seek the young child to destroy him.  When he arose, he took the young child and his mother by night, and departed into Egypt: And was there until the death of Herod: that it might be fulfilled which was spoken of the Lord by the prophet, saying, Out of Egypt have I called my son.” (Matthew 2:13-15).  There is room for only one king in the economy of God!  When Herod came to know that a King had been born, he was sorely troubled.  Herod not only rejected the baby Jesus, the King of kings, the Lord Jesus, but he passed an order to put Him to death.  The Bible tells us that an angel told Jesus’ father, Joseph, to evacuate baby Jesus to Egypt.  What we need to note is that after going to Egypt, the King of kings never came back to Jerusalem while King Herod lived and reigned.  It was only after the earthly king had died that the Heavenly One, the King of kings, the Lord Jesus, returned, once again to Jerusalem.  Jesus did not return until Herod was dead!  If you are to insist on retaining the ruler-ship over your life, God will just evacuate Himself and wait until something dies in you and despondency is recreated within you!",
		"bible_reading": "Ezekiel 20:1-49 \n Hebrews 9:11-28 \n Psalm 107:1-43 \n Proverbs 27:11 ",
		"image_url": "Empty at the moment",
		"today_command": "And said unto them, Why sleep ye? rise and pray, lest ye enter into temptation. Luke 22:46"
	},
	{
		"devotion_id":9, 
		"devotion_title":"Title 0",
		"devotion": "At one time, I desired that everyone I met should be saved.  I was prepared to even use force, if necessary!  Such was my zeal. However, one day my eyes were opened to realize that Jesus Christ never forced His way upon others.  I can only tell others not to walk in their own wisdom and in their own ways any more, as indeed the Bible says, for what would they do in the end?  The consequences of our choices remain upon each one of us.  This is what the Lord said in the book of Jeremiah, “What will you do in the end?”  What one reaps in the flesh is what was sown in the flesh.  That principle is unchangeable.  We are God’s people and God will forgive us but God’s principle is that you reap what you have sown.  This is an everlasting principle.  God can forgive us for the seeds we sow through our deeds, but we have to face the harvest.  This is very serious for none are exempted.  We may continue to do whatever we want to do and no one will stop us, but there is a loss that is incurred if we sow in the flesh and that is irreversible.  When the consequences of our actions and the effects of our decisions are upon us, what can be done?  Nothing, for it is too late; all we can do is to seek the infinite grace of God.  Little else can be done.  So why should we go our own ways and sow in the flesh today?",
		"bible_reading": "Ezekiel 21:1-22:31 \n Hebrews 10:1-17 \n Psalm 108:1-13 \n Proverbs 27:12",
		"image_url": "Empty at the moment",
		"today_command": "Brethren, let every man, wherein he is called, therein abide with God.  1Corrinthians 7:24"
	},
	{
		"devotion_id":10, 
		"devotion_title":"Title 1",
		"devotion": "In Zephaniah 3, the Lord says that He will gather them who are sorrowful for the ‘solemn assembly’, which refers to the true people or the Church of God.  Zephaniah talks about those who are sorrowful for the reproach that is being fostered upon the Church of Jesus Christ. The burden is for the Church that was born at Pentecost, that was nurtured in the teachings of the apostles and that lives by the doctrine of the Godhead alone.  This alone constitutes the Church of Jesus Christ.  This is the Church (universal and local) that is under terrible attack from the powers of darkness in these last days.  It is this Church of Jesus Christ which is facing the assault of the adversary and his cronies or associates today. This is the church which is under reproach. Let our spiritual eyes be opened to see this reality.  In this hour of shame, disgrace and reproach, God is raising a remnant that is going to weep and groan over the defilement that is entering the Church of Jesus Christ.  The Lord says, “I will gather those to whom the reproach upon the Church has become a burden. I will gather the solemn assembly of those who are sorrowful”.   So the gathering of a solemn assembly is not a matter of fulfilling a theological need, nor does it pertain to any matter of theology, but it is a matter of beholding what really is the Church of Jesus Christ.",
		"bible_reading": "Ezekiel 23:1-49 \n Hebrews 10:18-39 \n Psalm 109:1-31 \n Proverbs 27:13 ", 
		"image_url": "Empty at the moment",
		"today_command": "Marvel not, my brethren, if the world hate you.  1John 3:13"
	}, 	
	{
		"devotion_id":11, 
		"devotion_title":"Title 2",
		"devotion": "There is a clear principle of economics in operation in the spiritual word today. Permit me to go beyond and call it a spiritual industry or evangelical industry!  It is so sad that many are involved in this evangelical industry that has come up to meet the need of God’s people.  You do not know saints, perhaps, of the amount of money that has gone into this industry in many forms.   Today’s, evangelical industry is all set to roll out men and women to meet the need.    God’s people have such a choice in their spiritual life which never existed in any century!  They cannot tolerate the demands of God any longer.  Beloved, if you start trying to follow God according to your desire and you are kind and have sympathy towards such things in your life you are surely entering into the devil’s trap. Many would counter by saying that they do not take part in all that has a stench of commercialism or is marred by the pretentiousness of the evangelical industry.  But the question is, are you a proponent or a well wisher or a customer?   Let me remind you that in the Temple at Jerusalem the Lord Jesus not only cast out those who sold goods but also those who bought them.   If there are no buyers there shall be no sellers!  This is the present abomination. Beloved saints, you and I need to examine our attitudes very carefully.  These are days when the devil is excelling in his work of deception.",
		"bible_reading": "Ezekiel 24:1-26:21 \n Hebrews 11:1-16 \n Psalm 110:1-7 \n Proverbs 27:14",
		"image_url": "Empty at the moment",
		"today_command": "This is the commandment, That, as ye have heard from the beginning, ye should walk in it.  2John 1:6"
	},
	{
		"devotion_id":12, 
		"devotion_title":"Title 0",
		"devotion": "“And said, You master in every form of deception {and} recklessness, unscrupulousness, {and} wickedness, you son of the devil, you enemy of everything that is upright {and} good, will you never stop perverting {and} making crooked the straight paths of the Lord {and} plotting against His saving purposes?” (Acts 13:10)  The Holy Spirit speaking through Paul, a great contender of the faith in his generation, says that the enemy of all righteousness, Satan himself, is always at work perverting the righteous ways of the Lord.  The Greek word for ‘pervert’ is DIASTEPHO, which means “to turn away from and to twist thought out”.  The same word is used in Acts 13:8, but it is translated ‘to turn away’. Hence the Holy Spirit connects the enemy’s efforts to turn some one away from the faith with perverting of the right-ways of the Lord.  Satan’s way has always been to turn and to twist the heart of man to a way other than God’s way.  Remember only God’s way can reach God’s end!  In the phrase “the right ways of the Lord”, the word ’ways’ signifies ‘manner of action, method of proceeding, and the way of progression’.  God’s way is the right way, the straight way, and true way, which is the way of the cross.   It is not easy to discern the ways of evil for we read that he is “full of all subtilty and all mischief…thou enemy of all righteousness” (Acts 13:10).",
		"bible_reading": "Ezekiel 27:1-28:26 \n Hebrews 11:17-31 \n Psalm 111:1-10 \n Proverbs 27:15-16 ",
		"image_url": "Empty at the moment",
		"today_command": "Be ye not unequally yoked together with unbelievers:  2Corrinthians 6:14"
	},
	{
		"devotion_id":13, 
		"devotion_title":"Title 1",
		"devotion": "Parents have a responsibility to provide for every child that they bring into the world, regardless of the marriage situation when they were conceived. We are told in I Timothy 5:8 “But if any provide not for his own, and specially for those of his own house, he hath denied the faith, and is worse than an infidel.” Not only are they responsible to provide for their physical needs, they are also responsible to train all their children in the ways of the Lord. A parent can not teach their children to keep all of God’s commands, if the parent has willfully chosen to continue to live in sin in an adulterous remarriage relationship. More is caught than taught, and the children will not learn to keep all of God’s commands as they should. \n\t The children receive a greater spiritual training if they see their parents willing to make whatever sacrifices and hard, hard decisions that are necessary to be in a right relationship with Jesus Christ. Remaining in a remarriage situation for the sake of the children, and living in sin, will not in the long run be a benefit for their children. The children will grow up with the perception that one can do what is right in their own eyes.",
		"bible_reading": "Ezekiel 29:1-30:26 \n Hebrews 11:32-12:13 \n Psalm 112:1-10 \n  Proverbs 27:17 ",
		"image_url": "Empty at the moment",
		"today_command": "Submitting yourselves one to another in the fear of God. Ephesians 5:21"
	}, 	
	{
		"devotion_id":14, 
		"devotion_title":"Title 2",
		"devotion": "Abraham did his own thing rather than following the Lord, and took Hagar and had a son by her. After Isaac was weaned, because of Ishmael’s scoffing, Sarah asked Abraham to send Hagar and Ishmael away. Sarah did not feel that Ishmael deserved to receive an inheritance with Isaac. Abraham was very displeased by Sarah’s request because Ishmael was his son. However, God told him to not let it be displeasing to him and to send Hagar and Ishmael away. Abraham arose early the next morning and obeyed God’s command promptly and sent them away. Gen. 21:8-21. These are painful experiences people have to go through as consequences of wrong decisions and actions, despite the forgiveness they have received over such actions in their lives. \n\t Another account is in Ezra 9:1-15 and 10:1-44, where many of the Israelites were involved in wrong marriages. They had married foreign wives and many had children by those wives. They recognized that they had sinned against God (10:2). The solution to the situation of the wrong marriages was that they needed to put away the wives and the children that they had by those wives. It was a difficult situation and one that was very difficult to have the courage to deal with. It was so difficult that the Godly Ezra had to be prodded to take his responsibility as spiritual leader and deal with the situation.",
		"bible_reading": "Ezekiel 31:1-32:32 \n Hebrews 12:14-29 \n Psalm 113:1-114:8 \n Proverbs 27:18-20 ",
		"image_url": "Empty at the moment",
		"today_command": " Wherefore comfort yourselves together, and edify one another, even as also ye do. 1Thessalonians 5:11"
	},
	{
		"devotion_id":15, 
		"devotion_title":"Title 0",
		"devotion": "Jesus’ sole desire was to always remain in a realm of intimacy, union and close fellowship with the Father.  In other words, He always wanted to live by way of a close union and fellowship with the Father.  And this place and position became the very ground for all the conflict that He had to face in His life!  May the Holy Spirit open your heart to understand this!  It was this union, intimacy and relationship with the Father that became the reason and occasion for all the battles and conflict in the life of the Son.  It is the same for us in our lives.  Beloved, my personal prayer is that the occasion of all the conflicts in my life may be because my intimacy and union with the Father!  May that be your prayer too!  The enemy will surely not take this lying down, when we come into a closer fellowship with the Father.  Just as the relationship and fellowship of the Son with His Father became the focal point of the enemy’s attack and assault upon the Son all through His life, so also it will be with us.  The demonic forces always focused their whole attention upon the Son on account of the union, the intimacy, the relationship and the fellowship He had with the Father.  The evil one and all his evil powers will concentrate their might against God’s remnant as they  come into a closer oneness and intimacy with the Father. ",
		"bible_reading": "Ezekiel 33:1-34:31 \n Hebrews 13:1-25 \n Psalm 115:1-18 \n Proverbs 27:21-22 ",
		"image_url": "Empty at the moment",
		"today_command": "O Timothy, keep that which is committed to thy trust. 1 Timothy 6:20"
	},
	{
		"devotion_id":16, 
		"devotion_title":"Title 1",
		"devotion": "“And there sat in a window a certain young man named Eutychus, being fallen into a deep sleep: and as Paul was long preaching, he fell sunk down with sleep, and fell down from the third loft, and was taken up dead.”  (Acts 20:9).  We see in him a man who chose to sit at the extreme edge of the window sill, so that he may hear the Word of God.  He is a picture of a man who wants to enjoy everything that is happening in the world outside.  At the same time, he also does not want to miss what is happening within the walls. Such people want to have double benefits - that of the natural world, as well as that of the spiritual realm. People like Eutychus desire to hear the Word of God, but they are not able to benefit from the Word. Like Eutychus who fell from the window, and almost died, they lose the essence of the life they receive from the Spirit of God.  Let us not be people who prefer to sit on the fence, between the earthly and the heavenly realms!\n\t The Lord Jesus was born from above, and we know that He lived unto heaven. Every day, His heart’s desire and longing was to be found in line with the heavenly purpose. This is the desire of God for our lives as well. The way things are in heaven, must also be upon the earth. Let us pursue this heavenly path with vigour.",
		"bible_reading": "Ezekiel 35:1-36:38 \n James 1:1-18 \n Psalm 116:1-19 \n Proverbs 27:23-27 ",
		"image_url": "Empty at the moment",
		"today_command": " O Timothy, keep that which is committed to thy trust. 1 Timothy 6:20"
	}, 	
	{
		"devotion_id":17, 
		"devotion_title":"Title 1",
		"devotion": "Beloved, faithful praying will not keep you from crisis, or from struggles and difficulties.  On the contrary, in all likelihood, you will end up in a fired-up furnace or a lion’s den, as it happened to Daniel and His compatriots who were strong men of prayer!   Their desire to remain pure and uncorrupted at a time of great apostasy, their faithful prayer and commitment, and their seeking the Lord’s face took them to greater crises and challenges!  However, they had prepared themselves.  Prayer will prepare us to face the challenges ahead, trusting the Lord.  This is how we can become a living sacrifice for Jesus’ sake.  Remember, seeking the face of your Lord will prepare you to face your furnace.  Opening your windows towards spiritual Jerusalem, so that you can pray for God’s glorious church without spot and wrinkle, may cause you to face the lions in the world’s amphitheaters, but praise the Lord, your commitment to seek the Lord will prepare and strengthen you to stand in your time of trial and crisis.  That is God’s assurance to us.  Daniel’s prayer and his commitments led him to the lion’s den!  This trial came upon Daniel many years after three of his friends had gone through the fire in a trial of faith.   Do you know Daniel was about eighty years of age when he was thrown to the lions? This may intimidate some of us!",
		"bible_reading": "Ezekiel 37:1-38:23 \n James 1:19-2:17 \n Psalm 117:1-2 \n Proverbs 28:1",
		"image_url": "Empty at the moment",
		"today_command": "And seek not ye what ye shall eat, or what ye shall drink, neither be ye of doubtful mind. Luke 12:29"
	}, 
	{
		"devotion_id":18, 
		"devotion_title":"Title 2",
		"devotion": "As young David brought some food to his brothers in the battlefield he could see there was a backslidden king who was afraid and petrified. Even today there is a backslidden, weak, feeble, insipid, irresolute church system not able to stand up to the Goliaths of this day despite all the seminars conferences, satellite communication systems, advanced printing technology and management techniques. Goliath, the evil, corrupted, selfish, pleasure-seeking world system is still stand­ing up to say, “Is there none among you who can come and fight me”. The spiritual system with its computer aids, multinational support, management vices, and greed and self-seeking methods is crippled, unable to face the might of Goliath. But there was a young lad, anointed of God, whose heart was towards the things of God. David was not going forth to fight his own battle but he was venturing into a battle for his God. Many of us are tired fighting our own battles. It is time to arise to the Lord and be occupied with the Lords battles. There was a man after God’s heart who rose up beyond human abilities. Something rose up within him to defy that giant who challenged the very existence of Israel. He forgot his food, his family, his household and his father’s sheep and he responded to the voice of God. Beloved, God is looking for a people who will respond to God’s order.",
		"bible_reading": "Ezekiel 39:1-40:27 \n James 2:18-3:18 \n Psalm 118:1-18 \n Proverbs 28:2  ",
		"image_url": "Empty at the moment",
		"today_command": "But to do good and to communicate forget not: for with such sacrifices God is well pleased.   Hebrews 13:16 "
	},
	{
		"devotion_id":19, 
		"devotion_title":"Title 0",
		"devotion": "What are you caught up with?  What are you doing?  These are very important questions concerning your spiritual life.  God’s people will have to be open to the Spirit of God and be responsible. It is not a matter of having some mental knowledge of things and doing some activities in His name. It is time to be concerned about your spiritual health, your maturity, your walk with the Lord so that the man of God may be made complete.  Every bit of undigested food in your spiritual system will work adversely and cause inward decay. Do you know that the Word you have disobeyed in your life can work negatively and have negative results?  Yes, it will make you sick and weaken you spiritually.  Saints, let us therefore turn to the Lord and ask the Lord to heal us.  A life of obedience, a heart to submit, a heart that is open for reprove (2 Tim 3:16), a heart that is open for correction, a heart that is ready to yield to the Lord speak of a healthy digestive system.    We are all called to obey God.  Instead of that, if you go to any man for deliverance you can be certain that your true spiritual need will not be met.  Only God can deliver us from the spiritual sickness that stems from our disobedience. If we fail to obey Him, our lives will be adversely affected.",
		"bible_reading": "Ezekiel 40:28-41:26 \n James 4:1-17 \n Psalm 118:19-29\n Proverbs 28:3-5",
		"image_url": "Empty at the moment",
		"today_command": "Rejoice with them that do rejoice, and weep with them that weep. Romans 12:15"
	},
	{
		"devotion_id":20, 
		"devotion_title":"Title 2",
		"devotion": "Led by the Spirit of God, Simeon entered into the Temple (Luke 2:25-30).  It is necessary for us to understand that Simeon lived at a time when the spiritual state of things was altogether terrible.  The Old Testament had come to a close with the Book of Malachi revealing the terrible condition of the people at that time.  People did not have the fear and the love of God.  The sacrifices to God were polluted. How did Simeon, who sat expectantly in the temple all day, know about a holy Child who had been born in their midst? How could he know who that Baby was?  The answer is that Simeon came to the temple led of the Spirit and alive in the Spirit.  He was a man who maintained a spiritual height despite the surrounding religious decline.  He maintained a spiritual walk despite the discouraging religiosity.  He was led of the Holy Ghost and the Holy Ghost was upon him.  When Simeon entered the temple he was actively alive to the Holy Spirit.\n\t Simeon means ‘hearing’ in Hebrews.  That is what is so significant! Simeon heard.  He was one who heard!  True hearing involves hearing, believing, obeying and walking.  That is what the name Simeon signifies.",
		"bible_reading": "Ezekiel 42:1-43:27 \n James 5:1-20 \n Psalm 119:1-16 \n Proverbs 28:6-7 	",
		"image_url": "Empty at the moment",
		"today_command": "Wherefore come out from among them, and be ye separate, saith the Lord, and touch not the unclean thing. 2 Corinthians 6:17"
	},
	{
		"devotion_id":21, 
		"devotion_title":"Title 0",
		"devotion": "You may read Isaiah chapters 1 to 5 and you may notice their contents and context. But after Isaiah experienced the glory of the Lord, he began to prophesy quite differently from the way he had been doing.  After chapter six of the book of Isaiah, we encounter sixty more chapters of incredible prophecies, prophetic declarations and prophetic visions.  Isaiah’s life after chapter six when he saw the Lord high and lifted up, was drastically different.  The coal of the altar touched his lips and brought about a radical change in his life.  The way he began to see things thereafter were totally different.  Amazingly, Isaiah began to prophesy about the Messiah in words that astound us chapter after chapter:  “ For unto us a child is born, unto us a son is given: and the government shall be upon his shoulder: and his name shall be called Wonderful, Counseller, The mighty God, The everlasting Father, The Prince of Peace” and so goes on his declarations of God.  Beloved, an encounter with the Lord and a beholding of the Lord is going to bring such tremendous changes in our lives that we will be ever amazed.  If we ever see Him we are going to be totally changed.  Beholding will change us.  Suddenly, the person and the presence of the Lord is all that will be reflected in our lives.",
		"bible_reading": "Ezekiel 44:1-45:12 \n 1 Peter 1:1-12 \n Psalm 119:17-32 \n Proverbs 28:8-10",
		"image_url": "Empty at the moment",
		"today_command": " Put on therefore, as the elect of God, holy and beloved, bowels of mercies, kindness, humbleness of mind, meekness, longsuffering.  Colossians 3:12"
	},
	{
		"devotion_id":22, 
		"devotion_title":"Title 1",
		"devotion": "“I John, who also am your brother, and companion in tribulation, and in the kingdom and patience of Jesus Christ, was in the isle that is called Patmos, for the word of God, and for the testimony of Jesus Christ. “ (Revelation 1:9).  We can see here four important qualities about this corporate 'man'. Through fellowship they are brothers; through tribulations, they are companions; through the kingdom, they are submitted to His lordship; and through patience, they are being tested and tried and purged, that their faith might come forth as gold. The many-membered new man, which is the true Church, the Body of Christ, is a company of brothers, along with John, the apostle. But they are not like ordinary brothers who come to blows when their father goes out!  The true Christian fellowship is unique in every way: For one, only those who walk in the light of His word and His life (1 John 1:7) have true fellowship.  We can only be brethren through fellowship with one another. The true body of Christ comprises those who have an intimate fellowship with the Head and with one another. God is calling us into a genuine, perfect fellowship.",
		"bible_reading": "Ezekiel 45:13-46:24 \n 1 Peter 1:13-2:10 \n Psalm 119:33-48 \n Proverbs 28:11 ",
		"image_url": "Empty at the moment",
		"today_command": "As the Father hath loved me, so have I loved you: continue ye in my love  John 15:9 "
	}, 	
	{
		"devotion_id":23, 
		"devotion_title":"Title 2",
		"devotion": "The woman, who had a disease of the blood for twelve years, sought a healing touch from the Lord (Mark 5:25-34).  However, so many people crowded around Him.  Somehow, she stretched forth her hand, and touched the hem of His garment by faith.  Although many people surrounded Jesus and left no place for the woman to meet Him, yet she was able to reach out and touch His robe.  That was something tremendous!  She reached out for His Presence in spite of every difficulty.\n\t When Jesus walked upon the earth, there were many who followed the Lord, but they never really knew the nearness of His Presence.  There were many who thought that they were close to the Lord, but they never knew the true Presence of God in their lives.  Several people walked in close proximity to the Lord, but they were not able to experience His Presence in an intimate way.  It is the same today.  Many people follow Christ, His teachings and His precepts, but few are able to know Him in an intimate manner.  In the midst of today’s general clamour for the Lord’s Presence, some are reaching out to touch and behold the Lord Jesus in this hour.",
		"bible_reading": "Ezekiel 47:1-48:35 \n 1 Peter 2:11-3:7 \n Psalm 119:49-64 \n Proverbs 28:12-13",
		"image_url": "Empty at the moment",
		"today_command": " Seeing ye have purified your souls in obeying the truth through the Spirit unto unfeigned love of the brethren.  1Peter 1:22"
	},
	{
		"devotion_id":24, 
		"devotion_title":"Title 0",
		"devotion": "“They are doomed and their fate (is) eternal misery (perdition); their god is their stomach (their appetites, their sensuality) and they glory in their shame, siding with earthly things and being of their party.”   (Phil 3:19 Amplified Bible).  It is very clear that for some “God is their belly” and “their god is their stomach”.    The Apostle Paul here talks about false teachers, for the whole chapter deals with this matter.  He says that their god is their belly, their appetite and their sensuality.  They are serving or worshiping their appetite and their sensuality.  They are mainly concerned about the satisfaction of their sensual desires.   To worship one’s belly means to be ruled by our own way, our own will and our own desire!  There are people whose own way is their god.  They are only concerned with their sensuality, their desires of their senses.  Their own wills, their ways, and their desires, are all that matters to them.  They worship their own selves for to them their own interests are their gods.  This can happen to any one of us for we know how strong our own will is; we know how our wants and desires grip us.  God wants to break that kind of mentality in us.  God wants to do a new work in our bellies, He wants to dig into our innermost being, but He is waiting to see if a price has been paid by us.  We must understand the realities that exist in our lives.",
		"bible_reading": "Daniel 1:1-2:23 \n 1 Peter 3:8-4:6 \n Psalm 119:65-80 \n Proverbs 28:14 ",
		"image_url": "Empty at the moment",
		"today_command": " Forasmuch then as Christ hath suffered for us in the flesh, arm yourselves likewise with the same mind:  1 Peter 4:1"
	},
	{
		"devotion_id":25, 
		"devotion_title":"Title 1",
		"devotion": "It is not our perfection but our passion that will cause the Lord to descend from His infinite, heavenly realm to our finite, earthly realm.  Amen ! \n\t God takes our imperfect praise and perfects it in His own ears.  O how we praise God for this!  Our Heavenly Father does it in the same way as that of a natural mother does with her baby. Though a baby cannot utter even two words, the mother understands all that the baby expresses.  Those imperfect syllables are perfected!  Oh my God, every imperfect syllable from a child of God is perfected in the Father’s ears.  This is how our God knows every one of our unspoken & broken and imperfect expressions.   God is not looking for perfect beings on the earth; He is looking for passionate, broken and contrite hearts.  I thank God that He will perfect their imperfect praise in His ears.  Jesus said, “Out of the mouth of babes and suckling thou hast perfected praise?” (Matt 21:16).  The Father perfects the incomplete, juvenile expressions of His children.  Even our broken, incomplete syllables, our imperfect expressions, and our inadequate love will be perfected by God in His ears in these days.  His heart is moved when He hears the cries of redeemed children.",
		"bible_reading": "Daniel 2:24-3:30 \n 1 Peter 4:7-5:14 \n Psalm 119:81-96 \n Proverbs 28:15-16",
		"image_url": "Empty at the moment",
		"today_command": " For consider him that endured such contradiction of sinners against himself, lest ye be wearied and faint in your minds.  Hebrews 12:3"
	}, 	
	{
		"devotion_id":26, 
		"devotion_title":"Title 2",
		"devotion": "“Behold, bless ye the LORD, all ye servants of the LORD, which by night stand in the house of the LORD. Lift up your hands in the sanctuary, and bless the LORD. The LORD that made heaven and earth bless thee out of Zion.” (Ps 134:1-3).  From his room in the palace, David was able to see the priestly Levites and the servants of the Lord, standing around the mercy seat in the Tabernacle all night.  It would be dark all around, but the house of the Lord would be lit up with the light of burning torches.  The priests would bless, worship and seek the Presence of the Lord.  This is the background to the hymn, “Come bless the Lord” that we so often sing in the house of God, even today.  Yes, we lift up our hands in the sanctuary today, but do we really have the kind of heart that the singers had in the days of old?  Day and night worshippers stood before the Presence of the Lord.  They kept the heavens above them open with their praises and worship.  It was as if they were holding open, heaven, with their upraised hands!  In the quietness of his palatial abode, David rejoiced in his heart and longed to be in the midst of all that was happening in the Tabernacle at midnight.  He longed to be in the courts of the Lord and in the Presence of the Lord, even in the middle of the night.  ",
		"bible_reading": "Daniel 4:1-37 \n 2 Peter 1:1-21 \n Psalm 119:97-112 \n Proverbs 28:17-18 ",
		"image_url": "Empty at the moment",
		"today_command": " But let patience have her perfect work, that ye may be perfect and entire, wanting nothing.  James 1:4"
	},
	{
		"devotion_id":27, 
		"devotion_title":"Title 0",
		"devotion": " “And when Moses saw that the people were unruly and unrestrained (for Aaron had let them get out of control, so that they were a derision and object of shame among their enemies),”   (Ex 32:25TLB)   The Spirit shows us that when the people were naked, “they were a derision and shame before their enemies.”  In other words, in this condition, God’s chosen people were made a mockery and ridicule in front of the enemy.  There is one thing that the enemy and all the hosts of enemies in the heavenlies are set upon to do—that is to make the church of Jesus Christ derision, a mockery and ridicule in the universe.  This is the strategy of the enemy.  The enemy desires to do this so that the world may look upon the church and say that it has become a part of the world.  All that the enemy wants to do is to make God’s chosen nation a laughing stock in the eyes of the world.   Then people would say, “Is this the church of Jesus Christ?  Is this the best that their God can do?   The situation is exactly as it was in the days of Moses.  It is my prayer that God may open your eyes to see, as Moses saw, that the Aarons of today have let the people live unruly and unrestrained lives.  They have allowed the people of God to go out of control, so that the church has become an object of shame among their enemies! ",
		"bible_reading": "Daniel 5:1-31 \n 2 Peter 2:1-22 \n Psalm 119:113-128 \n Proverbs 28:19-20",
		"image_url": "Empty at the moment",
		"today_command": " And let the peace of God rule in your hearts, to the which also ye are called in one body; and be ye thankful.  Colossians 3:15"
	},
	{
		"devotion_id":28, 
		"devotion_title":"Title 1",
		"devotion": "David’s life was a delight to the Lord.  He arose in the middle of the night; he heard the Levites chanting, singing and worshipping; he heard the clanging sound of cymbals  and his heart yearned for the courts of the Lord.  His heart longed to meet the Lord. “Now it came to pass, as David sat in his house, that David said to Nathan the prophet, Lo, I dwell in an house of cedars, but the ark of the covenant of the LORD remaineth under curtains.” (1 Chronicles 17:1)  Look at David’s heart!  Even in his meditations at night, his thoughts did not stray away from God and His Presence!   “LORD, remember David, and all his afflictions: How he sware unto the LORD, and vowed unto the mighty God of Jacob;  Surely I will not come into the Tabernacle of my house, nor go up into my bed; I will not give sleep to mine eyes, or slumber to mine eyelids, Until I find out a place for the LORD, an habitation for the mighty God of Jacob.” (Ps 132:1-5).  May be, God responded to the cries of David with words such as these.  “My son, I see the deep longing of your heart for My Presence.  As you seek to please me, know that My desire is not to have some kind of Tabernacle or traditional abode.  My son, a simple tent will meet My need. All I am looking for is a simple tent!  But keep your heart hot and aflame for Me and for My Presence in your life.” ",
		"bible_reading": "Daniel 6:1-28 \n 2 Peter 3:1-18 \n Psalm 119:129-152\n Proverbs 28:21-22 ",
		"image_url": "Empty at the moment",
		"today_command": "Give attendance to reading, to exhortation, to doctrine. 1 Timothy 4:13"
	}, 	
	{
		"devotion_id":29, 
		"devotion_title":"Title 2",
		"devotion": "In the Book of the Acts we find that the early disciples went forth for the sake of the Name. That is, they went out into the world for the sake of His Name. They went out in life and service for the Name of the Lord Jesus. We read in Acts 5:40, “and when they had called the apostles, and beaten them, they commanded that they should not speak in the name of Jesus, and let them go.”  They counted it joy to suffer for the sake of His Name for we read, “And they departed from the presence of the council, rejoicing that they were counted worthy to suffer shame for his name.” They counted it an honour to be found worthy to suffer for the sake of the Name. When Paul was converted, and led by hand into Damascus, the Lord said to Ananias, “Go thy way: for he is a chosen vessel unto me, to bear my name before the Gentiles, and kings, and the children of Israel:  For I will shew him how great things he must suffer for my name’s sake.” (Acts 9:15-16).  We must have some measure of character and manner of life to suffer for the sake of the Name.  The Word says, “Whatsoever ye do in word or deed, do all in the Name of the Lord Jesus.”(Col 3:17) This implies that our character, conduct, behaviour, temperament and disposition must be correct for the sake of the Name. What we are in ourselves, and how we behave in this world, touches the Name of Jesus.  The Apostle Paul truly suffered for His Name by relinquishing all his previous ways and his rights.",
		"bible_reading": "Daniel 7:1-28 \n 1 John 1:1-10 \n Psalm 119:153-176 \n Proverbs 28:23-24",
		"image_url": "Empty at the moment",
		"today_command": " If any man desire to be first, [the same] shall be last of all, and servant of all. Mark 9:35"
	}	

]